[
  {
    "title": "Citrus Zest Breakfast Muffins",
    "tag_names": [
      "Breakfast",
      "Breads"
    ],
    "description": "Delicious breakfast muffins with a refreshing citrus flavor.",
    "yield": "Makes 12 muffins",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "2 cups all-purpose flour\n1/2 cup sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\nZest of 1 orange\nZest of 1 lemon\n1/2 cup unsalted butter, melted\n1 cup milk\n1 egg\n1 teaspoon vanilla extract",
    "instructions": "Preheat the oven to 375°F (190°C) and line a muffin tin with paper liners.\nIn a mixing bowl, combine the flour, sugar, baking powder, salt, and citrus zest.\nIn a separate bowl, whisk together the melted butter, milk, egg, and vanilla extract.\nPour the wet ingredients into the dry ingredients and mix until just combined.\nDivide the batter evenly among the muffin cups.\nBake for 18-20 minutes, or until a toothpick inserted into the center comes out clean.\nRemove from the oven and let cool before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/citrus-zest-breakfast-muffins.png"
  },
  {
    "title": "Thai Peanut Noodle Salad",
    "tag_names": [
      "Lunch",
      "Entrees",
      "Salads"
    ],
    "description": "A refreshing and flavorful Thai-inspired salad with peanut dressing.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "8 oz rice noodles\n1/2 cup peanut butter\n3 tbsp soy sauce\n2 tbsp rice vinegar\n2 tbsp honey\n1 tsp sesame oil\n1 garlic clove, minced\n1/2 inch ginger, grated\n1 red bell pepper, thinly sliced\n1 carrot, julienned\n1/4 cup chopped cilantro\n1/4 cup chopped peanuts\nLime wedges for garnish",
    "instructions": "Cook the rice noodles according to package instructions, then rinse with cold water and set aside.\nIn a small bowl, whisk together peanut butter, soy sauce, rice vinegar, honey, sesame oil, garlic, and ginger to make the dressing.\nIn a large bowl, combine the cooked noodles, red bell pepper, carrot, and cilantro.\nPour the dressing over the noodle mixture and toss to coat everything evenly.\nTop the salad with chopped peanuts and serve with lime wedges on the side.\nEnjoy your delicious Thai Peanut Noodle Salad!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/thai-peanut-noodle-salad.png"
  },
  {
    "title": "Tuscan Pesto Pasta Medley",
    "tag_names": [
      "Entrees"
    ],
    "description": "A flavorful and aromatic pasta dish inspired by Tuscan cuisine. This medley combines the richness of pesto with a variety of fresh and colorful ingredients.",
    "yield": "Serves 4-6",
    "active_time": "25 minutes",
    "total_time": "45 minutes",
    "ingredients": {
      "pasta": "12 oz. penne pasta",
      "pesto": "1 cup homemade or store-bought pesto sauce",
      "cherry tomatoes": "1 cup halved cherry tomatoes",
      "black olives": "1/2 cup sliced black olives",
      "bell peppers": "1 each red and yellow bell peppers, diced",
      "artichoke hearts": "1 can (14 oz.) artichoke hearts, drained and chopped",
      "parmesan cheese": "1/2 cup grated parmesan cheese",
      "salt and pepper": "to taste"
    },
    "instructions": "Cook the penne pasta according to package instructions until al dente. Drain and set aside.\nIn a large bowl, combine the cooked pasta, pesto sauce, cherry tomatoes, black olives, bell peppers, and artichoke hearts. Toss until well mixed.\nAdd salt and pepper to taste, and sprinkle grated parmesan cheese over the top.\nServe the Tuscan Pesto Pasta Medley warm, garnished with additional parmesan cheese if desired. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/tuscan-pesto-pasta-medley.png"
  },
  {
    "title": "Creamy Berry Cheesecake Cups",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicious individual servings of creamy cheesecake with a burst of fresh berries, perfect for a special dessert.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "4 hours (including chilling time)",
    "ingredients": "1.5 cups graham cracker crumbs\n1/4 cup granulated sugar\n1/2 cup unsalted butter, melted\n8 oz cream cheese, softened\n1/2 cup powdered sugar\n1 tsp vanilla extract\n1 cup heavy cream\n1.5 cups mixed fresh berries (such as raspberries, blueberries, strawberries)\nAdditional berries for topping",
    "instructions": "In a medium bowl, combine graham cracker crumbs, granulated sugar, and melted butter. Mix well.\nDivide the crumb mixture evenly among 6 serving cups and press down to form the crust.\nIn a large bowl, beat the cream cheese until smooth. Add powdered sugar and vanilla extract, mix until well combined.\nIn a separate bowl, whip the heavy cream until stiff peaks form.\nGently fold the whipped cream into the cream cheese mixture.\nGently fold in the mixed berries, reserving some for topping.\nDivide the cheesecake mixture evenly among the prepared serving cups over the crust.\nChill in the refrigerator for at least 3 hours, or until set.\nBefore serving, top each cup with additional berries.\nEnjoy these creamy berry cheesecake cups!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/creamy-berry-cheesecake-cups.png"
  },
  {
    "title": "Spiced Chai Latte Bombs",
    "tag_names": [
      "Beverages",
      "Desserts"
    ],
    "description": "Delicious spiced chai latte bombs that are perfect for cozy evenings or mornings.",
    "yield": "Makes 8 bombs",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "2 cups all-purpose flour\n1/2 cup sugar\n1 tsp ground cinnamon\n1/2 tsp ground ginger\n1/4 tsp ground cardamom\n1/4 tsp ground cloves\n1/4 tsp ground nutmeg\n1/2 cup unsalted butter, cold and cut into small cubes\n1/3 cup milk\n2 tbsp honey\n1 tsp vanilla extract\n8 cubes of your favorite chocolate",
    "instructions": "In a large mixing bowl, combine the flour, sugar, cinnamon, ginger, cardamom, cloves, and nutmeg.\nAdd the cubed butter to the dry ingredients and mix until crumbly.\nIn a small saucepan, heat the milk, honey, and vanilla extract until warm.\nPour the warm milk mixture into the dry ingredients and mix until a dough forms.\nDivide the dough into 8 equal portions. Flatten each portion and place a cube of chocolate in the center. Shape the dough into balls, ensuring the chocolate is completely enclosed.\nPlace the balls on a baking sheet and bake at 350°F (175°C) for 20-25 minutes, or until lightly golden.\nAllow the chai latte bombs to cool slightly before serving. Enjoy with a warm cup of chai latte!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spiced-chai-latte-bombs.png"
  },
  {
    "title": "Golden Crispy Onion Rings",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious and crispy onion rings that are the perfect appetizer or side dish.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "2 large onions, sliced into rings\n1 cup all-purpose flour\n1 tsp salt\n1/2 tsp black pepper\n1 tsp garlic powder\n1 tsp paprika\n1 cup buttermilk\n2 cups panko breadcrumbs\nOil for frying",
    "instructions": "In a bowl, combine the flour, salt, pepper, garlic powder, and paprika.\nDip the onion rings into the buttermilk, then coat in the seasoned flour mixture.\nDip the coated onion rings back into the buttermilk, then coat in the panko breadcrumbs.\nHeat oil in a deep fryer or large pot to 350°F (180°C).\nFry the onion rings in batches for 2-3 minutes, or until golden and crispy.\nRemove with a slotted spoon and drain on paper towels.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/golden-crispy-onion-rings.png"
  },
  {
    "title": "Rosemary Olive Focaccia",
    "tag_names": [
      "Breads",
      "Appetizers"
    ],
    "description": "This delicious focaccia is flavored with rosemary and olives, making it a savory and aromatic bread perfect for sharing with loved ones.",
    "yield": "1 loaf, serves 8",
    "active_time": "30 minutes",
    "total_time": "2 hours",
    "ingredients": "4 cups all-purpose flour\n2 1/4 tsp active dry yeast\n1 1/2 cups warm water\n1/4 cup extra-virgin olive oil\n1 1/2 tsp salt\n2 tbsp chopped fresh rosemary\n1/2 cup pitted and sliced olives (Kalamata or black olives)",
    "instructions": "In a large bowl, combine the flour and yeast. Make a well in the center and pour in the warm water. Let sit for 5 minutes until foamy.\nAdd the olive oil and salt to the flour mixture. Stir until a dough forms.\nKnead the dough on a floured surface for about 10 minutes until smooth and elastic.\nPlace the dough in a greased bowl, cover with a clean kitchen towel, and let rise in a warm place for 1 hour or until doubled in size.\nPunch down the dough and transfer it to a greased baking sheet. Press the dough out to cover the sheet.\nDimple the dough with your fingers, then top with chopped rosemary and olives. Drizzle with extra olive oil.\nLet the dough rise for another 30 minutes. Meanwhile, preheat the oven to 400°F (200°C).\nBake the focaccia for 20-25 minutes until golden brown and cooked through.\nCool slightly before slicing and serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/rosemary-olive-focaccia.png"
  },
  {
    "title": "Summer Berry Quinoa Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and nutritious salad perfect for the summer season.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup quinoa\n1 1/2 cups water\n1 cup mixed berries (such as strawberries, blueberries, raspberries)\n1/4 cup chopped fresh mint leaves\n1/4 cup chopped almonds\n2 tbsp honey\n2 tbsp balsamic vinegar\nSalt and pepper to taste",
    "instructions": "Rinse the quinoa thoroughly under cold water.\nIn a medium saucepan, bring the water to a boil and add the quinoa. Reduce heat to low, cover, and simmer for 15 minutes or until the water is absorbed and the quinoa is tender.\nFluff the cooked quinoa with a fork and let it cool to room temperature.\nIn a large mixing bowl, combine the cooked quinoa, mixed berries, chopped mint leaves, and almonds.\nIn a small bowl, whisk together the honey, balsamic vinegar, salt, and pepper to make the dressing.\nDrizzle the dressing over the quinoa salad and toss gently to combine.\nServe the summer berry quinoa salad chilled or at room temperature.\nEnjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/summer-berry-quinoa-salad.png"
  },
  {
    "title": "Chicken Tortilla Soup Bowl",
    "tag_names": [
      "Lunch",
      "Soups"
    ],
    "description": "A hearty and flavorful soup with tender chicken and crispy tortilla strips, perfect for a cozy meal.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 lb boneless, skinless chicken breast, cooked and shredded\n1 onion, diced\n2 cloves of garlic, minced\n1 can (14.5 oz) diced tomatoes\n1 can (4 oz) diced green chilies\n4 cups chicken broth\n1 tsp chili powder\n1 tsp cumin\nSalt and pepper to taste\n1 cup corn kernels\n1 can (15 oz) black beans, drained and rinsed\n1/4 cup chopped fresh cilantro\n1 lime, juiced\n1 cup shredded cheese\nTortilla strips for garnish",
    "instructions": "In a large pot, sauté the onion and garlic until soft.\nAdd the cooked chicken, diced tomatoes, green chilies, chicken broth, chili powder, cumin, salt, and pepper. Bring to a simmer.\nStir in the corn, black beans, cilantro, and lime juice. Cook for another 10-15 minutes.\nServe the soup hot, garnished with shredded cheese and tortilla strips.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chicken-tortilla-soup-bowl.png"
  },
  {
    "title": "Nutty Granola Clusters",
    "tag_names": [
      "Breakfast",
      "Desserts",
      "Breads"
    ],
    "description": "Crunchy clusters of nuts, oats, and honey make for a delicious and nutritious snack or breakfast topping.",
    "yield": "Makes about 4 cups of granola clusters",
    "active_time": "15 minutes",
    "total_time": "45 minutes",
    "ingredients": "2 cups rolled oats\n1/2 cup chopped almonds\n1/2 cup chopped pecans\n1/2 cup shredded coconut\n1/4 cup honey\n2 tablespoons coconut oil\n1/2 teaspoon vanilla extract\n1/4 teaspoon salt",
    "instructions": "Preheat the oven to 300°F (150°C) and line a baking sheet with parchment paper.\nIn a large bowl, combine the rolled oats, chopped almonds, chopped pecans, and shredded coconut.\nIn a small saucepan, heat the honey, coconut oil, vanilla extract, and salt over low heat until melted and well combined.\nPour the honey mixture over the oat mixture and stir well to coat everything evenly.\nSpread the mixture onto the prepared baking sheet and press it down gently to form clusters.\nBake for about 30 minutes, stirring halfway through, until the granola is golden brown and fragrant.\nLet it cool completely on the baking sheet before breaking it into clusters.\nStore in an airtight container at room temperature for up to 2 weeks.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/nutty-granola-clusters.png"
  },
  {
    "title": "Avocado Toast Delight",
    "tag_names": [
      "Breakfast",
      "Lunch",
      "Appetizers"
    ],
    "description": "A delicious and healthy avocado toast recipe that is perfect for breakfast or a snack.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "2 ripe avocados\n4 slices of whole grain bread\n1 lemon\nSalt and pepper to taste\nRed pepper flakes (optional)\nFresh parsley (for garnish)",
    "instructions": "Cut the ripe avocados in half, remove the pits, and scoop out the flesh into a bowl.\nMash the avocado with a fork until it reaches your desired level of smoothness.\nSqueeze the juice from the lemon into the mashed avocado and mix well.\nToast the slices of whole grain bread until they are golden brown and crispy.\nSpread the mashed avocado mixture evenly onto each slice of toasted bread.\nSeason with salt, pepper, and a sprinkle of red pepper flakes if desired.\nGarnish with fresh parsley.\nServe and enjoy your delicious avocado toast!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/avocado-toast-delight.png"
  },
  {
    "title": "Moroccan Lentil Tagine",
    "tag_names": [
      "Entrees"
    ],
    "description": "A flavorful and aromatic stew made with lentils, vegetables, and Moroccan spices.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 cup of green or brown lentils, rinsed and drained\n1 onion, chopped\n2 carrots, peeled and sliced\n2 cloves of garlic, minced\n1 can (14 oz) of diced tomatoes\n2 tablespoons of tomato paste\n2 teaspoons of ground cumin\n1 teaspoon of ground coriander\n1 teaspoon of ground turmeric\n1/2 teaspoon of ground cinnamon\n1/4 teaspoon of cayenne pepper (optional)\n4 cups of vegetable broth\nSalt and pepper to taste\n2 tablespoons of olive oil\nFresh cilantro leaves for garnish",
    "instructions": "In a large pot, heat olive oil over medium heat.\nAdd onions and carrots, and cook until softened, about 5 minutes.\nStir in garlic, cumin, coriander, turmeric, cinnamon, and cayenne pepper. Cook for another minute until fragrant.\nAdd lentils, diced tomatoes, tomato paste, and vegetable broth. Season with salt and pepper.\nBring the mixture to a boil, then reduce heat to low and simmer for 45-50 minutes, or until the lentils are tender.\nAdjust seasoning if needed.\nServe the Moroccan Lentil Tagine hot, garnished with fresh cilantro leaves.\nEnjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/moroccan-lentil-tagine.png"
  },
  {
    "title": "Honey Cinnamon Baked Pears",
    "tag_names": [
      "Desserts"
    ],
    "description": "Sweet and tender baked pears with a hint of cinnamon and drizzled with honey make a delightful dessert or snack.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "45 minutes",
    "ingredients": "4 ripe pears\n2 tbsp honey\n1 tsp ground cinnamon\n1/4 cup chopped walnuts",
    "instructions": "Preheat the oven to 375°F (190°C).\nSlice the pears in half and core them.\nPlace the pear halves on a baking sheet, cut side up.\nDrizzle honey over each pear half and sprinkle with ground cinnamon.\nBake in the preheated oven for about 30 minutes or until the pears are tender.\nRemove from the oven and sprinkle chopped walnuts over the baked pears before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/honey-cinnamon-baked-pears.png"
  },
  {
    "title": "Tropical Mango Smoothie",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tropical smoothie made with ripe mangoes and coconut milk.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 ripe mango, peeled and chopped\n1/2 cup coconut milk\n1/2 cup plain yogurt\n1 tablespoon honey\n1/2 teaspoon vanilla extract\nIce cubes",
    "instructions": "In a blender, combine the ripe mango, coconut milk, plain yogurt, honey, and vanilla extract.\nBlend until smooth.\nAdd ice cubes as desired and blend again until the mixture reaches a smoothie consistency.\nPour the tropical mango smoothie into glasses and serve cold.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/tropical-mango-smoothie.png"
  },
  {
    "title": "Basil Pesto Crostini",
    "tag_names": [
      "Appetizers",
      "Breads"
    ],
    "description": "Basil Pesto Crostini is a delicious appetizer featuring toasted bread topped with flavorful basil pesto.",
    "yield": "Makes 12 crostini",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 French baguette, sliced\n1 cup fresh basil leaves\n1/4 cup pine nuts\n1/4 cup grated Parmesan cheese\n2 cloves garlic\n1/4 cup extra-virgin olive oil\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 375°F (190°C).\nPlace the bread slices on a baking sheet and toast in the oven for 8-10 minutes, or until golden brown.\nIn a food processor, combine basil, pine nuts, Parmesan, garlic, salt, and pepper. Pulse until finely chopped.\nWith the food processor running, slowly pour in the olive oil until the mixture is well combined into a smooth pesto.\nSpread a generous amount of basil pesto on each toasted bread slice.\nServe the Basil Pesto Crostini and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/basil-pesto-crostini.png"
  },
  {
    "title": "Fluffy Pumpkin Pancakes",
    "tag_names": [
      "Breakfast",
      "Desserts"
    ],
    "description": "Delicious and fluffy pancakes with the warm flavors of pumpkin.",
    "yield": "Makes 8 pancakes",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup all-purpose flour\n1/4 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1 teaspoon ground cinnamon\n1/2 teaspoon ground nutmeg\n1/2 teaspoon ground ginger\n1/4 teaspoon ground cloves\n1 cup milk\n1/2 cup canned pumpkin puree\n1 large egg\n2 tablespoons melted butter\n1 teaspoon vanilla extract",
    "instructions": "In a large mixing bowl, whisk together the flour, sugar, baking powder, salt, and spices.\nIn a separate bowl, whisk together the milk, pumpkin puree, egg, melted butter, and vanilla extract.\nPour the wet ingredients into the dry ingredients and stir until just combined (it's okay if there are a few lumps).\nPreheat a griddle or non-stick skillet over medium heat and lightly grease with butter or cooking spray.\nPour 1/4 cup of batter onto the griddle for each pancake. Cook until bubbles form on the surface and the edges look set, then flip and cook for another 1-2 minutes until golden brown.\nRepeat with the remaining batter.\nServe warm with maple syrup, whipped cream, or your favorite toppings.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/fluffy-pumpkin-pancakes.png"
  },
  {
    "title": "Mediterranean Falafel Platter",
    "tag_names": [
      "Appetizers",
      "Entrees",
      "Salads"
    ],
    "description": "A delicious platter featuring Mediterranean inspired flavors with crispy falafel, fresh veggies, and creamy tahini sauce.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 can (15 oz) chickpeas, drained and rinsed\n1/2 small red onion, chopped\n2 cloves garlic, minced\n1/4 cup fresh parsley, chopped\n1 tsp ground cumin\n1 tsp ground coriander\n1/2 tsp paprika\nSalt and pepper to taste\n2-3 tbsp flour\n2 tbsp olive oil (for cooking)\nMixed greens, cucumber slices, cherry tomatoes, and olives for serving\nTahini sauce for drizzling",
    "instructions": "In a food processor, combine chickpeas, red onion, garlic, parsley, cumin, coriander, paprika, salt, and pepper. Pulse until mixture is combined but still slightly chunky.\nTransfer mixture to a bowl and stir in flour until the mixture holds together. Form into small patties.\nHeat olive oil in a pan over medium heat. Cook falafel patties until golden and crispy on both sides, about 4-5 minutes per side.\nArrange mixed greens, cucumber slices, cherry tomatoes, olives, and falafel on a platter.\nDrizzle with tahini sauce before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mediterranean-falafel-platter.png"
  },
  {
    "title": "Lemon Frosted Scones",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious scones with a zesty lemon frosting.",
    "yield": "Makes 12 scones",
    "active_time": "15 minutes",
    "total_time": "35 minutes",
    "ingredients": "2 cups all-purpose flour\n1/3 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/2 cup unsalted butter, cold and cut into small pieces\n1 large egg\n1/2 cup heavy cream\n1 teaspoon vanilla extract\nZest of 1 lemon",
    "instructions": "Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.\nIn a large bowl, whisk together the flour, sugar, baking powder, and salt.\nAdd the cold butter pieces to the flour mixture and cut in using a pastry cutter or your fingers until the mixture resembles coarse crumbs.\nIn a separate bowl, whisk together the egg, heavy cream, vanilla extract, and lemon zest.\nPour the wet ingredients into the dry ingredients and stir until just combined.\nTransfer the dough to a floured surface and gently knead a few times until it comes together.\nShape the dough into a circle about 1 inch thick and cut into 12 wedges.\nPlace the scones on the prepared baking sheet and bake for 15-18 minutes, or until lightly golden brown.\nRemove from the oven and let cool on a wire rack.\nOnce the scones are completely cooled, drizzle with lemon frosting made from powdered sugar and lemon juice.\nEnjoy your delicious Lemon Frosted Scones!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-frosted-scones.png"
  },
  {
    "title": "Matcha Green Tea Latte",
    "tag_names": [
      "Beverages"
    ],
    "description": "A delicious and energizing green tea latte made with matcha powder.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 tsp matcha green tea powder\n2 tbsp hot water\n1 cup milk of your choice\n1-2 tsp honey or sweetener of choice (optional)",
    "instructions": "In a small bowl, whisk the matcha powder with hot water until smooth to make a paste.\nHeat the milk in a small saucepan until steaming but not boiling.\nPour the milk into a blender, add the matcha paste and sweetener if desired.\nBlend until frothy.\nPour into mugs and enjoy your homemade matcha green tea latte!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/matcha-green-tea-latte.png"
  },
  {
    "title": "Spinach Artichoke Dip",
    "tag_names": [
      "Appetizers"
    ],
    "description": "A delicious and creamy dip perfect for parties and gatherings.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 (10 oz) package frozen chopped spinach, thawed and drained\n1 (14 oz) can artichoke hearts, drained and chopped\n1 cup grated Parmesan cheese\n1 cup mayonnaise\n1 cup sour cream\n1 cup shredded mozzarella cheese\n1/4 cup chopped onion\n2 cloves garlic, minced\n1/2 teaspoon salt\n1/2 teaspoon black pepper\n1/4 teaspoon red pepper flakes (optional)",
    "instructions": "Preheat oven to 350°F (175°C).\nIn a large bowl, mix together spinach, artichoke hearts, Parmesan cheese, mayonnaise, sour cream, mozzarella cheese, onion, garlic, salt, black pepper, and red pepper flakes.\nTransfer the mixture to a baking dish.\nBake in the preheated oven for 25-30 minutes, until bubbly and lightly browned on top.\nServe hot with tortilla chips, crackers, or sliced baguette.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spinach-artichoke-dip.png"
  },
  {
    "title": "Cranberry Orange Scones",
    "tag_names": [
      "Breads",
      "Breakfast",
      "Desserts"
    ],
    "description": "Delicious scones with a perfect balance of tart cranberries and zesty orange flavor.",
    "yield": "Makes 8 scones",
    "active_time": "15 minutes",
    "total_time": "35 minutes",
    "ingredients": "2 cups all-purpose flour\n1/3 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/2 cup cold unsalted butter, cut into small cubes\n1/2 cup dried cranberries\nZest of 1 orange\n1/2 cup milk\n1/4 cup fresh orange juice\n1 teaspoon vanilla extract",
    "instructions": "Preheat oven to 400°F (200°C) and line a baking sheet with parchment paper.\nIn a large bowl, whisk together the flour, sugar, baking powder, and salt.\nAdd the cold butter cubes to the flour mixture and cut in using a pastry blender or your fingers until the mixture resembles coarse crumbs.\nStir in the dried cranberries and orange zest.\nIn a separate bowl, whisk together the milk, orange juice, and vanilla extract.\nPour the wet ingredients into the dry ingredients and mix until just combined.\nTransfer the dough onto a floured surface and shape it into a 1-inch thick circle.\nCut the circle into 8 wedges and place them on the prepared baking sheet.\nBake for 15-18 minutes, or until the scones are golden brown.\nLet the scones cool slightly before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cranberry-orange-scones.png"
  },
  {
    "title": "Chicken Caprese Panini",
    "tag_names": [
      "Lunch",
      "Entrees"
    ],
    "description": "A delicious and satisfying panini with tender chicken, fresh tomatoes, basil, and mozzarella cheese.",
    "yield": "Serves 2",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 boneless, skinless chicken breasts\n4 slices of bread (such as ciabatta or focaccia)\n2 tablespoons of olive oil\n1 large tomato, sliced\n4-6 fresh basil leaves\n4 slices of fresh mozzarella cheese\nSalt and pepper to taste",
    "instructions": "1. Preheat a panini press or a grill pan over medium heat.\n2. Season the chicken breasts with salt and pepper.\n3. Cook the chicken breasts on the panini press or grill pan for about 6-8 minutes per side, or until fully cooked.\n4. Brush one side of each slice of bread with olive oil.\n5. On the non-oiled side of two slices of bread, layer each with a cooked chicken breast, tomato slices, fresh basil leaves, and mozzarella cheese.\n6. Top each sandwich with the remaining slices of bread, oiled side facing up.\n7. Place the sandwiches on the panini press or grill pan and cook for 3-5 minutes, or until the bread is golden and the cheese has melted.\n8. Remove the sandwiches from the heat, slice in half, and serve hot. Enjoy your delicious Chicken Caprese Panini!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chicken-caprese-panini.png"
  },
  {
    "title": "Choco-Banana Bread Pudding",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A rich and decadent dessert combining the flavors of chocolate and banana in a delicious bread pudding.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "4 cups of cubed bread\n2 ripe bananas, mashed\n1/2 cup of chocolate chips\n1/2 cup of sugar\n2 cups of milk\n3 eggs\n1 teaspoon of vanilla extract\n1/4 teaspoon of salt",
    "instructions": "Preheat the oven to 350°F (175°C).\nIn a large bowl, combine the cubed bread, mashed bananas, and chocolate chips.\nIn a separate bowl, whisk together the sugar, milk, eggs, vanilla extract, and salt.\nPour the wet mixture over the bread mixture and gently stir to combine.\nLet the mixture sit for 10 minutes to allow the bread to absorb the liquid.\nPour the mixture into a greased baking dish.\nBake for 40-45 minutes or until the top is golden and the pudding is set.\nServe warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/choco-banana-bread-pudding.png"
  },
  {
    "title": "Iced Peach Green Tea",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and flavorful iced tea perfect for hot summer days.",
    "yield": "Serves 4",
    "active_time": "10 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups water\n2 bags of green tea\n2 ripe peaches, sliced\n2 tablespoons honey\nIce cubes\nFresh mint leaves (for garnish)",
    "instructions": "In a saucepan, bring 4 cups of water to a boil.\nRemove from heat and add the green tea bags. Let steep for 5 minutes.\nRemove the tea bags and stir in the sliced peaches and honey. Let it cool to room temperature.\nStrain the tea mixture into a pitcher and refrigerate until chilled.\nTo serve, fill glasses with ice cubes, pour the chilled tea over the ice, and garnish with fresh mint leaves.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/iced-peach-green-tea.png"
  },
  {
    "title": "Stuffed Jalapeno Poppers",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Spicy jalapeno peppers stuffed with a mixture of cheese and spices, then baked to perfection.",
    "yield": "Makes 20 poppers",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "10 jalapeno peppers\n8 oz cream cheese, softened\n1 cup shredded cheddar cheese\n1/2 tsp garlic powder\n1/2 tsp onion powder\n1/2 tsp paprika\n1/2 tsp salt\n1/4 tsp black pepper\n1/2 cup breadcrumbs\nCooking spray",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the jalapeno peppers in half lengthwise and remove the seeds and membranes.\nIn a mixing bowl, combine the cream cheese, cheddar cheese, garlic powder, onion powder, paprika, salt, and black pepper.\nFill each jalapeno half with the cheese mixture.\nIn a shallow dish, place the breadcrumbs.\nRoll the filled jalapeno peppers in the breadcrumbs to coat evenly.\nPlace the stuffed jalapenos on a baking sheet lined with parchment paper and lightly spray the tops with cooking spray.\nBake in the preheated oven for 15-20 minutes, or until the jalapenos are tender and the cheese is melted and bubbly.\nServe the stuffed jalapeno poppers hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/stuffed-jalapeno-poppers.png"
  },
  {
    "title": "Caramel Apple Streusel",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delicious dessert combining the flavors of sweet caramel and tart apples with a crumbly streusel topping.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "1 hour 15 minutes",
    "ingredients": "For the Apple Filling:\n- 4 large apples, peeled and sliced\n- 1/2 cup granulated sugar\n- 1/4 cup all-purpose flour\n- 1 teaspoon ground cinnamon\n- 1/4 teaspoon salt\n- 1 tablespoon lemon juice\nFor the Streusel Topping:\n- 1/2 cup all-purpose flour\n- 1/2 cup rolled oats\n- 1/2 cup brown sugar\n- 1/4 cup unsalted butter, melted\nFor the Caramel Sauce:\n- 1/2 cup granulated sugar\n- 1/4 cup unsalted butter\n- 1/4 cup heavy cream\n- Pinch of salt",
    "instructions": "1. Preheat the oven to 350°F (180°C) and grease a 9x9-inch baking dish.\n2. In a large bowl, combine the sliced apples, sugar, flour, cinnamon, salt, and lemon juice. Toss until the apples are evenly coated.\n3. Spread the apple mixture in the prepared baking dish.\n4. In a separate bowl, mix the flour, oats, brown sugar, and melted butter until crumbly. Sprinkle this streusel topping over the apples.\n5. Bake in the preheated oven for about 45-50 minutes, or until the topping is golden brown and the apples are tender.\n6. While the dessert is baking, prepare the caramel sauce. In a saucepan, melt the sugar over medium heat until amber in color. Add the butter and stir until melted. Slowly pour in the heavy cream while stirring constantly. Remove from heat and stir in a pinch of salt.\n7. Once the dessert is done, drizzle the warm caramel sauce over the top. Serve the Caramel Apple Streusel warm with a scoop of vanilla ice cream, if desired.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caramel-apple-streusel.png"
  },
  {
    "title": "Tex-Mex Quinoa Bowl",
    "tag_names": [
      "Lunch",
      "Entrees",
      "Salads"
    ],
    "description": "A flavorful Tex-Mex inspired quinoa bowl packed with protein and fresh ingredients.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup quinoa\n1 3/4 cups vegetable broth\n1 can (15 oz) black beans, rinsed and drained\n1 cup corn kernels\n1 red bell pepper, chopped\n1 avocado, diced\n1/2 cup cherry tomatoes, halved\n1/4 cup fresh cilantro, chopped\n1 lime, juiced\n1 tsp ground cumin\n1/2 tsp chili powder\nSalt and pepper to taste\nOptional toppings: shredded cheese, salsa, sour cream",
    "instructions": "Rinse the quinoa under cold water. In a medium saucepan, bring vegetable broth to a boil. Add quinoa, cover, and simmer for 15 minutes or until the liquid is absorbed.\nIn a large bowl, combine cooked quinoa, black beans, corn, red bell pepper, avocado, cherry tomatoes, and cilantro. Mix well.\nIn a small bowl, whisk together lime juice, cumin, chili powder, salt, and pepper. Pour over the quinoa mixture and toss to coat.\nDivide the quinoa mixture into bowls. Top with your choice of toppings such as shredded cheese, salsa, and sour cream.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/tex-mex-quinoa-bowl.png"
  },
  {
    "title": "Guava Coconut Sorbet",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and tropical sorbet that combines the flavors of guava and coconut.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "4 hours",
    "ingredients": "4 cups guava puree\n1 can (14 oz) coconut milk\n1 cup sugar\n1/4 cup lime juice\n1/4 teaspoon salt",
    "instructions": "In a large bowl, whisk together the guava puree, coconut milk, sugar, lime juice, and salt until the sugar is dissolved.\nChill the mixture in the refrigerator for at least 1 hour.\nPour the mixture into an ice cream maker and churn according to the manufacturer's instructions.\nTransfer the sorbet to a container and freeze for at least 3 hours before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/guava-coconut-sorbet.png"
  },
  {
    "title": "Sizzling Shrimp Skewers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "Delicious and flavorful shrimp skewers that are perfect for grilling.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 pound large shrimp, peeled and deveined\n2 tablespoons olive oil\n2 cloves garlic, minced\n1 teaspoon paprika\n1/2 teaspoon cayenne pepper\nSalt and pepper to taste\n1 lemon, cut into wedges\nBamboo skewers, soaked in water",
    "instructions": "In a bowl, combine olive oil, garlic, paprika, cayenne pepper, salt, and pepper. Add shrimp and toss to coat. Let marinate for 15 minutes.\nThread shrimp onto soaked skewers.\nPreheat grill to medium-high heat. Place skewers on the grill and cook for 2-3 minutes per side until shrimp are opaque and cooked through.\nServe hot with lemon wedges.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sizzling-shrimp-skewers.png"
  },
  {
    "title": "Blueberry Lemon Loaf Cake",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delicious and moist loaf cake bursting with fresh blueberries and zesty lemon flavor.",
    "yield": "1 loaf cake",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "1 1/2 cups all-purpose flour\n1 tsp baking powder\n1/2 tsp baking soda\n1/4 tsp salt\n1/2 cup unsalted butter, softened\n1 cup granulated sugar\n2 large eggs\n1/2 cup plain yogurt\n2 tbsp fresh lemon juice\n1 tbsp lemon zest\n1 cup fresh blueberries, washed and dried",
    "instructions": "Preheat the oven to 350°F (180°C) and grease a 9x5-inch loaf pan.\nIn a bowl, whisk together the flour, baking powder, baking soda, and salt.\nIn a separate bowl, cream the butter and sugar until light and fluffy.\nAdd the eggs one at a time, beating well after each addition.\nStir in the yogurt, lemon juice, and lemon zest until combined.\nGradually add the dry ingredients to the wet ingredients and mix until just combined.\nGently fold in the blueberries.\nPour the batter into the prepared loaf pan and spread it evenly.\nBake for 50-60 minutes or until a toothpick inserted into the center comes out clean.\nAllow the cake to cool in the pan for 10 minutes before transferring it to a wire rack to cool completely.\nSlice and serve your Blueberry Lemon Loaf Cake. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-lemon-loaf-cake.png"
  },
  {
    "title": "Sparkling Raspberry Lemonade",
    "tag_names": [
      "Beverages"
    ],
    "description": "Refreshing and bubbly raspberry lemonade perfect for summer days.",
    "yield": "Serves 6",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 cup fresh raspberries\n1 cup freshly squeezed lemon juice\n1/2 cup sugar\n4 cups sparkling water\nIce cubes\nLemon slices and fresh raspberries for garnish",
    "instructions": "In a blender, puree the raspberries until smooth. Strain the puree through a fine-mesh sieve to remove the seeds.\nIn a pitcher, combine the raspberry puree, lemon juice, and sugar. Stir until the sugar is dissolved.\nAdd the sparkling water and stir gently to combine.\nFill glasses with ice cubes and pour the raspberry lemonade over the ice.\nGarnish with lemon slices and fresh raspberries.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sparkling-raspberry-lemonade.png"
  },
  {
    "title": "Smoky Black Bean Quesadillas",
    "tag_names": [
      "Lunch",
      "Entrees",
      "Appetizers"
    ],
    "description": "These smoky black bean quesadillas are a delicious and easy-to-make dish that is perfect for a quick meal.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 can of black beans, drained and rinsed\n1 small onion, diced\n1 red bell pepper, diced\n1 teaspoon smoked paprika\n1 teaspoon cumin\n1/2 teaspoon chili powder\nSalt and pepper to taste\n1 cup shredded cheese (cheddar or Mexican blend)\n8 small flour tortillas\nOil or cooking spray for cooking",
    "instructions": "In a large skillet, heat some oil over medium heat. Add the diced onion and bell pepper, and cook until softened, about 5 minutes.\nAdd the black beans, smoked paprika, cumin, chili powder, salt, and pepper to the skillet. Cook for another 2-3 minutes until the flavors are well combined. Remove from heat.\nPlace a tortilla on a flat surface. Spoon some of the black bean mixture onto half of the tortilla, then top with a sprinkle of shredded cheese. Fold the empty tortilla half over the filling.\nHeat a separate skillet or griddle over medium heat and lightly grease it with oil or cooking spray. Place the filled quesadilla on the skillet and cook for 2-3 minutes per side, until golden brown and the cheese is melted.\nRepeat the filling and cooking process with the remaining tortillas and filling.\nOnce all quesadillas are cooked, slice them into wedges and serve hot with your favorite toppings like salsa, guacamole, or sour cream.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/smoky-black-bean-quesadillas.png"
  },
  {
    "title": "Chocolate Hazelnut Tart",
    "tag_names": [
      "Desserts"
    ],
    "description": "A decadent chocolate tart with a nutty hazelnut flavor that is perfect for special occasions.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "2 hours",
    "ingredients": "1 1/2 cups of all-purpose flour\n1/2 cup of granulated sugar\n1/2 teaspoon of salt\n1/2 cup of unsalted butter, cold and cut into cubes\n1/2 cup of ground hazelnuts\n1 egg\n1 teaspoon of vanilla extract\n1 cup of chocolate chips\n1/2 cup of heavy cream\n1/4 cup of chopped hazelnuts for garnish",
    "instructions": "Preheat the oven to 350°F (175°C).\nIn a food processor, pulse together the flour, sugar, salt, and butter until the mixture resembles coarse crumbs.\nAdd the ground hazelnuts, egg, and vanilla extract, and pulse until the dough comes together.\nPress the dough into the bottom and up the sides of a 9-inch tart pan with a removable bottom.\nBake the tart crust for 15-20 minutes, or until golden brown. Let it cool completely.\nIn a small saucepan, heat the heavy cream until it just begins to boil. Remove from heat and pour over the chocolate chips in a heatproof bowl. Let it sit for a minute, then stir until smooth.\nPour the chocolate ganache into the cooled tart crust and spread it evenly. Sprinkle the chopped hazelnuts on top.\nRefrigerate the tart for at least 1 hour to set the ganache before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-hazelnut-tart.png"
  },
  {
    "title": "Minted Watermelon Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing salad combining juicy watermelon with fresh mint and tangy feta cheese.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups cubed seedless watermelon\n1/4 cup fresh mint leaves, chopped\n1/2 cup crumbled feta cheese\n2 tablespoons extra-virgin olive oil\n1 tablespoon balsamic vinegar\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine the watermelon, mint, and feta cheese.\nIn a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.\nDrizzle the dressing over the watermelon mixture and toss gently to combine.\nServe immediately or refrigerate until ready to serve.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/minted-watermelon-salad.png"
  },
  {
    "title": "Creamy Cauliflower Soup",
    "tag_names": [
      "Soups"
    ],
    "description": "A velvety smooth and flavorful soup made with cauliflower and herbs.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 head of cauliflower, chopped\n1 onion, chopped\n2 cloves of garlic, minced\n4 cups vegetable broth\n1 cup heavy cream\n2 tbsp butter\nSalt and pepper to taste\nFresh chopped parsley for garnish",
    "instructions": "In a large pot, melt butter over medium heat.\nAdd chopped onions and garlic, sauté until fragrant.\nAdd cauliflower, vegetable broth, salt, and pepper. Bring to a boil, then reduce heat and simmer for 20 minutes until cauliflower is tender.\nUsing an immersion blender, blend the soup until smooth.\nStir in heavy cream and simmer for an additional 5 minutes.\nAdjust seasoning if needed.\nServe hot, garnished with fresh parsley.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/creamy-cauliflower-soup.png"
  },
  {
    "title": "Cheesy Garlic Breadsticks",
    "tag_names": [
      "Appetizers",
      "Breads"
    ],
    "description": "Delicious homemade breadsticks with gooey cheese and garlic flavor.",
    "yield": "Makes 12 breadsticks",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 package (0.25 oz) active dry yeast\n1 cup warm water (110°F)\n1 tsp sugar\n3 cups all-purpose flour\n1 tsp salt\n2 tbsp olive oil\n2 tbsp butter, melted\n3 cloves garlic, minced\n1 cup shredded mozzarella cheese\n1/2 cup grated Parmesan cheese\n1/2 tsp dried oregano\n1/2 tsp garlic powder",
    "instructions": "In a bowl, dissolve yeast in warm water and sugar. Let it sit for 5-10 minutes until frothy.\nAdd flour, salt, and olive oil to the yeast mixture. Mix until dough forms.\nKnead the dough on a floured surface for about 5 minutes until smooth.\nPlace dough in a greased bowl, cover with a damp towel, and let it rise in a warm place for 1 hour.\nPreheat oven to 400°F (200°C).\nPunch down the dough and divide into 12 equal pieces. Roll each piece into a breadstick shape.\nPlace breadsticks on a baking sheet lined with parchment paper.\nIn a small bowl, mix melted butter, minced garlic, oregano, and garlic powder.\nBrush the garlic butter mixture over the breadsticks.\nSprinkle mozzarella and Parmesan cheese over the breadsticks.\nBake in the preheated oven for 15-20 minutes until golden brown and cheese is melted.\nServe warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cheesy-garlic-breadsticks.png"
  },
  {
    "title": "Pomegranate Beet Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and colorful salad featuring the vibrant flavors of pomegranate and beets.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 medium beets, roasted and cubed\n1 cup of pomegranate arils\n4 cups of mixed salad greens\n1/2 cup of crumbled feta cheese\n1/4 cup of chopped walnuts\n1/4 cup of olive oil\n2 tablespoons of balsamic vinegar\n1 tablespoon of honey\nSalt and pepper to taste",
    "instructions": "In a small bowl, whisk together olive oil, balsamic vinegar, honey, salt, and pepper to make the dressing.\nIn a large bowl, combine the roasted beets, pomegranate arils, mixed salad greens, feta cheese, and walnuts.\nDrizzle the dressing over the salad and toss gently to combine.\nServe the salad in individual plates or bowls.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pomegranate-beet-salad.png"
  },
  {
    "title": "Butternut Squash Bisque",
    "tag_names": [
      "Soups"
    ],
    "description": "A creamy and flavorful soup with the sweetness of butternut squash.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 medium butternut squash, peeled, seeded, and cubed\n1 onion, diced\n2 cloves of garlic, minced\n4 cups of vegetable broth\n1 cup of coconut milk\n1 tsp of curry powder\nSalt and pepper to taste\nOlive oil for cooking",
    "instructions": "In a large pot, heat some olive oil over medium heat.\nAdd the diced onion and garlic, and sauté until softened.\nAdd the cubed butternut squash, vegetable broth, and curry powder to the pot.\nBring the mixture to a boil, then reduce heat and let it simmer for 20-25 minutes, or until the butternut squash is tender.\nUsing an immersion blender, blend the soup until smooth.\nStir in the coconut milk and season with salt and pepper to taste.\nSimmer for an additional 5 minutes before serving hot.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/butternut-squash-bisque.png"
  },
  {
    "title": "Cranberry Pistachio Biscotti",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious crunchy biscotti filled with tangy cranberries and nutty pistachios.",
    "yield": "Makes about 24 biscotti",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "2 cups all-purpose flour\n1 cup sugar\n1 teaspoon baking powder\n1/2 teaspoon salt\n3 large eggs\n1 teaspoon vanilla extract\n1/2 cup dried cranberries\n1/2 cup chopped pistachios",
    "instructions": "Preheat the oven to 350°F (175°C) and line a baking sheet with parchment paper.\nIn a large bowl, whisk together flour, sugar, baking powder, and salt.\nIn a separate bowl, beat the eggs and vanilla extract together. Gradually add this mixture to the dry ingredients, mixing until well combined.\nFold in the dried cranberries and chopped pistachios.\nDivide the dough in half and shape each half into a log about 12 inches long and 2 inches wide. Place the logs on the prepared baking sheet, leaving space between them.\nBake in the preheated oven for 25-30 minutes or until the logs are firm to the touch.\nRemove from the oven and let them cool for about 10 minutes. Reduce the oven temperature to 325°F (160°C).\nUsing a serrated knife, slice the logs diagonally into 1/2-inch thick biscotti. Place the slices cut-side down on the baking sheet.\nBake for an additional 15-20 minutes, turning the biscotti halfway through baking, until they are crisp and golden.\nAllow the biscotti to cool completely before serving or storing in an airtight container.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cranberry-pistachio-biscotti.png"
  },
  {
    "title": "Raspberry Lemonade Cooler",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tangy drink perfect for a hot summer day.",
    "yield": "Serves 4",
    "active_time": "10 minutes",
    "total_time": "10 minutes",
    "ingredients": "1 cup fresh raspberries\n1/2 cup fresh lemon juice\n1/4 cup honey\n4 cups cold water\nIce cubes\nLemon slices and fresh raspberries for garnish",
    "instructions": "In a blender, combine the fresh raspberries, lemon juice, honey, and 1 cup of cold water. Blend until smooth.\nStrain the mixture through a fine mesh sieve into a pitcher to remove the raspberry seeds.\nAdd the remaining 3 cups of cold water to the pitcher and stir well.\nFill glasses with ice cubes and pour the raspberry lemonade over the ice.\nGarnish each glass with a slice of lemon and a few fresh raspberries.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-lemonade-cooler.png"
  },
  {
    "title": "Caprese Stuffed Mushrooms",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious mushrooms stuffed with the classic Caprese flavors of tomatoes, mozzarella, and basil.",
    "yield": "Serves 6",
    "active_time": "25 minutes",
    "total_time": "45 minutes",
    "ingredients": "12 large mushrooms, stems removed\n1 cup cherry tomatoes, diced\n1 cup fresh mozzarella, diced\n1/4 cup fresh basil, chopped\n2 cloves garlic, minced\n2 tablespoons balsamic glaze\nSalt and pepper, to taste\nOlive oil for drizzling",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a bowl, mix together tomatoes, mozzarella, basil, garlic, balsamic glaze, salt, and pepper.\nStuff each mushroom with the mixture.\nDrizzle olive oil over the stuffed mushrooms.\nBake in the preheated oven for about 20 minutes or until mushrooms are tender.\nServe warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caprese-stuffed-mushrooms.png"
  },
  {
    "title": "Almond Flour Banana Bread",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious and healthy banana bread made with almond flour.",
    "yield": "One loaf",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "2 ripe bananas\n2 eggs\n1/3 cup honey\n1/4 cup melted coconut oil\n1 tsp vanilla extract\n2 cups almond flour\n1/2 tsp baking soda\n1/2 tsp salt\n1/2 tsp cinnamon",
    "instructions": "Preheat the oven to 350°F (180°C) and grease a loaf pan.\nIn a mixing bowl, mash the bananas until smooth.\nAdd the eggs, honey, melted coconut oil, and vanilla extract. Mix well.\nIn a separate bowl, combine the almond flour, baking soda, salt, and cinnamon.\nGradually add the dry ingredients to the wet ingredients, stirring until well combined.\nPour the batter into the prepared loaf pan.\nBake for about 45-50 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the banana bread to cool before slicing and serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/almond-flour-banana-bread.png"
  },
  {
    "title": "Vietnamese Spring Rolls",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Fresh and light Vietnamese spring rolls filled with shrimp, vegetables, and herbs. Served with a side of dipping sauce.",
    "yield": "Makes 12 spring rolls",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "12 rice paper wrappers\n12 cooked large shrimp, peeled and sliced in half lengthwise\n1.5 cups vermicelli noodles, cooked and cooled\n1 cup shredded lettuce\n1 cup julienned cucumber\n1 cup julienned carrots\nHandful of fresh mint leaves\nHandful of fresh cilantro leaves\nHandful of fresh Thai basil leaves\nDipping sauce (hoisin sauce, peanut sauce, or fish sauce)\nWarm water for soaking rice paper wrappers",
    "instructions": "Prepare all the ingredients and have them ready for assembly.\nFill a shallow dish with warm water. Dip one rice paper wrapper into the water for a few seconds until it softens.\nPlace the softened wrapper on a clean surface. Add a few shrimp halves, vermicelli noodles, lettuce, cucumber, carrots, mint, cilantro, and basil in a line in the center of the wrapper.\nFold the bottom of the wrapper over the filling, then fold in the sides, and roll it up tightly.\nRepeat with the remaining ingredients to make more spring rolls.\nServe the spring rolls with your choice of dipping sauce.\nEnjoy the fresh and delicious Vietnamese Spring Rolls!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/vietnamese-spring-rolls.png"
  },
  {
    "title": "Citrus Poppyseed Cake",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delightful citrus-flavored cake with a hint of poppyseeds.",
    "yield": "Serves 10",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 1/2 cups all-purpose flour\n1 cup sugar\n2 tbsp poppyseeds\nZest of 1 lemon\nZest of 1 orange\n1/2 cup unsalted butter, softened\n3 eggs\n1/2 cup milk\n1/4 cup fresh lemon juice\n1/4 cup fresh orange juice\n1 tsp vanilla extract\n1 tsp baking powder\n1/2 tsp salt",
    "instructions": "Preheat oven to 350°F (175°C). Grease and flour a 9-inch round cake pan.\nIn a mixing bowl, cream together the butter and sugar until light and fluffy.\nAdd the eggs one at a time, beating well after each addition. Mix in the lemon zest, orange zest, vanilla extract, and poppyseeds.\nIn a separate bowl, whisk together the flour, baking powder, and salt.\nGradually add the dry ingredients to the wet ingredients, alternating with the milk and citrus juices. Mix until just combined.\nPour the batter into the prepared cake pan and smooth the top.\nBake for 35-40 minutes or until a toothpick inserted into the center comes out clean.\nAllow the cake to cool in the pan for 10 minutes before transferring to a wire rack to cool completely.\nFor a finishing touch, you can dust the cake with powdered sugar before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/citrus-poppyseed-cake.png"
  },
  {
    "title": "Sparkling Lavender Lemonade",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and floral twist on classic lemonade, perfect for summer gatherings.",
    "yield": "Serves 8",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "1 cup fresh lemon juice\n1/2 cup lavender syrup\n4 cups sparkling water\nLemon slices and fresh lavender sprigs for garnish\nIce cubes",
    "instructions": "In a pitcher, combine fresh lemon juice and lavender syrup.\nStir in sparkling water until well mixed.\nAdd ice cubes to serving glasses and pour the lavender lemonade over the ice.\nGarnish each glass with a lemon slice and a fresh lavender sprig.\nServe chilled and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sparkling-lavender-lemonade.png"
  },
  {
    "title": "BBQ Pulled Jackfruit Sliders",
    "tag_names": [
      "Entrees"
    ],
    "description": "Enjoy these delicious and vegan-friendly BBQ pulled jackfruit sliders as a perfect party appetizer or main dish. The tender jackfruit mimics the texture of pulled pork, while the smoky BBQ sauce adds a flavorful kick.",
    "yield": "Makes 6 sliders",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "2 cans of young green jackfruit in water or brine, drained and rinsed\n1 onion, diced\n3 cloves of garlic, minced\n1 cup of BBQ sauce\n1 tbsp of olive oil\n1 tsp of smoked paprika\n1/2 tsp of cumin\nSalt and pepper to taste\n6 slider buns\nOptional toppings like coleslaw or pickles",
    "instructions": "Heat olive oil in a large skillet over medium heat.\nAdd diced onion and minced garlic, sauté until translucent.\nAdd the drained jackfruit to the skillet, breaking it apart with a fork to resemble pulled pork.\nSeason with smoked paprika, cumin, salt, and pepper. Stir to combine.\nPour in the BBQ sauce and stir well to coat the jackfruit.\nReduce heat to low, cover, and simmer for 30 minutes.\nToast the slider buns in a separate pan or oven until lightly browned.\nAssemble the sliders by placing a generous portion of the BBQ pulled jackfruit on each bun.\nAdd optional toppings like coleslaw or pickles if desired.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/bbq-pulled-jackfruit-sliders.png"
  },
  {
    "title": "Triple Berry Cobbler",
    "tag_names": [
      "Desserts"
    ],
    "description": "A delicious cobbler made with a mix of strawberries, blueberries, and blackberries topped with a buttery, crumbly crust.",
    "yield": "Serves 8",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "4 cups mixed berries (strawberries, blueberries, blackberries)\n1 cup granulated sugar\n1 tablespoon lemon juice\n1 cup all-purpose flour\n1 cup sugar\n1 teaspoon baking powder\n1/4 teaspoon salt\n1/2 cup unsalted butter, melted\n1/4 cup boiling water",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a large bowl, mix the berries, 1 cup of sugar, and lemon juice. Pour the mixture into a 9x13-inch baking dish.\nIn another bowl, combine the flour, 1 cup of sugar, baking powder, and salt. Stir in the melted butter until the mixture is crumbly.\nSprinkle the crumb mixture over the berries in the baking dish.\nCarefully pour the boiling water over the topping.\nBake for 45-50 minutes or until the topping is golden brown and the berries are bubbling.\nLet it cool slightly before serving. Enjoy warm with a scoop of vanilla ice cream!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/triple-berry-cobbler.png"
  },
  {
    "title": "Cucumber Watermelon Gazpacho",
    "tag_names": [
      "Appetizers",
      "Soups"
    ],
    "description": "A refreshing and light summer soup that combines the flavors of cucumber and watermelon with a hint of spice.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "45 minutes",
    "ingredients": "4 cups cubed seedless watermelon\n2 large English cucumbers, peeled and chopped\n1 small red onion, chopped\n1 red bell pepper, seeded and chopped\n2 cloves garlic, minced\n1/4 cup fresh lime juice\n2 tablespoons olive oil\n1 teaspoon ground cumin\n1/2 teaspoon chili powder\nSalt and pepper to taste\nFresh mint leaves for garnish",
    "instructions": "In a blender, combine watermelon, cucumbers, red onion, red bell pepper, and garlic. Blend until smooth.\nAdd lime juice, olive oil, cumin, chili powder, salt, and pepper. Blend again until well combined.\nTransfer the mixture to a large bowl and chill in the refrigerator for at least 30 minutes.\nBefore serving, taste and adjust seasoning if needed.\nServe the gazpacho cold, garnished with fresh mint leaves.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cucumber-watermelon-gazpacho.png"
  },
  {
    "title": "Pesto Zucchini Noodles",
    "tag_names": [
      "Entrees",
      "Salads"
    ],
    "description": "Zucchini noodles tossed in a flavorful pesto sauce.",
    "yield": "Serves 2",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 medium zucchinis, spiralized\n1/2 cup basil pesto\n1/4 cup grated Parmesan cheese\n1/4 cup cherry tomatoes, halved\nSalt and pepper to taste",
    "instructions": "In a large pan, heat olive oil over medium heat.\nAdd zucchini noodles and sauté for 2-3 minutes until slightly tender.\nStir in the basil pesto and cook for another 2 minutes.\nRemove from heat and toss with Parmesan cheese.\nSeason with salt and pepper, and garnish with cherry tomatoes.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pesto-zucchini-noodles.png"
  },
  {
    "title": "Mango Black Bean Tacos",
    "tag_names": [
      "Lunch",
      "Entrees",
      "Appetizers"
    ],
    "description": "Delicious tacos filled with the flavors of mango and black beans, perfect for a quick and flavorful meal.",
    "yield": "Makes 4 tacos",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 ripe mango, diced\n1 can of black beans, drained and rinsed\n1/2 red onion, finely diced\n1 jalapeno, seeded and diced\n1/4 cup chopped fresh cilantro\nJuice of 1 lime\nSalt and pepper to taste\n4 small corn or flour tortillas\nOptional toppings: avocado, salsa, sour cream",
    "instructions": "In a medium bowl, combine the diced mango, black beans, red onion, jalapeno, cilantro, and lime juice. Season with salt and pepper to taste.\nWarm the tortillas in a skillet or microwave.\nDivide the mango black bean mixture evenly among the tortillas.\nAdd your favorite toppings such as avocado, salsa, and sour cream.\nServe and enjoy your delicious Mango Black Bean Tacos!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-black-bean-tacos.png"
  },
  {
    "title": "Cherry Almond Bundt Cake",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delicious cake filled with juicy cherries and almond flavor. Perfect for special occasions or a sweet treat for any day.",
    "yield": "Serves 12",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "2 cups all-purpose flour\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1/4 teaspoon salt\n1 cup unsalted butter, softened\n1 1/2 cups granulated sugar\n3 large eggs\n1 teaspoon almond extract\n1 cup sour cream\n1 cup chopped cherries (fresh or frozen)\n1/2 cup sliced almonds\nPowdered sugar, for dusting",
    "instructions": "Preheat the oven to 350°F (175°C) and grease a bundt cake pan.\nIn a bowl, whisk together the flour, baking powder, baking soda, and salt.\nIn another bowl, cream together the butter and sugar until light and fluffy.\nAdd the eggs one at a time, beating well after each addition. Stir in the almond extract.\nAlternate adding the flour mixture and sour cream to the wet ingredients, starting and ending with the flour.\nFold in the chopped cherries and sliced almonds.\nPour the batter into the prepared bundt cake pan and smooth the top.\nBake for about 50-60 minutes or until a toothpick inserted into the center comes out clean.\nLet the cake cool in the pan for 10 minutes, then invert it onto a wire rack to cool completely.\nDust with powdered sugar before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cherry-almond-bundt-cake.png"
  },
  {
    "title": "Pineapple Mint Cooler",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tropical drink perfect for a hot summer day.",
    "yield": "Serves 4",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "2 cups of fresh pineapple chunks\n1/4 cup of fresh mint leaves\n4 cups of pineapple juice\n1/4 cup of fresh lime juice\n2 cups of sparkling water\nIce cubes\nMint sprigs for garnish",
    "instructions": "In a blender, combine the fresh pineapple chunks and fresh mint leaves. Blend until smooth.\nStrain the mixture through a fine mesh sieve into a pitcher.\nAdd the pineapple juice, lime juice, and sparkling water to the pitcher. Stir to combine.\nFill glasses with ice cubes and pour the pineapple mint mixture over the ice.\nGarnish each glass with a sprig of mint.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pineapple-mint-cooler.png"
  },
  {
    "title": "Stuffed Portobello Mushrooms",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "This recipe features hearty Portobello mushrooms filled with a delicious mixture of breadcrumbs, cheese, and herbs.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "4 large Portobello mushrooms\n1/2 cup breadcrumbs\n1/2 cup grated Parmesan cheese\n2 cloves garlic, minced\n2 tbsp olive oil\n1/4 cup chopped fresh parsley\nSalt and pepper to taste",
    "instructions": "Preheat oven to 375°F (190°C).\nRemove the stems from the mushrooms and scrape out the gills using a spoon.\nIn a bowl, combine breadcrumbs, Parmesan cheese, garlic, parsley, olive oil, salt, and pepper.\nStuff each mushroom with the breadcrumb mixture, pressing gently to pack it in.\nPlace the stuffed mushrooms on a baking sheet and bake for about 15-20 minutes, or until the mushrooms are tender and the topping is golden brown.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/stuffed-portobello-mushrooms.png"
  },
  {
    "title": "Savory Cornbread Muffins",
    "tag_names": [
      "Breads",
      "Appetizers"
    ],
    "description": "These savory cornbread muffins are a delicious side dish that pairs well with soups and stews.",
    "yield": "Makes 12 muffins",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup cornmeal\n1 cup all-purpose flour\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/4 teaspoon black pepper\n1/4 cup sugar\n1 cup buttermilk\n1/2 cup unsalted butter, melted\n2 large eggs\n1 cup frozen corn kernels\n1 jalapeno pepper, seeded and finely chopped (optional)",
    "instructions": "Preheat the oven to 400°F (200°C) and grease a 12-cup muffin tin.\nIn a large bowl, whisk together the cornmeal, flour, baking powder, salt, pepper, and sugar.\nIn a separate bowl, whisk together the buttermilk, melted butter, and eggs.\nPour the wet ingredients into the dry ingredients and stir until just combined.\nFold in the corn kernels and chopped jalapeno, if using.\nDivide the batter evenly among the prepared muffin cups.\nBake for 15-20 minutes, or until a toothpick inserted into the center of a muffin comes out clean.\nAllow the muffins to cool in the pan for 5 minutes before transferring them to a wire rack to cool completely.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/savory-cornbread-muffins.png"
  },
  {
    "title": "Watermelon Feta Salad",
    "tag_names": [
      "Salads",
      "Appetizers"
    ],
    "description": "A refreshing and flavorful summer salad that combines sweet watermelon with tangy feta cheese.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups cubed watermelon\n1 cup crumbled feta cheese\n1/4 cup chopped fresh mint leaves\n1/4 cup extra virgin olive oil\n2 tablespoons balsamic vinegar\nSalt and black pepper to taste",
    "instructions": "In a large bowl, combine the cubed watermelon, crumbled feta cheese, and chopped mint leaves.\nIn a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.\nPour the dressing over the watermelon mixture and gently toss to combine.\nRefrigerate for at least 15 minutes before serving to allow the flavors to blend.\nServe the watermelon feta salad chilled and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/watermelon-feta-salad.png"
  },
  {
    "title": "Thai Coconut Curry Soup",
    "tag_names": [
      "Entrees",
      "Soups"
    ],
    "description": "A comforting and flavorful soup with a perfect blend of coconut milk and Thai curry spices.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 can (14 oz) coconut milk\n2 cups vegetable broth\n2 tbsp Thai red curry paste\n1 tbsp soy sauce\n1 tbsp brown sugar\n1 red bell pepper, thinly sliced\n1 small onion, diced\n2 cloves garlic, minced\n1-inch piece of ginger, grated\n1 cup chopped mushrooms\n2 cups chopped mixed vegetables (such as broccoli, carrots, and snow peas)\nJuice of 1 lime\nSalt and pepper to taste\nFresh cilantro and lime wedges for garnish",
    "instructions": "In a large pot, combine coconut milk, vegetable broth, Thai red curry paste, soy sauce, and brown sugar. Bring to a simmer over medium heat.\nAdd the bell pepper, onion, garlic, and ginger to the pot. Cook for 5 minutes, stirring occasionally.\nAdd the mushrooms and mixed vegetables to the pot. Simmer for another 10-15 minutes until the vegetables are tender.\nStir in the lime juice and season with salt and pepper to taste.\nServe the soup hot, garnished with fresh cilantro and lime wedges. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/thai-coconut-curry-soup.png"
  },
  {
    "title": "Baked Cinnamon Sugar Doughnuts",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious baked doughnuts coated in a sweet cinnamon sugar mixture.",
    "yield": "Makes 12 doughnuts",
    "active_time": "15 minutes",
    "total_time": "35 minutes",
    "ingredients": "2 cups all-purpose flour\n1 1/2 tsp baking powder\n1/2 tsp baking soda\n1/2 tsp salt\n1/2 cup granulated sugar\n1/3 cup unsalted butter, melted\n1/2 cup buttermilk\n1/2 cup plain yogurt\n2 large eggs\n1 tsp vanilla extract\nFor the cinnamon sugar coating:\n1/2 cup granulated sugar\n1 tsp ground cinnamon\n1/4 cup unsalted butter, melted",
    "instructions": "Preheat the oven to 350°F (180°C) and grease a doughnut pan.\nIn a mixing bowl, whisk together the flour, baking powder, baking soda, and salt.\nIn another bowl, mix the sugar, melted butter, buttermilk, yogurt, eggs, and vanilla extract until well combined.\nGradually add the dry ingredients to the wet ingredients, stirring until just combined.\nTransfer the batter to a piping bag and pipe it into the prepared doughnut pan, filling each cavity about two-thirds full.\nBake for 10-12 minutes or until the doughnuts spring back when lightly pressed.\nWhile the doughnuts are baking, prepare the cinnamon sugar coating by mixing the granulated sugar and ground cinnamon in a bowl.\nOnce the baked doughnuts are cool enough to handle, brush each doughnut with melted butter and toss them in the cinnamon sugar mixture until coated evenly.\nServe and enjoy these delicious Baked Cinnamon Sugar Doughnuts!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/baked-cinnamon-sugar-doughnuts.png"
  },
  {
    "title": "Raspberry White Chocolate Scones",
    "tag_names": [
      "Breads",
      "Desserts"
    ],
    "description": "Delicious scones with a burst of raspberries and smooth white chocolate for a perfect treat.",
    "yield": "Makes 12 scones",
    "active_time": "15 minutes",
    "total_time": "35 minutes",
    "ingredients": "2 cups all-purpose flour\n1/3 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/2 cup cold unsalted butter, cut into small pieces\n1/2 cup heavy cream\n1 large egg\n1 teaspoon vanilla extract\n1/2 cup fresh raspberries\n1/2 cup white chocolate chips",
    "instructions": "Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.\nIn a large bowl, whisk together the flour, sugar, baking powder, and salt.\nAdd the cold butter pieces to the flour mixture and cut in using a pastry cutter or your fingers until the mixture resembles coarse crumbs.\nIn a separate bowl, whisk together the heavy cream, egg, and vanilla extract.\nPour the wet ingredients into the dry ingredients and stir until combined. Gently fold in the raspberries and white chocolate chips.\nTransfer the dough to a floured surface and pat it into a circle about 1 inch thick. Cut the circle into 8 wedges.\nPlace the scones on the prepared baking sheet and bake for 18-20 minutes, or until golden brown.\nAllow the scones to cool slightly before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-white-chocolate-scones.png"
  },
  {
    "title": "Acai Berry Smoothie Bowl",
    "tag_names": [
      "Breakfast",
      "Beverages",
      "Desserts"
    ],
    "description": "A refreshing and nutritious smoothie bowl filled with the goodness of acai berries.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 packet of frozen acai puree\n1 frozen banana\n1/2 cup frozen mixed berries\n1/2 cup almond milk\nToppings: sliced fruits, granola, chia seeds, coconut flakes",
    "instructions": "In a blender, combine the frozen acai puree, frozen banana, mixed berries, and almond milk.\nBlend until smooth and creamy, scraping down the sides as needed.\nPour the smoothie into a bowl and top with your favorite toppings such as sliced fruits, granola, chia seeds, and coconut flakes.\nEnjoy your delicious and nutritious Acai Berry Smoothie Bowl!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/acai-berry-smoothie-bowl.png"
  },
  {
    "title": "Greek Spinach Pie Bites",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious bite-sized appetizers featuring the flavors of Greek spinach pie in a convenient form.",
    "yield": "Makes about 24 pie bites",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "10 oz frozen spinach, thawed and drained\n1/2 cup crumbled feta cheese\n1/4 cup grated Parmesan cheese\n2 green onions, chopped\n1/4 cup chopped fresh dill\n2 eggs, beaten\nSalt and pepper to taste\n1 package of phyllo pastry sheets, thawed\n1/2 cup melted butter",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a large bowl, mix together the spinach, feta cheese, Parmesan cheese, green onions, dill, eggs, salt, and pepper.\nPlace one sheet of phyllo pastry on a clean surface and brush it lightly with melted butter. Place another sheet on top and brush with butter. Repeat with two more sheets, brushing each with butter.\nCut the layered phyllo sheets into 6 equal squares.\nPlace a spoonful of the spinach mixture in the center of each square.\nFold the corners of each square towards the center to create a small pie bite. Brush the tops with more melted butter.\nPlace the pie bites on a baking sheet and bake for 20-25 minutes, or until golden brown and crisp.\nServe the Greek Spinach Pie Bites warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/greek-spinach-pie-bites.png"
  },
  {
    "title": "Caramelized Fig Crostini",
    "tag_names": [
      "Appetizers",
      "Desserts"
    ],
    "description": "Delicious appetizer featuring sweet caramelized figs on crispy crostini.",
    "yield": "Makes 12 crostini",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "6 fresh figs, sliced\n2 tablespoons honey\n1 tablespoon balsamic vinegar\n1 baguette, sliced\n4 ounces goat cheese\n2 tablespoons chopped fresh thyme\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 350°F (175°C).\nIn a small bowl, mix the honey and balsamic vinegar.\nHeat a non-stick skillet over medium-high heat.\nAdd the fig slices and drizzle with the honey-balsamic mixture. Cook for 2-3 minutes until caramelized, stirring occasionally.\nPlace the baguette slices on a baking sheet and toast in the oven for 5-7 minutes until lightly crisp.\nSpread each toasted baguette slice with goat cheese.\nTop with caramelized fig slices.\nSprinkle with fresh thyme, salt, and pepper.\nServe warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caramelized-fig-crostini.png"
  },
  {
    "title": "Spicy Chipotle Cornbread",
    "tag_names": [
      "Breads",
      "Appetizers"
    ],
    "description": "A delicious and flavorful cornbread recipe with a spicy twist from chipotle.",
    "yield": "Serves 8",
    "active_time": "15 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 cup cornmeal\n1 cup all-purpose flour\n1 tbsp baking powder\n1/2 tsp salt\n2 tbsp sugar\n1/2 cup buttermilk\n1/2 cup sour cream\n2 eggs\n1/4 cup melted butter\n2 chipotle peppers in adobo sauce, minced",
    "instructions": "Preheat the oven to 375°F (190°C) and grease a baking pan.\nIn a mixing bowl, combine the cornmeal, flour, baking powder, salt, and sugar.\nIn another bowl, whisk together the buttermilk, sour cream, eggs, and melted butter.\nAdd the wet ingredients to the dry ingredients and mix until just combined.\nFold in the minced chipotle peppers.\nPour the batter into the prepared baking pan and spread it evenly.\nBake in the preheated oven for about 25-30 minutes, or until a toothpick inserted in the center comes out clean.\nLet the cornbread cool slightly before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spicy-chipotle-cornbread.png"
  },
  {
    "title": "Pomegranate Arugula Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and colorful salad featuring the vibrant flavors of pomegranate seeds and peppery arugula.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "15 minutes",
    "ingredients": "4 cups of arugula\n1 cup of pomegranate seeds\n1/4 cup of crumbled feta cheese\n1/4 cup of chopped walnuts\n2 tablespoons of balsamic vinegar\n1 tablespoon of olive oil\nSalt and pepper to taste",
    "instructions": "1. In a large bowl, combine the arugula, pomegranate seeds, feta cheese, and walnuts.\n2. In a small bowl, whisk together the balsamic vinegar, olive oil, salt, and pepper.\n3. Drizzle the dressing over the salad and toss to combine.\n4. Serve and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pomegranate-arugula-salad.png"
  },
  {
    "title": "Pistachio Rose Cupcakes",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicious cupcakes infused with pistachio and rose flavors.",
    "yield": "Makes 12 cupcakes",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 1/2 cups all-purpose flour\n1 1/2 tsp baking powder\n1/4 tsp salt\n1/2 cup unsalted butter, softened\n3/4 cup granulated sugar\n2 large eggs\n1/2 cup milk\n2 tsp rose water\n1/3 cup chopped pistachios for topping\nFor the frosting:\n1/2 cup unsalted butter, softened\n2 cups powdered sugar\n1-2 tbsp milk or cream\n1/2 tsp rose water\nPink food coloring (optional)",
    "instructions": "Preheat the oven to 350°F (180°C) and line a cupcake tin with paper liners.\nIn a medium bowl, whisk together flour, baking powder, and salt.\nIn a separate bowl, cream together butter and sugar until light and fluffy.\nAdd eggs one at a time, mixing well after each addition. Stir in rose water.\nGradually add the dry ingredients to the wet ingredients, alternating with milk, and mix until just combined.\nDivide the batter evenly among the cupcake liners, filling each about 2/3 full.\nBake for 18-20 minutes or until a toothpick inserted into the center comes out clean.\nAllow the cupcakes to cool completely before frosting.\nFor the frosting, beat the butter until creamy. Gradually add powdered sugar, milk, rose water, and food coloring (if using) until desired consistency is reached.\nPipe or spread the frosting on the cooled cupcakes and sprinkle with chopped pistachios.\nEnjoy these delightful Pistachio Rose Cupcakes!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pistachio-rose-cupcakes.png"
  },
  {
    "title": "Ginger Turmeric Immuni-Tea",
    "tag_names": [
      "Beverages"
    ],
    "description": "A soothing tea blend infused with ginger and turmeric for immune-boosting benefits.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "2 cups water\n1-inch fresh ginger, sliced\n1 teaspoon ground turmeric\n1 tablespoon honey (optional)\nJuice of half a lemon",
    "instructions": "In a small saucepan, bring the water to a simmer.\nAdd the ginger slices and ground turmeric to the water.\nSimmer for 5 minutes to infuse the flavors.\nStrain the tea into mugs.\nStir in honey, if desired, and lemon juice.\nEnjoy the Ginger Turmeric Immuni-Tea warm.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/ginger-turmeric-immuni-tea.png"
  },
  {
    "title": "Crispy Artichoke Hearts",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious crispy artichoke hearts that make a perfect appetizer or side dish.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "1 can of artichoke hearts\n1 cup of breadcrumbs\n2 eggs\n1/2 cup of grated Parmesan cheese\n1/2 teaspoon of garlic powder\nSalt and pepper to taste\nOlive oil for frying",
    "instructions": "Drain and pat dry the artichoke hearts.\nIn a bowl, beat the eggs and season with salt and pepper.\nIn another bowl, mix the breadcrumbs, Parmesan cheese, and garlic powder.\nDip each artichoke heart in the egg mixture, then coat with the breadcrumb mixture.\nHeat olive oil in a skillet over medium heat.\nFry the artichoke hearts until golden brown and crispy, about 3-4 minutes per side.\nRemove from the pan and place on a paper towel-lined plate to drain excess oil.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/crispy-artichoke-hearts.png"
  },
  {
    "title": "Chocolate Cherry Bliss Balls",
    "tag_names": [
      "Desserts"
    ],
    "description": "These no-bake chocolate cherry bliss balls are a delicious and healthy treat. Made with only a few simple ingredients, they are perfect for a quick energy boost or snack.",
    "yield": "Makes about 12 bliss balls",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup rolled oats\n1/2 cup dried cherries\n1/4 cup cocoa powder\n1/4 cup honey or maple syrup\n1/2 tsp vanilla extract\n1/4 cup shredded coconut (optional, for coating)",
    "instructions": "In a food processor, blend the rolled oats until they form a fine flour-like consistency.\nAdd the dried cherries, cocoa powder, honey or maple syrup, and vanilla extract to the food processor. Blend until well combined and sticky.\nRoll the mixture into small balls, about 1 inch in diameter.\nIf desired, roll the bliss balls in shredded coconut to coat.\nPlace the bliss balls in an airtight container and refrigerate for at least 15 minutes before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-cherry-bliss-balls.png"
  },
  {
    "title": "Tomato Basil Zoodle Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and healthy salad with spiralized zucchini noodles, cherry tomatoes, and fresh basil tossed in a light vinaigrette dressing.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 medium zucchinis, spiralized\n1 cup cherry tomatoes, halved\n1/4 cup fresh basil leaves, chopped\n2 tbsp olive oil\n1 tbsp balsamic vinegar\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine the spiralized zucchini noodles, cherry tomatoes, and basil leaves.\nIn a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.\nPour the dressing over the salad ingredients and toss to combine evenly.\nServe immediately or refrigerate for a while to let the flavors meld before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/tomato-basil-zoodle-salad.png"
  },
  {
    "title": "Coconut Mango Rice Pudding",
    "tag_names": [
      "Desserts"
    ],
    "description": "Creamy and tropical, this coconut mango rice pudding is a delightful dessert that combines the flavors of coconut and ripe mango.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "1 cup of arborio rice\n2 cups of coconut milk\n1/2 cup of sugar\n1 ripe mango, diced\n1/2 teaspoon of vanilla extract\n1/4 teaspoon of salt\nToasted coconut flakes for garnish",
    "instructions": "In a saucepan, combine the coconut milk, sugar, vanilla extract, and salt. Bring to a simmer over medium heat.\nStir in the arborio rice and reduce the heat to low. Let the rice simmer gently, stirring occasionally, for about 45 minutes or until the rice is creamy and cooked through.\nRemove the saucepan from heat and gently fold in the diced mango.\nDivide the rice pudding into serving bowls and garnish with toasted coconut flakes.\nChill in the refrigerator for at least 2 hours before serving. Enjoy the coconut mango rice pudding chilled!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/coconut-mango-rice-pudding.png"
  },
  {
    "title": "Stuffed Mini Peppers",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious appetizers made by stuffing mini peppers with a flavorful filling.",
    "yield": "Makes 12 stuffed mini peppers",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "12 mini peppers\n1/2 cup cooked quinoa\n1/4 cup black beans, rinsed and drained\n1/4 cup corn kernels\n1/4 cup diced tomatoes\n1/4 cup shredded cheddar cheese\n1/2 teaspoon cumin\n1/2 teaspoon chili powder\nSalt and pepper to taste\nFresh cilantro leaves for garnish",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the tops off the mini peppers and remove the seeds and membranes.\nIn a bowl, mix together the cooked quinoa, black beans, corn, diced tomatoes, cheddar cheese, cumin, chili powder, salt, and pepper.\nStuff each mini pepper with the quinoa mixture.\nPlace the stuffed mini peppers on a baking sheet and bake in the preheated oven for 15-20 minutes, or until the peppers are tender.\nGarnish with fresh cilantro leaves before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/stuffed-mini-peppers.png"
  },
  {
    "title": "Mocha Java Brownies",
    "tag_names": [
      "Desserts"
    ],
    "description": "Indulge in the rich flavors of chocolate and coffee with these decadent Mocha Java Brownies.",
    "yield": "Makes 12 brownies",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "1 cup all-purpose flour\n1/2 cup unsalted butter\n1 cup granulated sugar\n2 large eggs\n1/2 cup unsweetened cocoa powder\n2 tbsp instant coffee granules\n1 tsp vanilla extract\n1/4 tsp salt\n1/2 cup semisweet chocolate chips",
    "instructions": "Preheat the oven to 350°F (175°C) and grease a 9x9-inch baking pan.\nIn a small bowl, dissolve the instant coffee granules in 1 tablespoon of hot water.\nIn a saucepan, melt the butter over low heat. Remove from heat and stir in the sugar, eggs, cocoa powder, dissolved coffee, vanilla extract, and salt until smooth.\nGradually add the flour and mix until well combined. Fold in the chocolate chips.\nPour the batter into the prepared baking pan and smooth the top.\nBake in the preheated oven for about 25-30 minutes, or until a toothpick inserted into the center comes out with moist crumbs.\nAllow the brownies to cool in the pan before cutting into squares. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mocha-java-brownies.png"
  },
  {
    "title": "Pear Cranberry Galette",
    "tag_names": [
      "Desserts"
    ],
    "description": "A rustic and delicious pear and cranberry galette that's perfect for a cozy fall dessert.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 refrigerated pie crust\n3 ripe pears, thinly sliced\n1 cup fresh cranberries\n1/3 cup granulated sugar\n1 tablespoon cornstarch\n1 teaspoon cinnamon\n1 tablespoon lemon juice\n1 egg, beaten (for egg wash)\n2 tablespoons turbinado sugar (for sprinkling)",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a large bowl, gently toss the sliced pears, cranberries, sugar, cornstarch, cinnamon, and lemon juice until well combined.\nPlace the refrigerated pie crust on a baking sheet lined with parchment paper.\nArrange the pear and cranberry mixture in the center of the pie crust, leaving a 2-inch border around the edges.\nFold the edges of the pie crust over the fruit filling, pleating as needed.\nBrush the edges of the galette with the beaten egg and sprinkle with turbinado sugar.\nBake for 30-35 minutes, or until the crust is golden brown and the fruit is bubbling.\nAllow the galette to cool slightly before serving. Enjoy warm with a scoop of vanilla ice cream, if desired.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pear-cranberry-galette.png"
  },
  {
    "title": "Matcha Chia Pudding Parfait",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and nutritious layered dessert perfect for a summer treat.",
    "yield": "Serves 2",
    "active_time": "15 minutes",
    "total_time": "4 hours (including chilling time)",
    "ingredients": "1/4 cup chia seeds\n1 cup almond milk\n1 tablespoon matcha powder\n1 tablespoon maple syrup\n1/2 teaspoon vanilla extract\n1/4 cup granola\n1/2 cup fresh berries\nMint leaves for garnish",
    "instructions": "In a bowl, whisk together chia seeds, almond milk, matcha powder, maple syrup, and vanilla extract.\nCover and refrigerate for at least 4 hours or overnight to allow the chia seeds to gel.\nTo assemble the parfait, layer the matcha chia pudding, granola, and fresh berries in a glass.\nRepeat the layers until the glass is filled, ending with a layer of berries on top.\nGarnish with mint leaves and serve chilled.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/matcha-chia-pudding-parfait.png"
  },
  {
    "title": "Spinach Feta Stuffed Chicken",
    "tag_names": [
      "Entrees",
      "Lunch"
    ],
    "description": "Juicy chicken breasts stuffed with a flavorful combination of spinach and feta cheese.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 boneless, skinless chicken breasts\n1 cup of spinach, chopped\n1/2 cup of feta cheese, crumbled\n2 cloves of garlic, minced\n1 tablespoon of olive oil\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a skillet, heat olive oil over medium heat. Add garlic and sauté until fragrant.\nAdd chopped spinach to the skillet and cook until wilted. Remove from heat and let cool.\nCut a pocket into each chicken breast. Stuff each breast with the spinach and feta mixture, securing with toothpicks if needed.\nSeason the stuffed chicken breasts with salt and pepper.\nPlace the stuffed chicken breasts in a baking dish and bake in the preheated oven for 25-30 minutes or until the chicken is cooked through.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spinach-feta-stuffed-chicken.png"
  },
  {
    "title": "Lemon Blueberry Biscuits",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious and fluffy biscuits with a burst of lemon and blueberry flavors.",
    "yield": "Makes 12 biscuits",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "2 cups all-purpose flour\n1/3 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\nZest of 1 lemon\n1/2 cup cold unsalted butter, cut into small pieces\n1 cup fresh blueberries\n3/4 cup buttermilk\n1 tablespoon lemon juice\n1 teaspoon vanilla extract",
    "instructions": "Preheat oven to 425°F (220°C) and line a baking sheet with parchment paper.\nIn a large bowl, combine the flour, sugar, baking powder, salt, and lemon zest. Cut in the cold butter using a pastry cutter or your fingers until the mixture resembles coarse crumbs.\nGently fold in the fresh blueberries.\nIn a separate bowl, mix together the buttermilk, lemon juice, and vanilla extract. Pour the wet ingredients into the dry ingredients and mix until just combined.\nTransfer the dough onto a floured surface and pat it into a 1-inch thick circle. Use a round cutter to cut out biscuits and place them on the prepared baking sheet.\nBake for 15-18 minutes or until the biscuits are golden brown.\nServe warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-blueberry-biscuits.png"
  },
  {
    "title": "Spicy Peach Salsa",
    "tag_names": [
      "Appetizers",
      "Miscellaneous"
    ],
    "description": "This tangy and spicy peach salsa is the perfect accompaniment to grilled meats or as a topping on tacos.",
    "yield": "Makes about 2 cups",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 ripe peaches, diced\n1/2 red onion, finely chopped\n1 jalapeño pepper, seeds removed and minced\nJuice of 1 lime\n1/4 cup chopped fresh cilantro\nSalt and pepper to taste",
    "instructions": "In a mixing bowl, combine diced peaches, chopped red onion, minced jalapeño pepper, lime juice, and cilantro.\nSeason with salt and pepper, and mix well to combine.\nCover and refrigerate for at least 15 minutes to let the flavors meld together before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spicy-peach-salsa.png"
  },
  {
    "title": "Caramel Pecan Sticky Buns",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious and sweet sticky buns with caramel and pecans.",
    "yield": "Makes 12 buns",
    "active_time": "30 minutes",
    "total_time": "2 hours",
    "ingredients": "For the dough:\n2 1/4 teaspoons active dry yeast\n1 cup warm milk\n1/2 cup granulated sugar\n1/3 cup unsalted butter, melted\n1 teaspoon salt\n2 eggs\n4 cups all-purpose flour\nFor the filling:\n1/2 cup unsalted butter, softened\n1 cup brown sugar\n2 teaspoons ground cinnamon\n1/2 cup chopped pecans\nFor the caramel glaze:\n1/2 cup unsalted butter\n1 cup packed brown sugar\n1/4 cup light corn syrup\n1 cup pecan halves",
    "instructions": "In a large bowl, dissolve yeast in warm milk and let it sit for 5 minutes until frothy.\nAdd sugar, melted butter, salt, eggs, and flour to the yeast mixture. Mix until well combined.\nKnead the dough on a floured surface until smooth. Place in a greased bowl, cover with a kitchen towel, and let it rise for about 1 hour or until doubled in size.\nRoll out the dough into a rectangle, spread softened butter over it, and sprinkle with brown sugar, cinnamon, and chopped pecans.\nRoll up the dough tightly and cut into 12 equal pieces. Place in a greased baking dish.\nIn a saucepan, combine butter, brown sugar, and corn syrup for the caramel glaze. Cook over medium heat until smooth and bubbly. Pour the caramel over the buns and top with pecan halves.\nCover the buns with a towel and let them rise for another 30 minutes.\nPreheat the oven to 350°F (180°C) and bake the sticky buns for 25-30 minutes until golden brown.\nRemove from the oven, let them cool slightly, and enjoy warm.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caramel-pecan-sticky-buns.png"
  },
  {
    "title": "Mango Ginger Smoothie",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and healthy smoothie with the tropical flavor of mango and a zing of ginger.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 ripe mango, peeled and diced\n1-inch piece of fresh ginger, peeled and grated\n1 cup of plain yogurt\n1/2 cup of coconut water\n1 tablespoon of honey\nIce cubes (optional)",
    "instructions": "In a blender, combine the diced mango, grated ginger, yogurt, coconut water, and honey.\nBlend until smooth and creamy. Add ice cubes if desired for a colder consistency.\nPour the smoothie into glasses and serve immediately. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-ginger-smoothie.png"
  },
  {
    "title": "Caprese Stuffed Avocados",
    "tag_names": [
      "Appetizers",
      "Salads"
    ],
    "description": "A delicious and healthy twist on classic Caprese salad, using creamy avocados as the base.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "15 minutes",
    "ingredients": "2 ripe avocados\n1 cup cherry tomatoes, halved\n1 cup fresh mozzarella balls, diced\n2 tbsp fresh basil, chopped\n2 tbsp balsamic glaze\nSalt and pepper to taste",
    "instructions": "Cut the avocados in half and remove the pits.\nScoop out some of the flesh to create a hollow in each avocado half.\nIn a bowl, combine cherry tomatoes, mozzarella, basil, salt, and pepper.\nSpoon the mixture into the hollowed-out avocados.\nDrizzle with balsamic glaze before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caprese-stuffed-avocados.png"
  },
  {
    "title": "Walnut Pear Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing salad combining the sweetness of pears with the crunchiness of walnuts.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "20 minutes",
    "ingredients": "2 ripe pears, thinly sliced\n1 cup of walnuts, chopped\n4 cups of mixed salad greens\n1/4 cup of crumbled feta cheese\n1/4 cup of dried cranberries\n1/4 cup of balsamic vinaigrette\nSalt and pepper to taste",
    "instructions": "In a large salad bowl, combine the sliced pears, walnuts, mixed greens, feta cheese, and dried cranberries.\nDrizzle the balsamic vinaigrette over the salad and toss gently to combine.\nSeason with salt and pepper to taste.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/walnut-pear-salad.png"
  },
  {
    "title": "Roasted Red Pepper Soup",
    "tag_names": [
      "Soups",
      "Appetizers"
    ],
    "description": "A comforting and flavorful soup made with roasted red peppers.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "4 red bell peppers, roasted and peeled\n1 onion, chopped\n2 cloves of garlic, minced\n4 cups vegetable broth\n1 can (14 oz) diced tomatoes\n1 tsp paprika\nSalt and pepper to taste\nOlive oil for cooking\nFresh basil leaves for garnish\nCroutons for serving",
    "instructions": "Preheat the oven to 400°F (200°C).\nPlace the red peppers on a baking sheet and roast in the oven for 30-40 minutes, or until the skins are charred.\nRemove the peppers from the oven and place them in a bowl. Cover the bowl with plastic wrap and let the peppers steam for 10 minutes.\nPeel the skins off the peppers and remove the stems and seeds.\nIn a large pot, heat some olive oil over medium heat. Add the chopped onion and garlic, and sauté until softened.\nAdd the roasted red peppers, vegetable broth, diced tomatoes, paprika, salt, and pepper to the pot. Bring the mixture to a simmer.\nCover the pot and let the soup simmer for 20-30 minutes.\nUse an immersion blender to blend the soup until smooth. Alternatively, transfer the soup to a blender to blend in batches.\nTaste the soup and adjust the seasoning if needed.\nServe the roasted red pepper soup hot, garnished with fresh basil leaves and croutons.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/roasted-red-pepper-soup.png"
  },
  {
    "title": "Sweet Potato Kale Frittata",
    "tag_names": [
      "Breakfast",
      "Lunch",
      "Entrees",
      "Miscellaneous"
    ],
    "description": "A delicious and healthy frittata featuring sweet potatoes and kale.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "1 large sweet potato, peeled and diced\n2 cups chopped kale\n8 large eggs\n1/2 cup milk\n1/2 teaspoon salt\n1/4 teaspoon black pepper\n1 tablespoon olive oil\n1/2 cup shredded cheese (optional)",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a large oven-safe skillet, heat the olive oil over medium heat.\nAdd the sweet potatoes and cook for about 5 minutes until they start to soften.\nAdd the kale to the skillet and cook for another 2-3 minutes until wilted.\nIn a separate bowl, whisk together the eggs, milk, salt, and pepper.\nPour the egg mixture over the sweet potato and kale mixture in the skillet.\nSprinkle shredded cheese on top if desired.\nTransfer the skillet to the preheated oven and bake for about 20-25 minutes until the frittata is set and slightly golden on top.\nRemove from the oven and let it cool slightly before slicing and serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sweet-potato-kale-frittata.png"
  },
  {
    "title": "Blackberry Lime Sorbet",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and tangy sorbet made with fresh blackberries and lime juice.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "4 hours",
    "ingredients": "4 cups fresh blackberries\n1 cup sugar\n1/2 cup water\n1/4 cup fresh lime juice\nZest of 1 lime",
    "instructions": "In a saucepan, combine sugar and water. Heat over medium heat, stirring until sugar is dissolved.\nAdd blackberries and cook for 5 minutes, stirring occasionally. Remove from heat and let it cool.\nBlend the blackberry mixture until smooth. Strain to remove seeds, if desired.\nStir in lime juice and lime zest.\nPour the mixture into a shallow dish and freeze for 3-4 hours, stirring every 30 minutes for a smooth sorbet texture.\nServe the sorbet in chilled bowls and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blackberry-lime-sorbet.png"
  },
  {
    "title": "Buffalo Cauliflower Bites",
    "tag_names": [
      "Appetizers"
    ],
    "description": "These spicy buffalo cauliflower bites are a delicious and healthy alternative to traditional buffalo wings.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 head of cauliflower, cut into florets\n1/2 cup all-purpose flour\n1/2 cup water\n1/2 tsp garlic powder\n1/2 tsp onion powder\n1/4 tsp salt\n1/4 tsp black pepper\n1/2 cup buffalo sauce\n2 tbsp melted butter or olive oil",
    "instructions": "Preheat oven to 450°F (230°C) and line a baking sheet with parchment paper.\nIn a large bowl, mix together flour, water, garlic powder, onion powder, salt, and pepper to make a batter.\nDip each cauliflower floret into the batter, making sure to coat it completely, then place it on the baking sheet.\nBake the cauliflower in the preheated oven for 20-25 minutes, or until golden brown and crispy.\nIn a separate bowl, mix together the buffalo sauce and melted butter or olive oil.\nOnce the cauliflower is done baking, toss it in the buffalo sauce mixture until evenly coated.\nReturn the cauliflower to the baking sheet and bake for an additional 5 minutes.\nServe hot with your favorite dipping sauce and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/buffalo-cauliflower-bites.png"
  },
  {
    "title": "Apple Streusel Coffee Cake",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delicious coffee cake with tender apples and a crunchy streusel topping.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "2 cups all-purpose flour\n1 tsp baking powder\n1/2 tsp baking soda\n1/2 tsp salt\n1/2 cup unsalted butter, softened\n1 cup granulated sugar\n2 large eggs\n1 tsp vanilla extract\n1/2 cup sour cream\n2 cups diced apples (such as Granny Smith)\n1/2 cup chopped walnuts or pecans\n1/3 cup brown sugar\n1/3 cup all-purpose flour\n1/2 tsp ground cinnamon\n1/4 cup unsalted butter, cold and cubed",
    "instructions": "Preheat the oven to 350°F (175°C) and grease a 9-inch square baking pan.\nIn a medium bowl, whisk together the flour, baking powder, baking soda, and salt.\nIn a large mixing bowl, cream together the softened butter and sugar until light and fluffy.\nAdd the eggs one at a time, beating well after each addition. Stir in the vanilla.\nMix in the dry ingredients alternately with the sour cream, starting and ending with the dry ingredients.\nFold in the diced apples and chopped nuts, then spread the batter into the prepared pan.\nIn a separate bowl, combine the brown sugar, flour, and cinnamon. Cut in the cold butter cubes until the mixture resembles coarse crumbs.\nSprinkle the streusel topping evenly over the batter.\nBake in the preheated oven for 45-50 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the coffee cake to cool slightly before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/apple-streusel-coffee-cake.png"
  },
  {
    "title": "Blueberry Basil Lemonade",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing summer drink with a unique twist of basil, sweetened with blueberries and a hint of zesty lemon flavor.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup fresh blueberries\n1/2 cup fresh basil leaves\n1 cup freshly squeezed lemon juice\n1/2 cup honey or simple syrup\n4 cups cold water\nIce cubes\nFresh basil leaves and blueberries for garnish",
    "instructions": "In a blender, combine blueberries, basil leaves, and lemon juice. Blend until smooth.\nStrain the mixture through a fine mesh sieve into a pitcher. Discard solids.\nStir in honey or simple syrup until well combined.\nAdd cold water and mix thoroughly.\nRefrigerate until chilled.\nServe over ice, garnished with fresh basil leaves and blueberries.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-basil-lemonade.png"
  },
  {
    "title": "Buttermilk Biscuit Sliders",
    "tag_names": [
      "Breads",
      "Lunch",
      "Appetizers"
    ],
    "description": "Delicious buttermilk biscuit sliders with your choice of filling.",
    "yield": "Makes 12 sliders",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "2 cups all-purpose flour\n1 tablespoon baking powder\n1/2 teaspoon baking soda\n1/2 teaspoon salt\n1/2 cup unsalted butter, cold and cut into small pieces\n3/4 cup buttermilk\nYour choice of filling (e.g., grilled chicken, crispy bacon, sliced cheese)\nAdditional toppings (e.g., lettuce, tomato, mayonnaise)",
    "instructions": "Preheat the oven to 450°F (230°C) and line a baking sheet with parchment paper.\nIn a large bowl, whisk together the flour, baking powder, baking soda, and salt.\nAdd the cold butter pieces to the flour mixture and use your fingers or a pastry cutter to cut the butter into the flour until it resembles coarse crumbs.\nMake a well in the center of the flour mixture and pour in the buttermilk. Stir until the dough starts to come together.\nTurn the dough out onto a lightly floured surface and knead gently until it holds together.\nRoll out the dough to about 1/2-inch thickness and use a round cutter to cut out biscuits.\nPlace the biscuits on the prepared baking sheet and bake for 10-12 minutes, or until golden brown.\nOnce the biscuits are baked and cooled slightly, slice them in half and assemble your sliders with your choice of filling and additional toppings.\nSecure the sliders with toothpicks and serve warm. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/buttermilk-biscuit-sliders.png"
  },
  {
    "title": "Spicy Tofu Lettuce Wraps",
    "tag_names": [
      "Appetizers",
      "Lunch"
    ],
    "description": "These Spicy Tofu Lettuce Wraps are a delicious and healthy vegan dish that is perfect for a light and flavorful meal.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 block of extra firm tofu, drained and crumbled\n1 tablespoon soy sauce\n1 tablespoon sriracha sauce\n1 teaspoon sesame oil\n1 clove garlic, minced\n1 teaspoon grated ginger\n1/2 red bell pepper, diced\n1/4 cup chopped green onions\n1 tablespoon hoisin sauce\n1 head of butter or iceberg lettuce, leaves separated",
    "instructions": "In a bowl, mix together crumbled tofu, soy sauce, sriracha sauce, sesame oil, garlic, and ginger.\nHeat a non-stick skillet over medium heat and add the tofu mixture. Cook for 5-7 minutes until tofu is heated through and slightly crispy.\nAdd diced red bell pepper, green onions, and hoisin sauce to the skillet. Cook for another 2-3 minutes.\nSpoon the tofu mixture into lettuce leaves and serve immediately.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spicy-tofu-lettuce-wraps.png"
  },
  {
    "title": "Rainbow Fruit Kebabs",
    "tag_names": [
      "Desserts",
      "Appetizers"
    ],
    "description": "Colorful and healthy fruit kebabs that are perfect for parties and gatherings.",
    "yield": "Makes 6 kebabs",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 kiwi, sliced\n1 cup strawberries, hulled\n1 cup pineapple, cubed\n1 cup green grapes\n1 cup blueberries\n1 cup raspberries\n6 skewers",
    "instructions": "Thread the fruits onto the skewers in a rainbow pattern starting with the purple/blue fruits and ending with the red fruits.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/rainbow-fruit-kebabs.png"
  },
  {
    "title": "Pecan Pie Energy Bites",
    "tag_names": [
      "Desserts"
    ],
    "description": "These pecan pie energy bites are the perfect healthy and energizing snack for when you need a little pick-me-up during the day.",
    "yield": "Makes about 12 energy bites",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup of dates, pitted\n1 cup of pecans\n1/4 cup of rolled oats\n1 tablespoon of maple syrup\n1 teaspoon of vanilla extract\nA pinch of salt",
    "instructions": "In a food processor, blend the dates, pecans, rolled oats, maple syrup, vanilla extract, and salt until well combined and the mixture sticks together.\nRoll the mixture into small bite-sized balls and place them on a baking sheet.\nRefrigerate the energy bites for at least 15 minutes before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pecan-pie-energy-bites.png"
  },
  {
    "title": "Ratatouille Stuffed Peppers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "A delicious and healthy recipe that combines the flavors of ratatouille with bell peppers.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 large bell peppers, any color\n1 zucchini, diced\n1 eggplant, diced\n1 onion, diced\n2 cloves of garlic, minced\n1 can (14 oz) diced tomatoes\n1/2 cup tomato sauce\n1 tsp dried oregano\n1 tsp dried basil\nSalt and pepper to taste\n1/2 cup grated Parmesan cheese",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the tops off the bell peppers and remove the seeds and membranes.\nIn a skillet, sauté the onion and garlic until fragrant. Add the zucchini, eggplant, diced tomatoes, tomato sauce, oregano, basil, salt, and pepper. Cook until vegetables are tender.\nFill each bell pepper with the vegetable mixture and place them in a baking dish.\nCover the dish with foil and bake for 30 minutes.\nRemove the foil, sprinkle Parmesan cheese on top of each pepper, and bake uncovered for an additional 10 minutes until the cheese is melted and bubbly.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/ratatouille-stuffed-peppers.png"
  },
  {
    "title": "Lemon Poppyseed Pancakes",
    "tag_names": [
      "Breakfast",
      "Desserts",
      "Breads"
    ],
    "description": "Delicious and fluffy pancakes with a refreshing hint of lemon and poppyseeds.",
    "yield": "Makes 8 pancakes",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup all-purpose flour\n1 tablespoon sugar\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1/4 teaspoon salt\n1 tablespoon poppyseeds\n1 egg\n1 cup buttermilk\n2 tablespoons lemon juice\nZest of 1 lemon\n2 tablespoons melted butter",
    "instructions": "In a mixing bowl, whisk together the flour, sugar, baking powder, baking soda, salt, and poppyseeds.\nIn another bowl, whisk the egg, buttermilk, lemon juice, lemon zest, and melted butter.\nPour the wet ingredients into the dry ingredients and stir until just combined. Do not overmix; some lumps are okay.\nHeat a griddle or non-stick skillet over medium heat and lightly grease with butter or cooking spray.\nPour 1/4 cup of batter onto the griddle for each pancake.\nCook until bubbles form on the surface of the pancake, then flip and cook for another 1-2 minutes, or until golden brown.\nServe warm with maple syrup and additional lemon zest if desired.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-poppyseed-pancakes.png"
  },
  {
    "title": "Cranberry Orange Chutney",
    "tag_names": [
      "Appetizers"
    ],
    "description": "A delicious and tangy condiment that pairs perfectly with holiday meals. The combination of cranberries and oranges creates a vibrant burst of flavor.",
    "yield": "Makes approximately 2 cups",
    "active_time": "15 minutes",
    "total_time": "45 minutes",
    "ingredients": "12 oz fresh cranberries\n1 orange, zest and juice\n1 cup sugar\n1/2 cup water\n1/4 tsp ground cinnamon\n1/4 tsp ground ginger\n1/8 tsp ground cloves",
    "instructions": "In a saucepan, combine cranberries, orange zest, orange juice, sugar, water, and spices.\nBring mixture to a boil, then reduce heat and simmer for 15-20 minutes until cranberries burst and chutney thickens.\nAllow chutney to cool before serving. It can be stored in the refrigerator for up to a week.\nEnjoy the Cranberry Orange Chutney with your favorite holiday dishes!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cranberry-orange-chutney.png"
  },
  {
    "title": "Mango Coconut Popsicles",
    "tag_names": [
      "Desserts",
      "Beverages"
    ],
    "description": "Refreshing and tropical popsicles combining the flavors of ripe mango and creamy coconut milk.",
    "yield": "Makes 6 popsicles",
    "active_time": "15 minutes",
    "total_time": "4 hours (including freezing time)",
    "ingredients": "2 ripe mangoes, peeled and diced\n1 can (13.5 oz) coconut milk\n1/4 cup honey or maple syrup\n1 teaspoon vanilla extract\nPinch of salt",
    "instructions": "In a blender, combine the diced mangoes, coconut milk, honey or maple syrup, vanilla extract, and a pinch of salt. Blend until smooth.\nPour the mixture into popsicle molds, leaving a little space at the top for expansion.\nInsert popsicle sticks into the molds and freeze for at least 4 hours or until solid.\nTo remove the popsicles, run the molds under warm water for a few seconds and gently pull out the popsicles. Enjoy your homemade Mango Coconut Popsicles!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-coconut-popsicles.png"
  },
  {
    "title": "Moroccan Chickpea Stew",
    "tag_names": [
      "Entrees",
      "Soups"
    ],
    "description": "A flavorful and hearty stew with Moroccan spices and chickpeas.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "2 tbsp olive oil\n1 onion, diced\n2 cloves garlic, minced\n1 tsp ground cumin\n1 tsp ground coriander\n1 tsp paprika\n1/2 tsp ground turmeric\n1/4 tsp cinnamon\n1 can (15 oz) chickpeas, drained and rinsed\n1 can (14.5 oz) diced tomatoes\n2 cups vegetable broth\n1/2 cup dried apricots, chopped\nSalt and pepper to taste\nFresh cilantro for garnish",
    "instructions": "In a large pot, heat olive oil over medium heat. Add diced onion and garlic, and sauté until softened.\nAdd ground cumin, coriander, paprika, turmeric, and cinnamon to the pot. Stir well to coat the onion and garlic in the spices.\nAdd chickpeas, diced tomatoes, vegetable broth, and chopped dried apricots to the pot. Season with salt and pepper.\nBring the stew to a simmer, then reduce heat and let it cook for about 45 minutes to allow the flavors to meld together.\nTaste and adjust seasoning as needed. Serve hot, garnished with fresh cilantro.\nEnjoy your delicious Moroccan Chickpea Stew!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/moroccan-chickpea-stew.png"
  },
  {
    "title": "Chocolate Coconut Macaroons",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicious chocolate and coconut combination in a chewy macaroon.",
    "yield": "Makes 20 macaroons",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "3 cups shredded coconut\n3/4 cup sweetened condensed milk\n1/2 cup chocolate chips\n1/2 teaspoon vanilla extract\n1/4 teaspoon salt",
    "instructions": "Preheat the oven to 325°F (160°C) and line a baking sheet with parchment paper.\nIn a bowl, mix together the shredded coconut, sweetened condensed milk, chocolate chips, vanilla extract, and salt until well combined.\nUsing a cookie scoop or your hands, form the mixture into small mounds and place them on the prepared baking sheet.\nBake for about 15-20 minutes, or until the macaroons are golden brown.\nLet the macaroons cool on the baking sheet before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-coconut-macaroons.png"
  },
  {
    "title": "Watermelon Cucumber Salad",
    "tag_names": [

    ],
    "description": "A refreshing summer salad combining the sweetness of watermelon with the crispness of cucumber.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "3 cups cubed watermelon\n1 large cucumber, thinly sliced\n1/4 red onion, thinly sliced\n1/4 cup feta cheese, crumbled\n2 tablespoons fresh mint leaves, chopped\n2 tablespoons olive oil\n1 tablespoon balsamic vinegar\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine the watermelon, cucumber, red onion, feta cheese, and mint leaves.\nIn a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.\nPour the dressing over the salad and toss gently to combine.\nChill the salad in the refrigerator for at least 15 minutes before serving.\nGarnish with additional mint leaves before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/watermelon-cucumber-salad.png"
  },
  {
    "title": "Lentil Spinach Meatballs",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "Delicious and nutritious meatballs made with lentils and spinach, perfect for a vegetarian meal.",
    "yield": "Makes about 20 meatballs",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 cup dried lentils\n2 cups fresh spinach, chopped\n1 onion, finely chopped\n2 cloves garlic, minced\n1/2 cup breadcrumbs\n1/4 cup grated Parmesan cheese\n2 eggs\n1 teaspoon dried oregano\nSalt and pepper to taste\n2 tablespoons olive oil",
    "instructions": "1. Cook the lentils according to package instructions, then drain and let cool.\n2. In a large bowl, combine the cooked lentils, chopped spinach, onion, garlic, breadcrumbs, Parmesan cheese, eggs, oregano, salt, and pepper. Mix well.\n3. Preheat the oven to 375°F (190°C) and line a baking sheet with parchment paper.\n4. Shape the lentil mixture into meatballs and place them on the prepared baking sheet.\n5. Brush the meatballs with olive oil and bake in the preheated oven for 25-30 minutes, or until golden brown and cooked through.\n6. Serve the lentil spinach meatballs hot with your favorite sauce or on a bed of pasta or salad.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lentil-spinach-meatballs.png"
  },
  {
    "title": "Chai Swirl Pound Cake",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious and moist pound cake with a swirl of chai spices, perfect for tea lovers.",
    "yield": "1 loaf",
    "active_time": "20 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 1/2 cups all-purpose flour\n1 tsp baking powder\n1/2 tsp salt\n1/2 cup unsalted butter, softened\n1 cup granulated sugar\n3 large eggs\n1/2 cup sour cream\n2 tsp vanilla extract\n2 tsp chai spice mix (cinnamon, cardamom, ginger, cloves, nutmeg)\n1/4 cup milk",
    "instructions": "Preheat the oven to 350°F (175°C). Grease and flour a 9x5-inch loaf pan.\nIn a medium bowl, whisk together the flour, baking powder, and salt. Set aside.\nIn a large bowl, cream the butter and sugar until light and fluffy.\nBeat in the eggs, one at a time, then stir in the sour cream and vanilla extract.\nGradually mix in the dry ingredients until just combined.\nTransfer 1/3 of the batter to a separate bowl and stir in the chai spice mix and milk.\nAlternate adding plain batter and chai batter to the loaf pan, creating a swirl effect.\nBake for 55-60 minutes, or until a toothpick inserted into the center comes out clean.\nLet the cake cool in the pan for 15 minutes before transferring to a wire rack to cool completely.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chai-swirl-pound-cake.png"
  },
  {
    "title": "Raspberry Mint Lemonade",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tangy drink perfect for hot summer days.",
    "yield": "Serves 4",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 cup fresh raspberries\n1/4 cup fresh mint leaves\n1 cup freshly squeezed lemon juice\n1/2 cup sugar\n4 cups cold water\nIce cubes\nFresh mint sprigs and raspberries for garnish",
    "instructions": "In a blender, combine raspberries, mint leaves, lemon juice, and sugar. Blend until smooth.\nStrain the mixture through a fine mesh sieve into a pitcher to remove seeds and mint leaves.\nAdd cold water to the pitcher and stir well to combine.\nFill glasses with ice cubes and pour the raspberry mint lemonade over the ice.\nGarnish with fresh mint sprigs and raspberries before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-mint-lemonade.png"
  },
  {
    "title": "Roasted Cauliflower Soup",
    "tag_names": [
      "Soups"
    ],
    "description": "A delicious and creamy soup made with roasted cauliflower.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "1 large head of cauliflower, cut into florets\n2 tablespoons olive oil\n1 onion, chopped\n2 cloves of garlic, minced\n4 cups vegetable broth\n1 teaspoon thyme\n1/2 teaspoon paprika\nSalt and pepper to taste\n1/2 cup heavy cream (optional)",
    "instructions": "Preheat oven to 400°F (200°C).\nToss cauliflower florets with olive oil, salt, and pepper. Spread on a baking sheet and roast for 30-35 minutes, or until golden brown.\nIn a large pot, sauté onion in olive oil until translucent. Add garlic and cook for another minute.\nAdd roasted cauliflower, vegetable broth, thyme, paprika, salt, and pepper. Bring to a simmer and cook for 15-20 minutes.\nUse an immersion blender to puree the soup until smooth. Alternatively, transfer soup to a blender in batches and blend until smooth.\nStir in heavy cream if using, and adjust seasoning as needed.\nServe hot, garnished with roasted cauliflower florets, a drizzle of olive oil, and a sprinkle of paprika.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/roasted-cauliflower-soup.png"
  },
  {
    "title": "Greek Orzo Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and flavorful salad featuring orzo pasta, cucumbers, tomatoes, feta cheese, and a tangy dressing.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup orzo pasta\n1 English cucumber, diced\n1 pint cherry tomatoes, halved\n1/2 cup crumbled feta cheese\n1/4 cup chopped red onion\n1/4 cup chopped fresh parsley\n1/4 cup olive oil\n2 tablespoons red wine vinegar\n1 teaspoon dried oregano\nSalt and pepper to taste",
    "instructions": "Cook orzo pasta according to package instructions. Drain and rinse with cold water.\nIn a large bowl, combine the cooked orzo, cucumber, tomatoes, feta cheese, red onion, and parsley.\nIn a small bowl, whisk together olive oil, red wine vinegar, oregano, salt, and pepper to make the dressing.\nPour the dressing over the salad and toss to combine.\nServe chilled or at room temperature. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/greek-orzo-salad.png"
  },
  {
    "title": "Black Sesame Banana Bread",
    "tag_names": [
      "Breads",
      "Desserts"
    ],
    "description": "A unique twist on classic banana bread with the nutty flavor of black sesame seeds.",
    "yield": "1 loaf",
    "active_time": "20 minutes",
    "total_time": "1 hour 15 minutes",
    "ingredients": "1 3/4 cups all-purpose flour\n1 teaspoon baking soda\n1/2 teaspoon salt\n1/2 cup unsalted butter, melted\n3/4 cup brown sugar\n2 large eggs, beaten\n3 ripe bananas, mashed\n1/4 cup plain Greek yogurt\n2 tablespoons black sesame seeds, toasted",
    "instructions": "Preheat oven to 350°F (175°C) and grease a 9x5-inch loaf pan.\nIn a large bowl, combine flour, baking soda, and salt.\nIn a separate bowl, mix melted butter and brown sugar. Stir in beaten eggs, mashed bananas, and Greek yogurt until well combined.\nFold the wet ingredients into the dry ingredients until just combined. Gently fold in the toasted black sesame seeds.\nPour the batter into the prepared loaf pan and sprinkle some additional sesame seeds on top for garnish.\nBake for 55-60 minutes or until a toothpick inserted into the center comes out clean.\nAllow the banana bread to cool in the pan for 10 minutes before transferring to a wire rack to cool completely.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/black-sesame-banana-bread.png"
  },
  {
    "title": "Pumpkin Sage Risotto",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "A delicious and creamy risotto infused with the flavors of pumpkin and sage.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 1/2 cups Arborio rice\n4 cups chicken or vegetable broth\n1 small onion, finely chopped\n2 cloves garlic, minced\n1 cup canned pumpkin puree\n1/2 cup dry white wine\n1/2 cup Parmesan cheese, grated\n2 tbsp fresh sage, chopped\n2 tbsp butter\nSalt and pepper to taste",
    "instructions": "In a saucepan, heat the chicken or vegetable broth until simmering.\nIn a separate large pan, melt 1 tablespoon of butter over medium heat.\nAdd the chopped onion and garlic, and cook until softened.\nAdd the Arborio rice and stir to coat the grains with the butter.\nPour in the white wine and cook until it has evaporated.\nAdd a ladleful of the hot broth to the rice and stir constantly until the liquid is absorbed.\nContinue adding the broth, one ladleful at a time, and stirring until the rice is creamy and cooked to al dente.\nStir in the pumpkin puree, Parmesan cheese, and chopped sage, and season with salt and pepper.\nRemove from heat and stir in the remaining tablespoon of butter.\nServe the risotto hot, garnished with additional Parmesan cheese and sage leaves.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pumpkin-sage-risotto.png"
  },
  {
    "title": "Blueberry Almond Granola",
    "tag_names": [
      "Breakfast",
      "Desserts",
      "Breads"
    ],
    "description": "Homemade granola packed with blueberries and almonds, perfect for a nutritious breakfast or snack.",
    "yield": "Makes about 4 cups",
    "active_time": "15 minutes",
    "total_time": "45 minutes",
    "ingredients": "2 cups rolled oats\n1/2 cup sliced almonds\n1/2 cup dried blueberries\n1/4 cup honey\n2 tbsp coconut oil, melted\n1 tsp vanilla extract\n1/2 tsp cinnamon\nPinch of salt",
    "instructions": "Preheat the oven to 325°F (160°C) and line a baking sheet with parchment paper.\nIn a large bowl, combine oats, almonds, and blueberries.\nIn a separate bowl, mix honey, melted coconut oil, vanilla extract, cinnamon, and salt.\nPour the liquid mixture over the dry ingredients and stir until well coated.\nSpread the granola mixture evenly on the prepared baking sheet.\nBake for about 25-30 minutes, stirring halfway through, until golden brown and fragrant.\nAllow the granola to cool completely before storing in an airtight container.\nServe with yogurt, milk, or eat on its own as a delicious snack.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-almond-granola.png"
  },
  {
    "title": "Coconut Lime Cooler",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tropical drink that combines the flavors of coconut and lime for a perfect summer cooler.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 cup of coconut milk\n1/2 cup of coconut water\n2 limes, juiced\n4-6 tbsp of sugar (adjust to taste)\nIce cubes\nLime slices and mint leaves for garnish",
    "instructions": "In a blender, combine the coconut milk, coconut water, lime juice, and sugar.\nBlend until smooth and well combined.\nTaste and adjust the sweetness if needed.\nFill glasses with ice cubes.\nPour the coconut lime mixture over the ice.\nGarnish with lime slices and mint leaves.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/coconut-lime-cooler.png"
  },
  {
    "title": "Caprese Bruschetta Bites",
    "tag_names": [
      "Appetizers",
      "Breads",
      "Miscellaneous"
    ],
    "description": "Delicious bites of tomato, mozzarella, and basil on crispy toast. Perfect for parties or as appetizers.",
    "yield": "Makes 12 servings",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 baguette, sliced into 1/2 inch thick pieces\n2 cups cherry tomatoes, halved\n8 oz fresh mozzarella, cut into small cubes\n1/2 cup fresh basil leaves, chopped\n2 cloves garlic, minced\n2 tbsp balsamic glaze\n2 tbsp olive oil\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 400°F (200°C).\nPlace the baguette slices on a baking sheet and drizzle with olive oil.\nBake in the oven for 5-7 minutes or until golden and crispy.\nIn a bowl, combine the cherry tomatoes, mozzarella, basil, garlic, olive oil, balsamic glaze, salt, and pepper. Mix well.\nTop each baguette slice with a spoonful of the tomato mixture.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caprese-bruschetta-bites.png"
  },
  {
    "title": "Honey Sesame Tempeh Bowls",
    "tag_names": [
      "Entrees",
      "Lunch"
    ],
    "description": "A delicious and nutritious bowl featuring crispy honey sesame tempeh served over a bed of fluffy rice and fresh veggies.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 block of tempeh, cubed\n2 tablespoons of soy sauce\n2 tablespoons of honey\n1 tablespoon of sesame oil\n1 clove of garlic, minced\n1 teaspoon of grated ginger\n2 cups of cooked rice\n1 red bell pepper, sliced\n1 cup of broccoli florets\n1 carrot, julienned\n2 green onions, chopped\nSesame seeds for garnish\nCooking oil",
    "instructions": "In a bowl, whisk together soy sauce, honey, sesame oil, garlic, and ginger.\nAdd the tempeh cubes to the marinade, ensuring they are coated evenly. Let it marinate for at least 15 minutes.\nIn a skillet, heat some cooking oil over medium heat. Add the marinated tempeh cubes and cook until crispy and golden brown, about 5-7 minutes per side.\nIn the same skillet, stir-fry the bell pepper, broccoli, and carrot until tender-crisp.\nTo assemble the bowls, divide the cooked rice among 4 serving bowls. Top each with the stir-fried vegetables and the crispy tempeh cubes.\nGarnish with chopped green onions and sesame seeds before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/honey-sesame-tempeh-bowls.png"
  },
  {
    "title": "Plum Almond Galette",
    "tag_names": [
      "Desserts"
    ],
    "description": "A delicious rustic free-form tart with fresh plums and almond filling.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "1 hour 15 minutes",
    "ingredients": "1 1/4 cups all-purpose flour\n1/4 cup almond meal\n2 tablespoons granulated sugar\n1/4 teaspoon salt\n1/2 cup cold unsalted butter, cut into small pieces\n3 tablespoons ice water\n1 1/2 pounds ripe plums, pitted and sliced\n1/4 cup granulated sugar for filling\n1/4 cup almond slices\n1 egg, beaten (for egg wash)\n2 tablespoons apricot jam, for glaze",
    "instructions": "In a food processor, pulse together flour, almond meal, sugar, and salt. Add butter and pulse until mixture resembles coarse crumbs.\nDrizzle cold water over the mixture and pulse until the dough comes together.\nShape the dough into a disc, wrap in plastic, and refrigerate for 30 minutes.\nPreheat oven to 375°F (190°C) and line a baking sheet with parchment paper.\nOn a floured surface, roll out the dough into a 12-inch circle. Transfer to the prepared baking sheet.\nArrange plum slices in the center of the dough, leaving a 1 1/2 inch border.\nSprinkle sugar over plums and fold the edges of the dough over the fruit.\nBrush the crust with egg wash and sprinkle almond slices over the plums.\nBake for about 45-50 minutes, until the crust is golden and the plums are tender.\nHeat apricot jam until smooth and brush over the warm galette for a shiny glaze.\nServe warm with a dollop of whipped cream or a scoop of vanilla ice cream.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/plum-almond-galette.png"
  },
  {
    "title": "Cranberry Pomegranate Smoothie",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and antioxidant-packed smoothie that combines the tangy flavors of cranberry and pomegranate.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "10 minutes",
    "ingredients": "1 cup fresh or frozen cranberries\n1/2 cup pomegranate seeds\n1 ripe banana\n1 cup unsweetened almond milk\n1 tablespoon honey or maple syrup\nIce cubes (optional)",
    "instructions": "Add cranberries, pomegranate seeds, banana, almond milk, and honey/maple syrup to a blender.\nBlend until smooth and creamy.\nIf desired, add ice cubes and blend again for a colder smoothie.\nPour into glasses and serve immediately.\nEnjoy your Cranberry Pomegranate Smoothie!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cranberry-pomegranate-smoothie.png"
  },
  {
    "title": "Southwest Stuffed Peppers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "A flavorful and colorful twist on traditional stuffed peppers with a Southwestern flair.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 large bell peppers, any color\n1 lb ground beef\n1 small onion, diced\n1 cup cooked rice\n1 can (15 oz) black beans, drained and rinsed\n1 can (14.5 oz) diced tomatoes, drained\n1 cup frozen corn\n1 tbsp chili powder\n1 tsp cumin\nSalt and pepper to taste\n1 cup shredded cheddar cheese, divided\nSour cream, salsa, and chopped cilantro for serving",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the tops off the bell peppers and remove the seeds and membranes.\nIn a large skillet, cook the ground beef and onion over medium heat until beef is browned and onion is softened.\nAdd the cooked rice, black beans, diced tomatoes, corn, chili powder, cumin, salt, and pepper to the skillet. Stir to combine and cook for another 5 minutes.\nStir in 1/2 cup of shredded cheddar cheese.\nStuff the bell peppers with the beef mixture and place them in a baking dish. Top each pepper with the remaining shredded cheese.\nCover the baking dish with foil and bake for 30-35 minutes, until the peppers are tender.\nServe the stuffed peppers hot, topped with sour cream, salsa, and chopped cilantro.\nEnjoy your delicious Southwest Stuffed Peppers!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/southwest-stuffed-peppers.png"
  },
  {
    "title": "Raspberry Almond Crumble",
    "tag_names": [
      "Desserts"
    ],
    "description": "A delightful dessert that combines the tangy flavor of raspberries with the nuttiness of almonds in a comforting crumble.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 1/2 cups fresh raspberries\n1/4 cup granulated sugar\n1 tablespoon lemon juice\n1/2 cup all-purpose flour\n1/3 cup brown sugar\n1/2 cup old-fashioned oats\n1/4 cup sliced almonds\n1/4 teaspoon salt\n1/4 cup unsalted butter, cold and diced",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a mixing bowl, combine raspberries, granulated sugar, and lemon juice. Toss to coat the raspberries. Transfer the mixture to a baking dish.\nIn a separate bowl, combine flour, brown sugar, oats, almonds, and salt. Add the cold diced butter and use your fingers to rub the mixture until it resembles coarse crumbs.\nSprinkle the crumble mixture evenly over the raspberries in the baking dish.\nBake in the preheated oven for about 25-30 minutes, or until the top is golden brown and the raspberry filling is bubbling.\nRemove from the oven and let it cool slightly before serving. Enjoy the Raspberry Almond Crumble warm with a scoop of ice cream or a dollop of whipped cream.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-almond-crumble.png"
  },
  {
    "title": "Peach Basil Sorbet",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and delightful summer treat combining the sweetness of peaches with the fragrant essence of basil.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "4 hours",
    "ingredients": "4 cups ripe peaches, peeled and diced\n1 cup sugar\n1/2 cup water\n1/4 cup fresh basil leaves, chopped\n1 tablespoon lemon juice",
    "instructions": "In a saucepan, combine sugar and water. Heat over medium heat, stirring until sugar is dissolved to create a simple syrup.\nAdd chopped basil leaves to the simple syrup and let steep for 15-20 minutes. Then, strain the syrup to remove basil leaves.\nIn a blender, combine diced peaches, basil-infused simple syrup, and lemon juice. Blend until smooth.\nPour the mixture into a shallow container and freeze for at least 3-4 hours, stirring every hour to break up any ice crystals.\nOnce the sorbet is firm and scoopable, serve in chilled bowls garnished with fresh basil leaves.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/peach-basil-sorbet.png"
  },
  {
    "title": "Spicy Tofu Skewers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "These flavorful tofu skewers are marinated in a spicy sauce and grilled to perfection, making them a delicious and satisfying dish for any occasion.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "1 block of firm tofu, cubed\n1/4 cup soy sauce\n2 tablespoons sriracha sauce\n1 tablespoon sesame oil\n1 tablespoon rice vinegar\n1 teaspoon grated ginger\n2 cloves garlic, minced\n1 tablespoon maple syrup\n1 bell pepper, cut into chunks\n1 red onion, cut into chunks\nSkewers",
    "instructions": "In a bowl, combine soy sauce, sriracha sauce, sesame oil, rice vinegar, ginger, garlic, and maple syrup to make the marinade.\nAdd cubed tofu to the marinade and let it sit for at least 30 minutes to marinate.\nPreheat the grill or grill pan over medium-high heat.\nThread tofu cubes, bell pepper, and onion onto skewers.\nGrill the skewers for about 10-12 minutes, turning occasionally and basting with the remaining marinade.\nServe the spicy tofu skewers hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spicy-tofu-skewers.png"
  },
  {
    "title": "Chocolate Sea Salt Truffles",
    "tag_names": [
      "Desserts"
    ],
    "description": "Decadent chocolate truffles sprinkled with a touch of sea salt for a perfect balance of sweet and salty flavors.",
    "yield": "Makes about 20 truffles",
    "active_time": "30 minutes",
    "total_time": "2 hours",
    "ingredients": "8 oz dark chocolate, chopped\n1/2 cup heavy cream\n1/4 tsp sea salt, plus extra for sprinkling\n1/4 cup cocoa powder, for coating",
    "instructions": "In a heatproof bowl, combine the chopped chocolate and sea salt.\nIn a saucepan, heat the heavy cream just until it begins to simmer.\nPour the hot cream over the chocolate and let it sit for a minute. Then stir until smooth.\nCover the bowl and refrigerate the mixture until firm, about 1 hour.\nUsing a teaspoon, scoop out portions of the chilled chocolate mixture and roll them into small balls.\nRoll each truffle in cocoa powder to coat and place on a baking sheet.\nSprinkle a pinch of sea salt on top of each truffle.\nChill the truffles in the refrigerator for another hour before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-sea-salt-truffles.png"
  },
  {
    "title": "Pistachio Baklava Bites",
    "tag_names": [
      "Desserts",
      "Appetizers"
    ],
    "description": "These bite-sized baklava treats are filled with pistachios and honey, perfect for a sweet indulgence.",
    "yield": "Makes about 24 pieces",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 cup shelled pistachios, finely chopped\n1/2 cup unsalted butter, melted\n1/2 cup honey\n1/2 teaspoon ground cinnamon\n16 sheets phyllo pastry, thawed\n1/2 cup sugar\n1/2 cup water\n1/4 cup honey",
    "instructions": "Preheat the oven to 350°F (175°C). Grease a 9x13-inch baking dish.\nIn a bowl, mix together the chopped pistachios, melted butter, honey, and ground cinnamon.\nPlace one sheet of phyllo pastry in the bottom of the prepared dish and brush with butter. Repeat with 7 more sheets, brushing each with butter.\nSpread the pistachio mixture evenly over the layered phyllo sheets.\nLayer the remaining phyllo sheets on top of the pistachio mixture, brushing each sheet with butter.\nUsing a sharp knife, cut the baklava into small diamond-shaped pieces.\nBake in the preheated oven for 35-40 minutes, or until golden brown.\nWhile the baklava is baking, combine the sugar, water, and honey in a saucepan over medium heat. Bring to a simmer and cook for 5 minutes.\nPour the hot syrup over the baked baklava as soon as it comes out of the oven.\nAllow the baklava to cool completely before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pistachio-baklava-bites.png"
  },
  {
    "title": "Sun-Dried Tomato Pesto Pasta",
    "tag_names": [
      "Entrees"
    ],
    "description": "A delicious and flavorful pasta dish made with sun-dried tomato pesto.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "8 oz pasta\n1/2 cup sun-dried tomatoes\n2 cloves garlic\n1/4 cup pine nuts\n1/4 cup grated parmesan cheese\n1/3 cup olive oil\nSalt and pepper to taste",
    "instructions": "Cook pasta according to package instructions. Drain and set aside.\nIn a food processor, combine sun-dried tomatoes, garlic, pine nuts, parmesan cheese, and olive oil. Blend until smooth.\nToss the cooked pasta with the sun-dried tomato pesto sauce until well coated.\nSeason with salt and pepper to taste.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sun-dried-tomato-pesto-pasta.png"
  },
  {
    "title": "Tropical Pineapple Salsa",
    "tag_names": [
      "Appetizers",
      "Miscellaneous"
    ],
    "description": "A refreshing and vibrant salsa with a tropical twist, perfect for summer gatherings or as a topping for grilled dishes.",
    "yield": "Makes about 2 cups",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup diced fresh pineapple\n1/2 cup diced red bell pepper\n1/4 cup finely chopped red onion\n1 jalapeno pepper, seeded and finely chopped\n2 tablespoons fresh lime juice\n1 tablespoon chopped fresh cilantro\nSalt and pepper to taste",
    "instructions": "In a medium bowl, combine the diced pineapple, red bell pepper, red onion, jalapeno pepper, lime juice, and cilantro.\nSeason with salt and pepper, and stir well to combine.\nCover and refrigerate for at least 15 minutes to allow the flavors to meld before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/tropical-pineapple-salsa.png"
  },
  {
    "title": "Cardamom Rose Cupcakes",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicate and fragrant cupcakes infused with the flavors of cardamom and rose.",
    "yield": "Makes 12 cupcakes",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 3/4 cups all-purpose flour\n1 1/2 teaspoons ground cardamom\n1/2 teaspoon baking powder\n1/4 teaspoon baking soda\n1/4 teaspoon salt\n1/2 cup unsalted butter, softened\n1 cup granulated sugar\n2 large eggs\n1 teaspoon rose water\n1/2 cup milk\n1/2 cup sour cream",
    "instructions": "Preheat the oven to 350°F (175°C) and line a muffin tin with cupcake liners.\nIn a bowl, whisk together the flour, cardamom, baking powder, baking soda, and salt.\nIn another bowl, cream the butter and sugar together until light and fluffy.\nAdd the eggs one at a time, mixing well after each addition.\nMix in the rose water.\nAlternate adding the dry ingredients and the milk/sour cream, starting and ending with the dry ingredients. Mix until just combined.\nDivide the batter evenly among the cupcake liners.\nBake for 18-20 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the cupcakes to cool in the tin for a few minutes before transferring to a wire rack to cool completely.\nFrost with your favorite frosting or enjoy as is!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cardamom-rose-cupcakes.png"
  },
  {
    "title": "Basil Pesto Caprese Salad",
    "tag_names": [
      "Salads",
      "Appetizers"
    ],
    "description": "A delightful and refreshing salad combining the classic Caprese flavors with the boldness of basil pesto.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "15 minutes",
    "ingredients": "2 cups cherry tomatoes, halved\n1 8oz container fresh mozzarella balls, drained\n1/2 cup fresh basil leaves\n1/4 cup prepared basil pesto\n2 tbsp balsamic glaze\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine halved cherry tomatoes, fresh mozzarella balls, and torn basil leaves.\nDrizzle basil pesto over the salad mixture and gently toss to coat.\nSeason with salt and pepper to taste.\nDrizzle balsamic glaze over the top before serving.\nEnjoy the fresh and vibrant flavors of Basil Pesto Caprese Salad!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/basil-pesto-caprese-salad.png"
  },
  {
    "title": "Tomato Basil Mozzarella Panini",
    "tag_names": [
      "Lunch",
      "Entrees",
      "Breads"
    ],
    "description": "A delicious and classic Italian sandwich featuring ripe tomatoes, fresh basil, and melted mozzarella cheese on crispy grilled bread.",
    "yield": "Serves 2",
    "active_time": "15 minutes",
    "total_time": "25 minutes",
    "ingredients": "4 slices of rustic bread\n2 medium tomatoes, sliced\n6-8 fresh basil leaves\n4 oz fresh mozzarella cheese, sliced\n2 tbsp olive oil\nSalt and pepper to taste",
    "instructions": "Preheat a panini press or grill pan over medium heat.\nBrush one side of each bread slice with olive oil.\nPlace a layer of sliced tomatoes on two bread slices, season with salt and pepper.\nTop with fresh basil leaves and mozzarella slices.\nCover with the remaining bread slices, oiled side up.\nPlace the sandwiches on the panini press or grill pan.\nGrill for about 5-7 minutes until the bread is crispy and the cheese is melted.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/tomato-basil-mozzarella-panini.png"
  },
  {
    "title": "Caramel Apple Cider",
    "tag_names": [
      "Beverages",
      "Desserts"
    ],
    "description": "A warm and comforting drink perfect for fall with the flavors of caramel and apples.",
    "yield": "Serves 4",
    "active_time": "10 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups apple cider\n1/4 cup caramel sauce\n1 cinnamon stick\n1/2 teaspoon ground cinnamon\n1/4 teaspoon ground nutmeg\nWhipped cream (optional)\nCaramel drizzle (optional)",
    "instructions": "In a medium saucepan, combine the apple cider, caramel sauce, cinnamon stick, ground cinnamon, and nutmeg.\nBring the mixture to a simmer over medium heat, stirring occasionally.\nSimmer for about 15-20 minutes to allow the flavors to meld together.\nRemove the cinnamon stick and discard.\nLadle the hot caramel apple cider into mugs.\nTop with whipped cream and a drizzle of caramel, if desired.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caramel-apple-cider.png"
  },
  {
    "title": "Chocolate Zucchini Bread",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delicious and moist bread that combines the goodness of zucchini with the richness of chocolate.",
    "yield": "1 loaf",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "1 1/2 cups all-purpose flour\n1/2 cup unsweetened cocoa powder\n1 teaspoon baking soda\n1/2 teaspoon baking powder\n1/2 teaspoon salt\n1/2 cup vegetable oil\n1/2 cup granulated sugar\n1/2 cup brown sugar\n2 large eggs\n1 teaspoon vanilla extract\n2 cups grated zucchini\n1/2 cup chocolate chips",
    "instructions": "Preheat oven to 350°F (175°C) and grease a 9x5-inch loaf pan.\nIn a large bowl, combine flour, cocoa powder, baking soda, baking powder, and salt.\nIn another bowl, whisk together oil, sugars, eggs, and vanilla until well combined.\nStir the wet ingredients into the dry ingredients until just combined.\nFold in the grated zucchini and chocolate chips.\nPour the batter into the prepared loaf pan and smooth the top.\nBake for 50-60 minutes, or until a toothpick inserted into the center comes out clean.\nCool the bread in the pan for 10 minutes before removing to a wire rack to cool completely.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-zucchini-bread.png"
  },
  {
    "title": "Lemon Dill Tahini Salad",
    "tag_names": [
      "Salads",
      "Lunch",
      "Appetizers"
    ],
    "description": "A refreshing salad with a zesty lemon and dill dressing.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "6 cups mixed salad greens\n1/4 cup tahini\n1/4 cup water\n2 tablespoons fresh lemon juice\n1 tablespoon olive oil\n1 tablespoon fresh dill, chopped\n1 clove garlic, minced\nSalt and pepper to taste\nOptional: cherry tomatoes, cucumber slices, red onion slices",
    "instructions": "In a small bowl, whisk together tahini, water, lemon juice, olive oil, dill, garlic, salt, and pepper to make the dressing.\nIn a large bowl, toss the mixed salad greens with the dressing until well coated.\nTop the salad with cherry tomatoes, cucumber slices, and red onion slices if desired.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-dill-tahini-salad.png"
  },
  {
    "title": "Watermelon Mint Feta Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and flavorful summer salad that combines the sweetness of watermelon with the savory taste of feta cheese and the freshness of mint leaves.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups of cubed watermelon\n1/2 cup of crumbled feta cheese\n1/4 cup of fresh mint leaves, chopped\n1 tablespoon of extra virgin olive oil\n1 tablespoon of balsamic vinegar\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine the cubed watermelon, crumbled feta cheese, and chopped mint leaves.\nDrizzle the olive oil and balsamic vinegar over the salad.\nSeason with salt and pepper to taste.\nGently toss everything together until well combined.\nServe chilled and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/watermelon-mint-feta-salad.png"
  },
  {
    "title": "Butternut Squash Chili",
    "tag_names": [
      "Entrees",
      "Soups"
    ],
    "description": "A hearty and delicious chili recipe made with butternut squash that's perfect for a cozy night in.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "1 butternut squash, peeled and diced\n1 onion, chopped\n3 cloves of garlic, minced\n1 red bell pepper, diced\n1 can of black beans, drained and rinsed\n1 can of diced tomatoes\n2 cups of vegetable broth\n2 tablespoons of chili powder\n1 teaspoon of cumin\nSalt and pepper to taste\nOptional toppings: shredded cheese, sour cream, chopped cilantro",
    "instructions": "In a large pot, heat some oil over medium heat.\nAdd the onion and garlic, and sauté until fragrant.\nAdd the butternut squash, red bell pepper, chili powder, cumin, salt, and pepper. Cook for a few minutes until the vegetables start to soften.\nPour in the diced tomatoes and vegetable broth. Bring the chili to a simmer and let it cook for about 30-40 minutes, stirring occasionally.\nAdd the black beans and cook for an additional 10 minutes.\nTaste and adjust the seasoning as needed.\nServe the butternut squash chili hot with your favorite toppings.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/butternut-squash-chili.png"
  },
  {
    "title": "Strawberry Cheesecake Bites",
    "tag_names": [
      "Desserts",
      "Appetizers"
    ],
    "description": "Delicious bite-sized strawberry cheesecakes that are perfect for any occasion.",
    "yield": "Makes 24 cheesecake bites",
    "active_time": "30 minutes",
    "total_time": "2 hours",
    "ingredients": "1 1/2 cups graham cracker crumbs\n1/4 cup granulated sugar\n1/2 cup unsalted butter, melted\n16 oz cream cheese, softened\n1/2 cup powdered sugar\n1 tsp vanilla extract\n1 cup fresh strawberries, diced\n1/4 cup strawberry jam\nWhipped cream and additional strawberries for garnish",
    "instructions": "Preheat oven to 350°F. Line a 9x9 inch baking dish with parchment paper.\nIn a bowl, mix graham cracker crumbs, granulated sugar, and melted butter until combined. Press the mixture into the bottom of the baking dish to form a crust.\nIn a separate bowl, beat cream cheese, powdered sugar, and vanilla extract until smooth. Fold in diced strawberries.\nSpread the cream cheese mixture over the graham cracker crust in the baking dish.\nWarm the strawberry jam in the microwave and drizzle it over the cream cheese layer. Use a knife to swirl the jam into the cheesecake mixture.\nBake for 25-30 minutes until the edges are set but the center is slightly jiggly.\nAllow the cheesecake to cool completely, then refrigerate for at least 1 hour.\nCut into bite-sized squares and garnish with whipped cream and sliced strawberries before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/strawberry-cheesecake-bites.png"
  },
  {
    "title": "Raspberry Dark Chocolate Tart",
    "tag_names": [
      "Desserts"
    ],
    "description": "Indulge in this decadent Raspberry Dark Chocolate Tart with a buttery crust, rich chocolate filling, and fresh raspberry topping.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "2 hours",
    "ingredients": "For the Crust:\n- 1 1/2 cups all-purpose flour\n- 1/2 cup unsalted butter, chilled and cubed\n- 1/4 cup granulated sugar\n- 1/4 teaspoon salt\nFor the Filling:\n- 8 oz dark chocolate, chopped\n- 1 cup heavy cream\n- 2 tbsp unsalted butter\n- 1 tsp vanilla extract\nFor the Topping:\n- 1 pint fresh raspberries\n- 2 tbsp raspberry jam",
    "instructions": "1. Preheat the oven to 350°F (180°C).\n2. In a food processor, pulse together the flour, butter, sugar, and salt until the mixture resembles coarse crumbs.\n3. Press the crust mixture into a 9-inch tart pan, making sure it's evenly distributed and pressed into the sides.\n4. Bake the crust for 15-18 minutes until lightly golden. Let it cool.\n5. In a heatproof bowl, combine the chopped dark chocolate, butter, and vanilla extract.\n6. In a saucepan, heat the heavy cream until just simmering. Pour the hot cream over the chocolate mixture and let it sit for a minute before stirring until smooth.\n7. Pour the chocolate ganache into the cooled tart shell and refrigerate for about 1 hour until set.\n8. Arrange fresh raspberries on top of the chocolate filling.\n9. In a small saucepan, heat the raspberry jam until it's melted and smooth. Gently brush the raspberries with the melted jam for a glossy finish.\n10. Serve the Raspberry Dark Chocolate Tart chilled and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-dark-chocolate-tart.png"
  },
  {
    "title": "Fresh Fig Prosciutto Crostini",
    "tag_names": [
      "Appetizers",
      "Breads"
    ],
    "description": "A delightful appetizer featuring the sweet flavors of fresh figs and the savory taste of prosciutto on crisp crostini.",
    "yield": "Makes 6-8 servings",
    "active_time": "20 minutes",
    "total_time": "30 minutes",
    "ingredients": "8 slices of baguette, sliced diagonally\n6 fresh figs, sliced\n100g prosciutto, thinly sliced\n1/2 cup goat cheese\n2 tbsp honey\nFresh mint leaves for garnish\nBalsamic glaze for drizzling",
    "instructions": "Preheat the oven to 375°F (190°C).\nPlace the baguette slices on a baking sheet and toast in the oven until lightly golden, about 5-7 minutes.\nSpread a layer of goat cheese on each toasted baguette slice.\nTop with a slice of prosciutto and a few slices of fresh fig.\nDrizzle honey over the figs and garnish with mint leaves.\nJust before serving, drizzle balsamic glaze over the crostini.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/fresh-fig-prosciutto-crostini.png"
  },
  {
    "title": "Green Goddess Lemony Quinoa",
    "tag_names": [
      "Entrees",
      "Salads"
    ],
    "description": "A flavorful and refreshing quinoa salad with a citrusy twist.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup quinoa, rinsed and drained\n2 cups water\n1/4 cup fresh lemon juice\n2 tablespoons olive oil\n1/2 cup finely chopped cucumber\n1/2 cup chopped fresh parsley\n1/4 cup chopped fresh chives\n1/4 cup chopped fresh basil\nSalt and pepper to taste",
    "instructions": "In a medium saucepan, combine quinoa and water. Bring to a boil, then reduce to a simmer. Cover and cook for 15 minutes or until quinoa is cooked and water is absorbed.\nIn a small bowl, whisk together lemon juice and olive oil.\nIn a large mixing bowl, combine cooked quinoa, cucumber, parsley, chives, and basil.\nPour the lemon dressing over the quinoa mixture and toss to combine. Season with salt and pepper to taste.\nServe the Green Goddess Lemony Quinoa salad chilled or at room temperature.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/green-goddess-lemony-quinoa.png"
  },
  {
    "title": "Pineapple Coconut Smoothie",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tropical smoothie made with pineapple and coconut flavors.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "10 minutes",
    "ingredients": "1 cup frozen pineapple chunks\n1/2 cup coconut milk\n1/2 cup Greek yogurt\n1 tablespoon honey\n1/4 teaspoon vanilla extract\n1/4 cup shredded coconut (optional)\nIce cubes (as needed)",
    "instructions": "In a blender, combine the frozen pineapple chunks, coconut milk, Greek yogurt, honey, and vanilla extract.\nBlend until smooth, adding ice cubes as needed to reach desired consistency.\nPour the smoothie into glasses and top with shredded coconut if desired.\nServe cold and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pineapple-coconut-smoothie.png"
  },
  {
    "title": "Moroccan Harissa Meatballs",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "Spicy and flavorful meatballs inspired by Moroccan cuisine, made with harissa paste and aromatic spices.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 lb ground beef or lamb\n1/4 cup breadcrumbs\n1 small onion, finely chopped\n2 cloves of garlic, minced\n2 tbsp harissa paste\n1 tsp ground cumin\n1 tsp paprika\n1/2 tsp ground coriander\nSalt and pepper to taste\n2 tbsp olive oil\nChopped fresh parsley for garnish",
    "instructions": "In a mixing bowl, combine the ground meat, breadcrumbs, chopped onion, minced garlic, harissa paste, ground cumin, paprika, ground coriander, salt, and pepper. Mix well until all ingredients are evenly incorporated.\nShape the mixture into meatballs, about 1-inch in size.\nHeat olive oil in a large skillet over medium heat. Add the meatballs and cook until browned on all sides, about 8-10 minutes.\nPour in a cup of water or broth, cover the skillet, and simmer for another 15-20 minutes until the meatballs are cooked through and tender.\nGarnish with chopped parsley before serving.\nServe the Moroccan Harissa meatballs hot with couscous, rice, or pita bread.\nEnjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/moroccan-harissa-meatballs.png"
  },
  {
    "title": "Chocolate Avocado Pudding",
    "tag_names": [
      "Desserts"
    ],
    "description": "A creamy and rich dessert made with ripe avocados and chocolate.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "2 ripe avocados\n1/3 cup cocoa powder\n1/4 cup honey or maple syrup\n1/2 tsp vanilla extract\n1/4 cup almond milk\nPinch of salt\nOptional toppings: shaved chocolate, berries, chopped nuts",
    "instructions": "Cut the avocados in half, remove the pit, and scoop out the flesh into a food processor or blender.\nAdd cocoa powder, honey or maple syrup, vanilla extract, almond milk, and a pinch of salt to the avocados.\nBlend until smooth and creamy, scraping down the sides as needed.\nTaste and adjust sweetness if necessary.\nDivide the pudding into serving dishes and refrigerate for at least 30 minutes before serving.\nGarnish with shaved chocolate, berries, or chopped nuts before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-avocado-pudding.png"
  },
  {
    "title": "Apple Cinnamon Overnight Oats",
    "tag_names": [
      "Breakfast"
    ],
    "description": "A delicious and healthy breakfast option that can be prepared the night before.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "Overnight (at least 4 hours)",
    "ingredients": "1 cup rolled oats\n1 cup milk (any kind)\n1/2 cup Greek yogurt\n1 tablespoon honey or maple syrup\n1/2 teaspoon cinnamon\n1/2 teaspoon vanilla extract\n1 apple, diced\n2 tablespoons chopped nuts or seeds (optional for topping)",
    "instructions": "In a bowl or jar, combine rolled oats, milk, Greek yogurt, honey or maple syrup, cinnamon, and vanilla extract. Mix well.\nAdd diced apple and stir to combine.\nCover and refrigerate overnight or for at least 4 hours.\nBefore serving, stir the oats and add a little more milk if desired for consistency.\nTop with chopped nuts or seeds before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/apple-cinnamon-overnight-oats.png"
  },
  {
    "title": "Lentil Quinoa Stuffed Peppers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "Healthy and flavorful stuffed peppers filled with lentils, quinoa, and vegetables.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 large bell peppers, halved and seeds removed\n1 cup cooked quinoa\n1 cup cooked lentils\n1 small onion, diced\n2 cloves garlic, minced\n1 teaspoon cumin\n1 teaspoon paprika\nSalt and pepper to taste\n1/2 cup shredded cheese (optional)\nFresh parsley for garnish",
    "instructions": "Preheat the oven to 375°F (190°C).\nIn a large skillet, sauté the onion and garlic until softened.\nAdd the cooked quinoa, lentils, cumin, paprika, salt, and pepper. Cook for another 5 minutes.\nStuff the halved bell peppers with the quinoa-lentil mixture and place them in a baking dish.\nIf using cheese, sprinkle it on top of the stuffed peppers.\nCover the baking dish with foil and bake for 30 minutes.\nRemove the foil and bake for an additional 10 minutes until the peppers are tender.\nGarnish with fresh parsley before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lentil-quinoa-stuffed-peppers.png"
  },
  {
    "title": "Blueberry Ginger Lemonade",
    "tag_names": [
      "Beverages"
    ],
    "description": "Refreshing and tangy lemonade with a twist of blueberries and ginger.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup fresh blueberries\n1/4 cup fresh ginger, thinly sliced\n1 cup freshly squeezed lemon juice\n1/2 cup honey or preferred sweetener\n4 cups cold water\nIce cubes\nFresh blueberries and lemon slices for garnish",
    "instructions": "In a small saucepan, combine the blueberries, ginger, and 1 cup of water. Bring to a simmer over medium heat and cook for 5-7 minutes, mashing the blueberries with a spoon.\nStrain the blueberry-ginger mixture through a fine mesh sieve, pressing on the solids to extract all the liquid.\nIn a large pitcher, mix the fresh lemon juice, honey, strained blueberry-ginger mixture, and cold water. Stir well until the honey is completely dissolved.\nRefrigerate the lemonade until ready to serve.\nTo serve, fill glasses with ice cubes and pour the blueberry ginger lemonade over the ice. Garnish with fresh blueberries and lemon slices. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-ginger-lemonade.png"
  },
  {
    "title": "Peach Basil Caprese Salad",
    "tag_names": [
      "Salads",
      "Appetizers"
    ],
    "description": "A delightful and refreshing salad that combines the sweetness of peaches with the tanginess of balsamic glaze and the freshness of basil.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 ripe peaches, sliced\n1 cup cherry tomatoes, halved\n8 oz fresh mozzarella, sliced\n1/4 cup fresh basil leaves\n2 tbsp balsamic glaze\nSalt and pepper to taste",
    "instructions": "Arrange the peach slices, cherry tomatoes, and mozzarella slices on a serving platter.\nTear the basil leaves and scatter them over the salad.\nDrizzle the balsamic glaze over the salad.\nSeason with salt and pepper to taste.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/peach-basil-caprese-salad.png"
  },
  {
    "title": "Pumpkin Spice Bread Pudding",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "This Pumpkin Spice Bread Pudding is a delightful fall dessert that combines the warm flavors of pumpkin and spices in a comforting bread pudding.",
    "yield": "Serves 8",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "6 cups cubed bread (such as day-old baguette or French bread)\n1 can (15 oz) pumpkin puree\n4 eggs\n1 cup heavy cream\n1 cup milk\n1 cup brown sugar\n2 tsp vanilla extract\n1 tsp ground cinnamon\n1/2 tsp ground nutmeg\n1/2 tsp ground ginger\n1/4 tsp ground cloves\n1/4 tsp salt\n1/2 cup raisins or dried cranberries (optional)",
    "instructions": "Preheat the oven to 350°F (175°C). Grease a 9x13-inch baking dish.\nIn a large bowl, whisk together the pumpkin puree, eggs, heavy cream, milk, brown sugar, vanilla extract, cinnamon, nutmeg, ginger, cloves, and salt until well combined.\nAdd the cubed bread and raisins or dried cranberries to the bowl, tossing to coat the bread evenly with the pumpkin mixture.\nLet the mixture sit for about 15 minutes to allow the bread to soak up the liquid.\nPour the bread pudding mixture into the prepared baking dish, spreading it out evenly.\nBake in the preheated oven for 45-50 minutes, or until the bread pudding is set and golden brown on top.\nRemove from the oven and let it cool slightly before serving. Enjoy warm or at room temperature.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pumpkin-spice-bread-pudding.png"
  },
  {
    "title": "Raspberry Rosewater Sorbet",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and fragrant sorbet with the delicate flavors of raspberry and rosewater.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "4 hours",
    "ingredients": "4 cups fresh raspberries\n1 cup sugar\n1/3 cup water\n2 tablespoons rosewater\n1 tablespoon lemon juice",
    "instructions": "In a small saucepan, combine the sugar and water. Heat over medium heat, stirring occasionally, until the sugar is completely dissolved. Remove from heat and let it cool.\nBlend the fresh raspberries in a food processor or blender until smooth. Strain through a fine mesh sieve to remove seeds.\nMix the raspberry puree, cooled sugar syrup, rosewater, and lemon juice in a bowl until well combined.\nPour the mixture into an ice cream maker and churn according to the manufacturer's instructions until it reaches a sorbet consistency.\nTransfer the sorbet to a freezer-safe container and freeze for at least 3 hours before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-rosewater-sorbet.png"
  },
  {
    "title": "Lemon Turmeric Ginger Elixir",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and immune-boosting elixir with the goodness of lemon, turmeric, and ginger.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 cup water\n1 tbsp grated fresh ginger\n1 tsp ground turmeric\n1/2 lemon, juiced\n1-2 tbsp honey or maple syrup (optional)",
    "instructions": "In a small saucepan, bring water to a gentle simmer.\nAdd grated ginger and ground turmeric, simmer for 5 minutes.\nRemove from heat, stir in lemon juice and sweetener.\nStrain the mixture and pour into mugs.\nEnjoy warm as a soothing elixir.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-turmeric-ginger-elixir.png"
  },
  {
    "title": "Corn Jalapeno Fritters",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious fritters with sweet corn and spicy jalapeno flavors.",
    "yield": "Makes about 12 fritters",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "1 cup of fresh or canned corn kernels\n1-2 jalapeno peppers, finely chopped\n1/2 cup of all-purpose flour\n1/2 cup of cornmeal\n1 teaspoon of baking powder\n1/2 teaspoon of salt\n1/4 teaspoon of black pepper\n2 eggs\n1/4 cup of milk\n2 tablespoons of chopped fresh cilantro\nOil for frying",
    "instructions": "In a mixing bowl, combine the corn, jalapeno peppers, flour, cornmeal, baking powder, salt, and black pepper.\nIn another bowl, whisk together the eggs and milk.\nAdd the egg mixture to the dry ingredients and stir until well combined.\nStir in the chopped cilantro.\nHeat oil in a pan over medium heat.\nDrop spoonfuls of the batter into the hot oil and fry until golden brown, about 2-3 minutes per side.\nRemove fritters from the oil and place them on a paper towel to drain excess oil.\nServe hot with your favorite dipping sauce or salsa.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/corn-jalapeno-fritters.png"
  },
  {
    "title": "Walnut Pesto Zucchini Noodles",
    "tag_names": [
      "Entrees",
      "Salads"
    ],
    "description": "Delicious zucchini noodles topped with a flavorful walnut pesto sauce.",
    "yield": "Serves 2",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 medium zucchinis, spiralized\n1/2 cup walnuts, toasted\n2 cloves garlic\n1 cup fresh basil leaves\n1/4 cup grated Parmesan cheese\n1/4 cup olive oil\nSalt and pepper to taste",
    "instructions": "In a food processor, combine toasted walnuts, garlic, basil, and Parmesan cheese. Pulse until finely chopped.\nWhile processing, slowly drizzle in the olive oil until well combined and smooth. Season with salt and pepper.\nIn a large pan, sauté zucchini noodles over medium heat for 2-3 minutes until just tender.\nToss the zucchini noodles with the walnut pesto sauce until evenly coated.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/walnut-pesto-zucchini-noodles.png"
  },
  {
    "title": "Mango Coconut Chia Pudding",
    "tag_names": [
      "Desserts",
      "Breakfast"
    ],
    "description": "A delicious and healthy pudding made with fresh mangoes, coconut milk, and chia seeds.",
    "yield": "Serves 2",
    "active_time": "15 minutes",
    "total_time": "4 hours",
    "ingredients": "1 ripe mango, peeled and diced\n1/2 cup coconut milk\n2 tbsp chia seeds\n1 tbsp honey or maple syrup (optional)\nCoconut flakes for garnish",
    "instructions": "In a blender, blend the diced mango until smooth.\nIn a bowl, mix the mango puree with coconut milk and chia seeds. If desired, add honey or maple syrup for sweetness.\nCover the bowl and refrigerate for at least 4 hours or overnight to allow the chia seeds to thicken the mixture.\nBefore serving, give the pudding a good stir, and top with coconut flakes for garnish. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-coconut-chia-pudding.png"
  },
  {
    "title": "Pecan Pumpkin Spice Muffins",
    "tag_names": [
      "Breads",
      "Desserts"
    ],
    "description": "Delicious and moist muffins with a perfect blend of pumpkin and warm spices, topped with crunchy pecans.",
    "yield": "12 muffins",
    "active_time": "15 minutes",
    "total_time": "40 minutes",
    "ingredients": "1 3/4 cups all-purpose flour\n1 tsp baking powder\n1/2 tsp baking soda\n1/2 tsp salt\n1 tsp ground cinnamon\n1/2 tsp ground ginger\n1/4 tsp ground nutmeg\n1/4 tsp ground cloves\n1/2 cup unsalted butter, melted\n1/2 cup granulated sugar\n1/2 cup packed light brown sugar\n2 large eggs\n1 cup canned pumpkin puree\n1/3 cup milk\n1 tsp vanilla extract\n1/2 cup chopped pecans, for topping",
    "instructions": "Preheat the oven to 375°F (190°C) and line a 12-cup muffin tin with paper liners.\nIn a medium bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, ginger, nutmeg, and cloves.\nIn a large bowl, mix together the melted butter, granulated sugar, and brown sugar.\nAdd the eggs, one at a time, beating well after each addition.\nStir in the pumpkin puree, milk, and vanilla extract until smooth.\nSlowly add the dry ingredients to the wet ingredients, stirring until just combined. Do not overmix.\nDivide the batter evenly among the prepared muffin cups and sprinkle the chopped pecans on top.\nBake in the preheated oven for about 18-20 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the muffins to cool in the tin for 5 minutes before transferring them to a wire rack to cool completely.\nEnjoy these delicious Pecan Pumpkin Spice Muffins as a perfect fall treat!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pecan-pumpkin-spice-muffins.png"
  },
  {
    "title": "Teriyaki Tofu Lettuce Wraps",
    "tag_names": [
      "Lunch",
      "Entrees",
      "Appetizers"
    ],
    "description": "Delicious and healthy lettuce wraps filled with teriyaki-flavored tofu and veggies.",
    "yield": "Makes 4 servings",
    "active_time": "25 minutes",
    "total_time": "40 minutes",
    "ingredients": "1 block of firm tofu, pressed and cubed\n1/2 cup teriyaki sauce\n1 tablespoon sesame oil\n1 red bell pepper, sliced\n1 carrot, julienned\n4-6 lettuce leaves, such as butter or romaine\nSesame seeds and green onions for garnish",
    "instructions": "In a bowl, marinate the tofu cubes in teriyaki sauce for 15 minutes.\nIn a skillet, heat sesame oil over medium heat. Add the marinated tofu and cook until golden brown.\nAdd sliced bell pepper and julienned carrot to the skillet, and cook until slightly softened.\nSpoon the tofu and veggie mixture into lettuce leaves.\nGarnish with sesame seeds and chopped green onions.\nRoll up the lettuce leaves to form wraps and serve.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/teriyaki-tofu-lettuce-wraps.png"
  },
  {
    "title": "Avocado Tomato Basil Bruschetta",
    "tag_names": [
      "Appetizers",
      "Breads",
      "Salads"
    ],
    "description": "A delicious and refreshing appetizer perfect for any occasion.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 ripe avocado, diced\n1 cup cherry tomatoes, quartered\n1/4 cup fresh basil leaves, chopped\n2 tablespoons extra virgin olive oil\n1 tablespoon balsamic vinegar\nSalt and pepper to taste\n1 French baguette, sliced and toasted",
    "instructions": "In a large mixing bowl, combine the diced avocado, quartered cherry tomatoes, and chopped basil leaves.\nDrizzle the extra virgin olive oil and balsamic vinegar over the mixture.\nSeason with salt and pepper, then gently toss to combine.\nSpoon the avocado-tomato mixture onto the toasted baguette slices.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/avocado-tomato-basil-bruschetta.png"
  },
  {
    "title": "Caramelized Pear Brie Crostini",
    "tag_names": [
      "Appetizers"
    ],
    "description": "A delightful appetizer that combines the sweetness of caramelized pears with creamy brie cheese on toasted baguette slices.",
    "yield": "Makes 12 crostini",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 baguette, sliced into 1/2 inch thick rounds\n2 ripe pears, thinly sliced\n4 oz brie cheese, sliced\n2 tbsp butter\n2 tbsp brown sugar\n1/4 cup honey\nFresh thyme leaves for garnish\nSalt and pepper to taste",
    "instructions": "1. Preheat the oven to 375°F (190°C).\n2. In a skillet, melt butter over medium heat. Add sliced pears and brown sugar. Cook, stirring occasionally, until pears are caramelized, about 8-10 minutes.\n3. Place baguette slices on a baking sheet and toast in the oven until lightly golden, about 5-7 minutes.\n4. Top each toasted baguette slice with a slice of brie, followed by a spoonful of caramelized pears.\n5. Drizzle honey over the crostini and season with salt and pepper.\n6. Return the crostini to the oven and bake for another 5-7 minutes, or until the brie is melted.\n7. Garnish with fresh thyme leaves before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caramelized-pear-brie-crostini.png"
  },
  {
    "title": "Chocolate Pistachio Energy Bites",
    "tag_names": [
      "Desserts"
    ],
    "description": "These chocolate pistachio energy bites are a delicious and healthy snack to keep you energized throughout the day.",
    "yield": "Makes 12 energy bites",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup pitted dates\n1/2 cup shelled pistachios\n1/4 cup unsweetened cocoa powder\n2 tablespoons honey\n1/4 teaspoon sea salt\n1/4 cup shredded coconut (optional, for coating)",
    "instructions": "In a food processor, blend dates, pistachios, cocoa powder, honey, and sea salt until the mixture forms a sticky dough.\nRoll the mixture into small balls, about 1 inch in diameter.\nOptional: Roll the energy bites in shredded coconut to coat.\nPlace the energy bites in an airtight container and refrigerate for at least 15 minutes before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-pistachio-energy-bites.png"
  },
  {
    "title": "Watermelon Feta Mint Skewers",
    "tag_names": [
      "Appetizers",
      "Salads"
    ],
    "description": "Refreshing and colorful skewers featuring the combination of watermelon, feta cheese, and mint leaves. Perfect for summer gatherings and parties.",
    "yield": "Makes 10 skewers",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "2 cups of cubed watermelon\n1 cup of crumbled feta cheese\nFresh mint leaves\n10 wooden skewers",
    "instructions": "Thread a cube of watermelon, followed by a mint leaf, and then a piece of feta cheese onto each skewer. Repeat for all skewers.\nArrange the prepared skewers on a serving platter and refrigerate until ready to serve.\nEnjoy the refreshing Watermelon Feta Mint Skewers!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/watermelon-feta-mint-skewers.png"
  },
  {
    "title": "Pomegranate Ginger Lemonade",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tangy drink perfect for hot summer days.",
    "yield": "Serves 4",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 cup of pomegranate juice\n1/4 cup of freshly squeezed lemon juice\n2 tbsp of grated ginger\n4 cups of water\n1/4 cup of honey or sugar\nIce cubes\nFresh mint leaves for garnish",
    "instructions": "In a pitcher, combine pomegranate juice, lemon juice, grated ginger, water, and honey/sugar. Stir well until the honey/sugar is dissolved.\nFill glasses with ice cubes.\nPour the pomegranate ginger lemonade over the ice.\nGarnish with fresh mint leaves.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pomegranate-ginger-lemonade.png"
  },
  {
    "title": "Moroccan Couscous Stuffed Peppers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "Delicious Moroccan-inspired dish featuring couscous stuffed peppers with a blend of flavorful spices.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 large bell peppers, any color\n1 cup couscous\n1 can chickpeas, drained and rinsed\n1/2 cup raisins\n1/4 cup chopped fresh parsley\n1/4 cup chopped almonds\n2 tablespoons olive oil\n1 teaspoon ground cumin\n1 teaspoon ground coriander\n1/2 teaspoon cinnamon\nSalt and pepper to taste\nLemon wedges for serving",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the tops off the bell peppers and remove the seeds and membranes.\nIn a large bowl, combine couscous, chickpeas, raisins, parsley, almonds, olive oil, cumin, coriander, cinnamon, salt, and pepper. Mix well.\nStuff each bell pepper with the couscous mixture and place in a baking dish.\nCover the dish with foil and bake for 30 minutes.\nRemove foil and bake for an additional 10-15 minutes, until the peppers are tender.\nServe the stuffed peppers hot with lemon wedges on the side.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/moroccan-couscous-stuffed-peppers.png"
  },
  {
    "title": "Blueberry Lemon Thyme Scones",
    "tag_names": [
      "Breads",
      "Desserts",
      "Breakfast"
    ],
    "description": "Delicious scones bursting with the flavors of blueberries, lemon, and thyme.",
    "yield": "12 scones",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "2 cups all-purpose flour\n1/3 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/2 cup unsalted butter, cold and cubed\n1/2 cup buttermilk\n1 large egg\n1 teaspoon vanilla extract\n1 cup fresh blueberries\nZest of 1 lemon\n1 tablespoon fresh thyme leaves",
    "instructions": "Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.\nIn a large bowl, whisk together flour, sugar, baking powder, and salt.\nAdd the cold cubed butter to the flour mixture and using a pastry cutter or your fingers, cut the butter into the flour until the mixture resembles coarse crumbs.\nIn a separate bowl, whisk together buttermilk, egg, and vanilla extract.\nPour the buttermilk mixture into the flour mixture and stir until just combined.\nGently fold in the blueberries, lemon zest, and fresh thyme leaves.\nTransfer the dough onto a floured surface and shape it into a circle about 1-inch thick.\nCut the circle into 12 wedges and place them on the prepared baking sheet.\nBake for 15-18 minutes, or until the scones are golden brown.\nAllow the scones to cool slightly before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-lemon-thyme-scones.png"
  },
  {
    "title": "Sweet Potato Black Bean Tacos",
    "tag_names": [
      "Entrees",
      "Lunch",
      "Appetizers"
    ],
    "description": "Flavorful and satisfying vegetarian tacos with sweet potatoes and black beans.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "2 medium sweet potatoes, peeled and diced\n1 can (15 oz) black beans, drained and rinsed\n1 tablespoon olive oil\n1 teaspoon chili powder\n1 teaspoon cumin\n1/2 teaspoon paprika\nSalt and pepper to taste\n8 small corn or flour tortillas\nOptional toppings: avocado slices, salsa, shredded cheese, lime wedges",
    "instructions": "Preheat the oven to 400°F (200°C).\nIn a bowl, toss the diced sweet potatoes with olive oil, chili powder, cumin, paprika, salt, and pepper until well coated.\nSpread the seasoned sweet potatoes on a baking sheet and roast in the oven for about 25-30 minutes or until tender and slightly crispy.\nIn a skillet, heat the black beans over medium heat until warmed through.\nWarm the tortillas in a pan or microwave according to package instructions.\nTo assemble the tacos, fill each tortilla with a spoonful of black beans and roasted sweet potatoes.\nTop with optional toppings like avocado slices, salsa, cheese, and a squeeze of lime juice.\nServe the sweet potato black bean tacos warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sweet-potato-black-bean-tacos.png"
  },
  {
    "title": "Strawberry Rhubarb Crisp",
    "tag_names": [
      "Desserts"
    ],
    "description": "A delicious fruit crisp combining the tartness of rhubarb and sweetness of strawberries, topped with a crunchy oat crumble.",
    "yield": "Serves 6-8",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "4 cups chopped rhubarb\n3 cups sliced strawberries\n1 cup granulated sugar\n1/4 cup cornstarch\n1 teaspoon vanilla extract\n1 cup old-fashioned oats\n1/2 cup all-purpose flour\n1/2 cup brown sugar\n1/2 teaspoon cinnamon\n1/4 teaspoon salt\n1/2 cup unsalted butter, cold and cubed",
    "instructions": "Preheat the oven to 350°F (175°C).\nIn a large bowl, combine the chopped rhubarb, sliced strawberries, granulated sugar, cornstarch, and vanilla extract. Mix well.\nIn a separate bowl, prepare the oat crumble topping by combining oats, flour, brown sugar, cinnamon, and salt. Cut in the cold butter using a pastry cutter or your hands until the mixture resembles coarse crumbs.\nPour the fruit mixture into a baking dish and spread the oat crumble topping evenly over the fruit.\nBake in the preheated oven for 40-45 minutes, or until the fruit is bubbling and the topping is golden brown.\nAllow the crisp to cool slightly before serving. Enjoy warm with a scoop of vanilla ice cream if desired.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/strawberry-rhubarb-crisp.png"
  },
  {
    "title": "Pistachio Rosewater Cupcakes",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicate and floral cupcakes infused with the flavors of pistachio and rosewater.",
    "yield": "Makes 12 cupcakes",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 1/2 cups all-purpose flour\n1 1/2 tsp baking powder\n1/2 tsp salt\n1/2 cup unsalted butter, softened\n1 cup granulated sugar\n2 large eggs\n1/2 cup milk\n1 tsp rosewater\n1/2 cup chopped pistachios\nPink food coloring (optional)\nFor the frosting:\n1/2 cup unsalted butter, softened\n2 cups powdered sugar\n1-2 tbsp milk\n1/2 tsp rosewater\nChopped pistachios for garnish",
    "instructions": "Preheat the oven to 350°F (180°C). Line a muffin tin with cupcake liners.\nIn a medium bowl, whisk together the flour, baking powder, and salt.\nIn a separate large bowl, cream the butter and sugar together until light and fluffy.\nBeat in the eggs one at a time, then stir in the rosewater.\nGradually add the dry ingredients to the wet ingredients, alternating with the milk, until just combined. Fold in the chopped pistachios.\nIf desired, add a few drops of pink food coloring to achieve a light rose hue in the batter.\nDivide the batter evenly among the cupcake liners, filling each about 2/3 full.\nBake for 18-20 minutes or until a toothpick inserted into the center comes out clean.\nAllow the cupcakes to cool in the tin for 5 minutes, then transfer to a wire rack to cool completely.\nFor the frosting, beat the softened butter until smooth. Gradually add the powdered sugar, milk, and rosewater, mixing until smooth and creamy.\nFrost the cooled cupcakes and top with chopped pistachios as a garnish.\nServe and enjoy these delightful Pistachio Rosewater Cupcakes!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pistachio-rosewater-cupcakes.png"
  },
  {
    "title": "Lemon Basil Orzo Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and flavorful salad featuring orzo pasta, lemon, and basil.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup orzo pasta\n1/4 cup fresh basil leaves, chopped\nZest of 1 lemon\nJuice of 1 lemon\n2 tablespoons olive oil\nSalt and pepper to taste\n1/4 cup feta cheese, crumbled (optional)\n1/4 cup pine nuts, toasted (optional)",
    "instructions": "Cook orzo pasta according to package instructions. Drain and let it cool.\nIn a bowl, mix the cooked orzo with chopped basil, lemon zest, lemon juice, and olive oil.\nSeason with salt and pepper, and toss to combine.\nIf desired, mix in crumbled feta cheese and toasted pine nuts.\nServe chilled or at room temperature. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-basil-orzo-salad.png"
  },
  {
    "title": "Caprese Stuffed Portobellos",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "A delicious and healthy twist on the classic Caprese salad, these stuffed portobellos are filled with fresh mozzarella, cherry tomatoes, basil, and balsamic glaze.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "40 minutes",
    "ingredients": "4 large portobello mushrooms\n1 cup cherry tomatoes, halved\n8 oz fresh mozzarella, diced\n1/4 cup fresh basil leaves, chopped\n2 tbsp balsamic glaze\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 375°F (190°C).\nRemove the stems from the portobello mushrooms and gently scrape out the gills using a spoon.\nIn a bowl, combine the cherry tomatoes, fresh mozzarella, basil, salt, and pepper.\nStuff each portobello mushroom with the tomato and mozzarella mixture.\nPlace the stuffed mushrooms on a baking sheet and bake for about 25-30 minutes, or until the mushrooms are tender and the cheese is melted.\nDrizzle each stuffed mushroom with balsamic glaze before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caprese-stuffed-portobellos.png"
  },
  {
    "title": "Roasted Cauliflower Fennel Soup",
    "tag_names": [
      "Soups"
    ],
    "description": "A flavorful and creamy soup made with roasted cauliflower and fennel.",
    "yield": "Serves 6",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 head of cauliflower, cut into florets\n1 bulb of fennel, thinly sliced\n1 onion, diced\n2 cloves of garlic, minced\n4 cups vegetable broth\n1 cup heavy cream\n2 tablespoons olive oil\nSalt and pepper to taste\nFresh herbs for garnish (optional)",
    "instructions": "Preheat the oven to 400°F (200°C).\nToss the cauliflower florets, sliced fennel, and diced onion with olive oil, salt, and pepper on a baking sheet.\nRoast in the oven for 30-40 minutes until the vegetables are caramelized.\nIn a large pot, sauté the minced garlic until fragrant.\nAdd the roasted vegetables and vegetable broth to the pot. Bring to a simmer and cook for about 15 minutes.\nUse an immersion blender to puree the soup until smooth.\nStir in the heavy cream and adjust seasoning with salt and pepper.\nServe the soup hot, garnished with fresh herbs if desired.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/roasted-cauliflower-fennel-soup.png"
  },
  {
    "title": "Coconut Lime Kiwi Smoothie",
    "tag_names": [
      "Beverages"
    ],
    "description": "A refreshing and tropical smoothie bursting with coconut, lime, and kiwi flavors.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "10 minutes",
    "ingredients": "1/2 cup coconut milk\n1 ripe kiwi, peeled and sliced\n1/2 lime, juiced\n1 tablespoon honey or agave nectar\n1/2 cup frozen pineapple chunks\n1/2 ripe banana, sliced\n1/2 cup ice cubes",
    "instructions": "In a blender, combine the coconut milk, kiwi slices, lime juice, honey, frozen pineapple, banana, and ice cubes.\nBlend until smooth and creamy.\nPour the smoothie into glasses and garnish with a slice of kiwi or lime, if desired.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/coconut-lime-kiwi-smoothie.png"
  },
  {
    "title": "Spicy Harissa Carrot Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A flavorful and zesty salad with a kick of harissa spice.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 pound carrots, peeled and shredded\n2 tablespoons olive oil\n1 tablespoon harissa paste\n1 tablespoon honey\nJuice of 1 lemon\nSalt and pepper to taste\n2 tablespoons chopped fresh parsley\n1/4 cup sliced almonds, toasted",
    "instructions": "In a large bowl, whisk together olive oil, harissa paste, honey, lemon juice, salt, and pepper.\nAdd the shredded carrots, parsley, and toasted almonds to the bowl. Toss until the carrots are well coated with the dressing.\nLet the salad sit for a few minutes to allow the flavors to meld together before serving.\nGarnish with additional parsley and almonds if desired. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spicy-harissa-carrot-salad.png"
  },
  {
    "title": "Blackberry Vanilla Bean Scones",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious scones flavored with blackberries and vanilla bean.",
    "yield": "Makes 8 scones",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "2 cups all-purpose flour\n1/3 cup granulated sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/2 cup cold unsalted butter, diced\n1/2 cup heavy cream\n1 large egg\n1 vanilla bean, seeds scraped out\n1 cup fresh blackberries",
    "instructions": "Preheat the oven to 400°F (200°C). Line a baking sheet with parchment paper.\nIn a large bowl, mix together the flour, sugar, baking powder, and salt.\nAdd the cold diced butter and cut it into the dry ingredients using a pastry cutter or your fingers until the mixture resembles coarse crumbs.\nIn a separate bowl, whisk together the heavy cream, egg, and vanilla bean seeds.\nPour the wet ingredients over the dry mixture and stir until just combined. Gently fold in the blackberries.\nTransfer the dough to a lightly floured surface and shape it into an 8-inch circle. Cut the circle into 8 wedges.\nPlace the scones on the prepared baking sheet and bake for 18-20 minutes, or until golden brown.\nAllow the scones to cool slightly before serving. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blackberry-vanilla-bean-scones.png"
  },
  {
    "title": "Pumpkin Walnut Chocolate Chip Bread",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A delicious and moist bread recipe that combines the flavors of pumpkin, walnuts, and chocolate chips.",
    "yield": "1 loaf",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "1 and 3/4 cups all-purpose flour\n1 teaspoon baking soda\n1/2 teaspoon baking powder\n1/2 teaspoon salt\n1 teaspoon ground cinnamon\n1/2 teaspoon ground nutmeg\n1/4 teaspoon ground cloves\n3/4 cup granulated sugar\n1/4 cup brown sugar\n2 large eggs\n1 cup canned pumpkin puree\n1/2 cup vegetable oil\n1/4 cup milk\n1/2 cup chopped walnuts\n1/2 cup chocolate chips",
    "instructions": "Preheat the oven to 350°F (175°C). Grease and flour a 9x5-inch loaf pan.\nIn a medium bowl, whisk together the flour, baking soda, baking powder, salt, cinnamon, nutmeg, and cloves.\nIn a separate large bowl, whisk together the granulated sugar, brown sugar, eggs, pumpkin puree, vegetable oil, and milk until well combined.\nGradually add the dry ingredients to the wet ingredients, stirring until just combined.\nFold in the chopped walnuts and chocolate chips.\nPour the batter into the prepared loaf pan and smooth the top.\nBake for 50-60 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the bread to cool in the pan for 10 minutes, then transfer to a wire rack to cool completely before slicing and serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pumpkin-walnut-chocolate-chip-bread.png"
  },
  {
    "title": "Mango Avocado Black Bean Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and colorful salad filled with the tropical flavors of mango and avocado, combined with the protein-rich black beans.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 ripe mango, diced\n1 ripe avocado, diced\n1 can (15 oz) black beans, drained and rinsed\n1/4 cup red onion, finely chopped\n1/4 cup fresh cilantro leaves, chopped\n1 jalapeno, seeded and minced\n2 tablespoons lime juice\n2 tablespoons olive oil\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine diced mango, avocado, black beans, red onion, cilantro, and jalapeno.\nIn a small bowl, whisk together lime juice, olive oil, salt, and pepper.\nPour the dressing over the salad ingredients and gently toss to combine.\nServe the salad chilled or at room temperature. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-avocado-black-bean-salad.png"
  },
  {
    "title": "Spinach Artichoke Stuffed Mushrooms",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious and creamy spinach artichoke filling stuffed in button mushrooms.",
    "yield": "Makes 20 stuffed mushrooms",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "20 medium-sized button mushrooms\n1 cup fresh spinach, chopped\n1/2 cup artichoke hearts, chopped\n1/2 cup cream cheese\n1/4 cup grated Parmesan cheese\n2 cloves garlic, minced\nSalt and pepper to taste\n2 tablespoons olive oil",
    "instructions": "Preheat the oven to 375°F (190°C).\nRemove stems from the mushrooms and set aside. Place the mushroom caps on a baking sheet.\nIn a skillet, heat olive oil over medium heat. Add garlic and cook until fragrant.\nAdd chopped mushroom stems, spinach, and artichoke hearts to the skillet. Cook until the vegetables are tender.\nStir in cream cheese and Parmesan cheese until melted and well combined. Season with salt and pepper.\nSpoon the spinach artichoke mixture into the mushroom caps, filling each generously.\nBake in the preheated oven for about 20-25 minutes until the mushrooms are cooked through and the filling is golden brown.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spinach-artichoke-stuffed-mushrooms.png"
  },
  {
    "title": "Raspberry White Chocolate Almond Cake",
    "tag_names": [
      "Desserts"
    ],
    "description": "A delightful and decadent combination of raspberries, white chocolate, and almonds in a moist and flavorful cake.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 and 1/2 cups all-purpose flour\n1 and 1/2 tsp baking powder\n1/4 tsp salt\n1/2 cup unsalted butter, softened\n3/4 cup granulated sugar\n2 large eggs\n1 tsp almond extract\n1/2 cup milk\n1/2 cup sliced almonds\n1/2 cup white chocolate chips\n1 cup fresh raspberries",
    "instructions": "Preheat the oven to 350°F (175°C). Grease and flour a 9-inch round cake pan.\nIn a medium bowl, whisk together the flour, baking powder, and salt.\nIn a separate large bowl, cream the butter and sugar until light and fluffy.\nBeat in the eggs, one at a time, then stir in the almond extract.\nGradually mix in the flour mixture, alternating with the milk, until just combined.\nFold in the sliced almonds, white chocolate chips, and raspberries.\nPour the batter into the prepared pan and smooth the top.\nBake in the preheated oven for 35-40 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the cake to cool in the pan for 10 minutes before transferring to a wire rack to cool completely.\nServe slices of the cake with additional raspberries on top, if desired.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-white-chocolate-almond-cake.png"
  },
  {
    "title": "Lemon Thyme Roasted Vegetable Quinoa",
    "tag_names": [
      "Entrees",
      "Salads"
    ],
    "description": "A flavorful and healthy quinoa dish with roasted vegetables infused with lemon and thyme.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 cup quinoa\n2 cups vegetable broth\n1 zucchini, diced\n1 bell pepper, sliced\n1 red onion, chopped\n2 tablespoons olive oil\n1 lemon, juiced\n1 tablespoon fresh thyme leaves\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 400°F (200°C).\nIn a large bowl, toss the zucchini, bell pepper, and red onion with olive oil, lemon juice, thyme, salt, and pepper.\nSpread the vegetables on a baking sheet in a single layer and roast for 25-30 minutes or until tender and slightly caramelized, stirring halfway through.\nIn a saucepan, combine quinoa and vegetable broth. Bring to a boil, then reduce heat, cover, and simmer for 15-20 minutes or until the quinoa is cooked and fluffy.\nOnce the vegetables and quinoa are done, mix them together in a large bowl.\nAdjust seasoning if needed and serve hot as a side or a main dish.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-thyme-roasted-vegetable-quinoa.png"
  },
  {
    "title": "Blueberry Basil Balsamic Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing summer salad featuring the combination of sweet blueberries, fragrant basil, and tangy balsamic dressing.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "15 minutes",
    "ingredients": "6 cups mixed salad greens\n1 cup fresh blueberries\n1/4 cup chopped fresh basil leaves\n1/4 cup crumbled feta cheese\n1/4 cup balsamic vinaigrette\nSalt and pepper to taste",
    "instructions": "In a large salad bowl, combine the mixed greens, blueberries, chopped basil, and feta cheese.\nDrizzle the balsamic vinaigrette over the salad.\nToss gently to combine all ingredients.\nSeason with salt and pepper to taste.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-basil-balsamic-salad.png"
  },
  {
    "title": "Mushroom Spinach Feta Phyllo Cups",
    "tag_names": [
      "Appetizers"
    ],
    "description": "Delicious appetizers with a savory mixture of mushrooms, spinach, and feta cheese in a crispy phyllo cup.",
    "yield": "Makes 12 phyllo cups",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 package phyllo pastry cups\n1 cup sliced mushrooms\n1 cup chopped spinach\n1/2 cup crumbled feta cheese\n2 cloves garlic, minced\n1 tablespoon olive oil\nSalt and pepper to taste",
    "instructions": "Preheat oven to 350°F (175°C).\nIn a skillet, heat olive oil over medium heat. Add minced garlic and sauté until fragrant.\nAdd sliced mushrooms and cook until softened. Then, add chopped spinach and cook until wilted.\nSeason the mixture with salt and pepper to taste. Remove from heat and let it cool slightly.\nFill each phyllo pastry cup with the mushroom-spinach mixture. Top with crumbled feta cheese.\nBake in the preheated oven for about 15-20 minutes or until the phyllo cups are crispy and the feta is slightly melted.\nServe warm and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mushroom-spinach-feta-phyllo-cups.png"
  },
  {
    "title": "Moroccan Spiced Chickpea Stew",
    "tag_names": [
      "Entrees",
      "Soups"
    ],
    "description": "A hearty and flavorful stew with a blend of Moroccan spices and chickpeas, perfect for a cozy dinner.",
    "yield": "Serves 6",
    "active_time": "15 minutes",
    "total_time": "1 hour",
    "ingredients": "2 tablespoons olive oil\n1 onion, chopped\n3 cloves garlic, minced\n1 tablespoon ground cumin\n1 tablespoon ground coriander\n1 teaspoon smoked paprika\n1/2 teaspoon ground turmeric\n1/4 teaspoon cayenne pepper\n2 cans (15 oz each) chickpeas, drained and rinsed\n1 can (14.5 oz) diced tomatoes\n3 cups vegetable broth\n1/4 cup chopped fresh cilantro\nSalt and pepper to taste",
    "instructions": "In a large pot, heat olive oil over medium heat.\nAdd chopped onion and sauté until translucent, about 5 minutes.\nAdd minced garlic, ground cumin, ground coriander, smoked paprika, turmeric, and cayenne pepper. Cook for 1-2 minutes until fragrant.\nStir in chickpeas, diced tomatoes, and vegetable broth. Bring to a simmer and let cook for 30-40 minutes.\nSeason with salt and pepper to taste. Stir in fresh cilantro before serving.\nServe the Moroccan Spiced Chickpea Stew hot, optionally garnished with additional cilantro.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/moroccan-spiced-chickpea-stew.png"
  },
  {
    "title": "Strawberry Kiwi Coconut Popsicles",
    "tag_names": [
      "Desserts",
      "Beverages"
    ],
    "description": "Cool and refreshing popsicles made with fresh strawberries, kiwi, and coconut milk.",
    "yield": "Makes 6 popsicles",
    "active_time": "15 minutes",
    "total_time": "4 hours",
    "ingredients": "1 cup strawberries, hulled and chopped\n2 kiwis, peeled and sliced\n1 can (13.5 oz) coconut milk\n1/4 cup agave syrup or honey\nPopsicle molds\nPopsicle sticks",
    "instructions": "In a blender, combine the chopped strawberries, sliced kiwis, coconut milk, and agave syrup. Blend until smooth.\nPour the mixture into popsicle molds, filling each mold about 3/4 full.\nInsert popsicle sticks into the molds and freeze for at least 4 hours or until solid.\nTo unmold the popsicles, run the molds under warm water for a few seconds to loosen them.\nEnjoy the refreshing and tropical flavor of these homemade Strawberry Kiwi Coconut Popsicles!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/strawberry-kiwi-coconut-popsicles.png"
  },
  {
    "title": "Cinnamon Pecan Chia Seed Pudding",
    "tag_names": [
      "Breakfast",
      "Desserts"
    ],
    "description": "A creamy and nutritious pudding made with chia seeds, pecans, and a hint of cinnamon.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "4 hours",
    "ingredients": "1/4 cup chia seeds\n1 cup almond milk\n2 tbsp maple syrup\n1/4 tsp cinnamon\n1/4 cup chopped pecans",
    "instructions": "In a bowl, mix together chia seeds, almond milk, maple syrup, and cinnamon.\nCover and refrigerate for at least 4 hours or overnight.\nBefore serving, stir the pudding and top with chopped pecans.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/cinnamon-pecan-chia-seed-pudding.png"
  },
  {
    "title": "Acorn Squash Quinoa Stuffed Peppers",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "These Acorn Squash Quinoa Stuffed Peppers are a delicious and nutritious vegetarian meal that is sure to satisfy your taste buds.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "2 acorn squashes, halved and seeds removed\n1 cup quinoa, cooked\n1 can black beans, drained and rinsed\n1 red bell pepper, diced\n1 small onion, diced\n2 cloves garlic, minced\n1 teaspoon cumin\n1 teaspoon chili powder\nSalt and pepper to taste\n1/2 cup shredded cheddar cheese\nFresh cilantro for garnish",
    "instructions": "Preheat the oven to 375°F (190°C).\nPlace the acorn squash halves on a baking sheet, cut side down, and roast for 30-40 minutes until tender.\nIn a large skillet, sauté the onion and red bell pepper until softened. Add garlic, cumin, chili powder, salt, and pepper. Cook for another minute.\nStir in the cooked quinoa and black beans until well combined.\nRemove the acorn squash from the oven and carefully flip them over. Fill each squash half with the quinoa mixture.\nTop each stuffed squash with shredded cheddar cheese.\nBake for an additional 10-15 minutes until the cheese is melted and bubbly.\nGarnish with fresh cilantro before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/acorn-squash-quinoa-stuffed-peppers.png"
  },
  {
    "title": "Pistachio Orange Cardamom Cake",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "A flavorful and aromatic cake perfect for special occasions.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 1/2 cups all-purpose flour\n1 cup shelled pistachios, finely ground\n1 tsp ground cardamom\n1 tsp baking powder\n1/2 tsp baking soda\n1/2 tsp salt\n1 cup granulated sugar\n3 large eggs\n1/2 cup vegetable oil\n1/2 cup plain yogurt\nZest of 1 orange\nJuice of 1 orange\n1 tsp vanilla extract",
    "instructions": "Preheat the oven to 350°F (180°C). Grease and flour a 9-inch round cake pan.\nIn a mixing bowl, combine the flour, ground pistachios, cardamom, baking powder, baking soda, and salt.\nIn a separate bowl, beat the sugar and eggs until light and fluffy. Add the oil, yogurt, orange zest, orange juice, and vanilla extract. Mix well.\nGradually add the dry ingredients to the wet ingredients, mixing until just combined.\nPour the batter into the prepared pan and smooth the top.\nBake for 30-35 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the cake to cool in the pan for 10 minutes, then transfer to a wire rack to cool completely.\nServe slices of the cake with a sprinkle of powdered sugar and additional pistachios for garnish.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pistachio-orange-cardamom-cake.png"
  },
  {
    "title": "Ginger Sesame Shrimp Skewers",
    "tag_names": [
      "Appetizers",
      "Entrees"
    ],
    "description": "These shrimp skewers are marinated in a flavorful ginger sesame sauce and grilled to perfection. Perfect for a summer cookout!",
    "yield": "Makes 4 servings",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "1 pound large shrimp, peeled and deveined\n2 tablespoons soy sauce\n1 tablespoon sesame oil\n2 cloves garlic, minced\n1 tablespoon fresh ginger, grated\n1 tablespoon honey\n1 tablespoon rice vinegar\n1 teaspoon sriracha\nWooden skewers, soaked in water",
    "instructions": "In a small bowl, whisk together soy sauce, sesame oil, garlic, ginger, honey, rice vinegar, and sriracha.\nPlace the shrimp in a resealable plastic bag and pour the marinade over the shrimp. Seal the bag and marinate in the refrigerator for at least 30 minutes.\nPreheat the grill to medium-high heat.\nThread the marinated shrimp onto the soaked skewers.\nGrill the shrimp skewers for 2-3 minutes per side, or until the shrimp are cooked through and slightly charred.\nServe the shrimp skewers hot, garnished with sesame seeds and sliced green onions.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/ginger-sesame-shrimp-skewers.png"
  },
  {
    "title": "Pear Walnut Gorgonzola Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing salad with the perfect combination of sweet pears, crunchy walnuts, and tangy gorgonzola cheese.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "15 minutes",
    "ingredients": "6 cups mixed salad greens\n2 ripe pears, sliced\n1/2 cup crumbled gorgonzola cheese\n1/2 cup chopped walnuts\n1/4 cup balsamic vinegar\n1/4 cup extra virgin olive oil\n1 tablespoon honey\nSalt and pepper to taste",
    "instructions": "In a large salad bowl, combine the mixed salad greens, sliced pears, gorgonzola cheese, and walnuts.\nIn a small bowl, whisk together the balsamic vinegar, olive oil, honey, salt, and pepper to make the dressing.\nDrizzle the dressing over the salad and toss gently to coat.\nServe the pear walnut gorgonzola salad immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pear-walnut-gorgonzola-salad.png"
  },
  {
    "title": "Raspberry Lime Coconut Sorbet",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and tropical sorbet that combines the flavors of raspberry, lime, and coconut.",
    "yield": "Serves 6",
    "active_time": "20 minutes",
    "total_time": "4 hours",
    "ingredients": "3 cups fresh raspberries\n1 cup coconut milk\n1/2 cup fresh lime juice\n1 cup sugar\n1/4 cup water\n1/4 teaspoon salt",
    "instructions": "In a small saucepan, combine sugar, water, and salt. Heat over medium heat until sugar is dissolved, stirring occasionally. Remove from heat and let cool.\nIn a blender, combine raspberries, coconut milk, lime juice, and the cooled sugar syrup. Blend until smooth.\nPour the mixture through a fine-mesh sieve into a bowl, pressing down with a spatula to extract all the liquid. Discard the solids.\nCover the bowl and chill the mixture in the refrigerator for at least 2 hours.\nTransfer the chilled mixture to an ice cream maker and freeze according to the manufacturer's instructions.\nOnce the sorbet reaches a soft-serve consistency, transfer it to a lidded container and freeze for an additional 2 hours to firm up.\nServe the sorbet garnished with fresh raspberries and lime zest.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-lime-coconut-sorbet.png"
  },
  {
    "title": "Spinach Feta Stuffed Portobellos",
    "tag_names": [
      "Entrees",
      "Appetizers"
    ],
    "description": "Delicious portobello mushrooms stuffed with a savory mixture of spinach and feta cheese.",
    "yield": "Serves 2",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "2 large portobello mushrooms\n2 cups fresh spinach, chopped\n1/2 cup crumbled feta cheese\n2 cloves garlic, minced\n1 tablespoon olive oil\nSalt and pepper to taste",
    "instructions": "Preheat oven to 375°F (190°C).\nClean the portobello mushrooms and remove the stems.\nIn a skillet, heat olive oil over medium heat. Add garlic and sauté for 1 minute.\nAdd chopped spinach to the skillet and cook until wilted. Season with salt and pepper.\nRemove skillet from heat and stir in crumbled feta cheese.\nStuff the portobello mushrooms with the spinach and feta mixture.\nPlace stuffed mushrooms on a baking sheet and bake in the preheated oven for 20-25 minutes, until mushrooms are tender.\nServe hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spinach-feta-stuffed-portobellos.png"
  },
  {
    "title": "Chocolate Hazelnut Banana Bread",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious and moist banana bread with a rich chocolate and hazelnut twist.",
    "yield": "One loaf",
    "active_time": "20 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "2 ripe bananas, mashed\n1/3 cup melted butter\n1/2 cup granulated sugar\n1 egg, beaten\n1 teaspoon vanilla extract\n1 teaspoon baking soda\nPinch of salt\n1 cup all-purpose flour\n1/4 cup cocoa powder\n1/2 cup chopped hazelnuts",
    "instructions": "Preheat the oven to 350°F (175°C) and grease a 9x5 inch loaf pan.\nIn a mixing bowl, combine the mashed bananas, melted butter, sugar, egg, and vanilla extract.\nSprinkle the baking soda and salt over the banana mixture and mix in.\nAdd the flour and cocoa powder, stirring until just combined.\nFold in the chopped hazelnuts.\nPour the batter into the prepared loaf pan and smooth the top.\nBake in the preheated oven for 60-70 minutes, or until a toothpick inserted into the center comes out clean.\nAllow the banana bread to cool in the pan for 10 minutes before removing to a wire rack to cool completely.\nSlice and serve. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-hazelnut-banana-bread.png"
  },
  {
    "title": "Watermelon Peach Basil Salad",
    "tag_names": [
      "Salads",
      "Appetizers"
    ],
    "description": "A refreshing summer salad combining watermelon, juicy peaches, and fragrant basil.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups cubed watermelon\n2 peaches, sliced\n1/4 cup fresh basil leaves, torn\n2 tbsp honey\n1 tbsp lime juice\n1/4 cup crumbled feta cheese\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine the watermelon, peaches, and torn basil leaves.\nIn a small bowl, whisk together honey, lime juice, salt, and pepper to create the dressing.\nDrizzle the dressing over the salad and gently toss to combine.\nSprinkle the crumbled feta cheese on top before serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/watermelon-peach-basil-salad.png"
  },
  {
    "title": "Caprese Quinoa Stuffed Bell Peppers",
    "tag_names": [
      "Entrees",
      "Appetizers",
      "Salads"
    ],
    "description": "These colorful bell peppers are stuffed with a flavorful mix of quinoa, tomatoes, mozzarella cheese, and fresh basil, making for a delicious and nutritious meal.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 large bell peppers, any color\n1 cup quinoa, rinsed\n2 cups vegetable broth\n1 cup cherry tomatoes, halved\n1 cup fresh mozzarella, cubed\n1/4 cup fresh basil, chopped\n2 tbsp balsamic vinegar\nSalt and pepper to taste\nOlive oil for drizzling",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the tops off the bell peppers and remove the seeds and membranes.\nIn a saucepan, bring the vegetable broth to a boil. Add the quinoa, reduce heat, cover, and simmer for 15 minutes or until quinoa is cooked and liquid is absorbed.\nIn a mixing bowl, combine the cooked quinoa, cherry tomatoes, mozzarella, basil, balsamic vinegar, salt, and pepper.\nStuff the bell peppers with the quinoa mixture.\nPlace the stuffed bell peppers in a baking dish, drizzle with olive oil, and cover with foil.\nBake in the preheated oven for 25-30 minutes or until the peppers are tender.\nServe the stuffed bell peppers hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caprese-quinoa-stuffed-bell-peppers.png"
  },
  {
    "title": "Mango Coconut Chia Seed Pudding",
    "tag_names": [
      "Breakfast",
      "Desserts"
    ],
    "description": "A delicious and refreshing tropical dessert packed with health benefits.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "4 hours (including refrigeration time)",
    "ingredients": "1/4 cup chia seeds\n1 cup coconut milk\n1 cup chopped ripe mango\n2 tbsp honey or maple syrup\n1/2 tsp vanilla extract\nToasted coconut flakes and sliced mango for topping",
    "instructions": "In a bowl, mix chia seeds with coconut milk, honey, and vanilla extract. Stir well to combine.\nLet the mixture sit for 10 minutes, then stir again to prevent clumping.\nCover the bowl and refrigerate for at least 4 hours or overnight for the chia seeds to absorb the liquid and set.\nWhen ready to serve, layer the chia seed pudding with chopped mango and top with toasted coconut flakes and sliced mango.\nEnjoy the Mango Coconut Chia Seed Pudding chilled!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-coconut-chia-seed-pudding.png"
  },
  {
    "title": "Pecan Cranberry Orange Biscotti",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "Delicious biscotti with a delightful combination of pecans, cranberries, and orange zest.",
    "yield": "Makes about 24 biscotti",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "2 cups all-purpose flour\n1 cup sugar\n1 teaspoon baking powder\n1/2 teaspoon salt\n3 large eggs\n1/4 cup unsalted butter, melted\n1 teaspoon vanilla extract\n1/2 cup dried cranberries\n1/2 cup chopped pecans\nZest of 1 orange",
    "instructions": "Preheat the oven to 350°F (180°C). Line a baking sheet with parchment paper.\nIn a large bowl, whisk together flour, sugar, baking powder, and salt.\nIn another bowl, beat the eggs, melted butter, and vanilla extract until well combined.\nStir the egg mixture into the dry ingredients until a dough forms.\nFold in the cranberries, pecans, and orange zest.\nDivide the dough in half and shape each half into a log about 12 inches long and 2 inches wide.\nPlace the logs on the prepared baking sheet and bake for 25-30 minutes, until firm to the touch.\nRemove from the oven and let cool for 10 minutes. Reduce the oven temperature to 325°F (160°C).\nUsing a serrated knife, slice the logs into 1/2-inch slices. Place the slices cut-side down on the baking sheet.\nBake for an additional 15-20 minutes, flipping the biscotti halfway through, until dry and lightly golden.\nCool completely before serving. Enjoy your Pecan Cranberry Orange Biscotti!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pecan-cranberry-orange-biscotti.png"
  },
  {
    "title": "Lemon Herb Couscous Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A refreshing and flavorful salad that combines lemon, herbs, and fluffy couscous for a light and satisfying dish.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 cup couscous\n1 ½ cups vegetable broth\n1 lemon, juiced and zested\n2 tablespoons olive oil\n1/4 cup chopped fresh parsley\n1/4 cup chopped fresh mint\n1/4 cup chopped red onion\nSalt and pepper to taste",
    "instructions": "In a medium saucepan, bring the vegetable broth to a boil.\nStir in the couscous, cover, and remove from heat. Let it sit for 5 minutes.\nFluff the cooked couscous with a fork and transfer to a large mixing bowl.\nAdd lemon juice, lemon zest, olive oil, parsley, mint, and red onion to the couscous. Toss gently to combine.\nSeason with salt and pepper to taste.\nServe the Lemon Herb Couscous Salad chilled or at room temperature. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-herb-couscous-salad.png"
  },
  {
    "title": "Blackberry Bramble Blossom Tart",
    "tag_names": [
      "Desserts"
    ],
    "description": "A delightful tart bursting with the flavors of fresh blackberries and a hint of floral notes.",
    "yield": "Serves 8",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 1/2 cups all-purpose flour\n1/2 cup powdered sugar\n1/4 teaspoon salt\n1/2 cup unsalted butter, chilled and cubed\n1 large egg yolk\n1/4 cup cold water\n2 cups fresh blackberries\n1/4 cup granulated sugar\n2 tablespoons cornstarch\n1 teaspoon lemon zest\n1/4 teaspoon almond extract\n1 tablespoon milk\n1 tablespoon coarse sugar, for sprinkling",
    "instructions": "In a food processor, pulse together the flour, powdered sugar, and salt. Add the chilled butter and pulse until mixture resembles coarse crumbs.\nAdd the egg yolk and cold water, pulsing until the dough comes together. Shape into a disk, wrap in plastic, and refrigerate for 30 minutes.\nPreheat oven to 375°F (190°C). On a floured surface, roll out the dough into a circle and fit into a 9-inch tart pan. Trim excess dough and refrigerate for another 15 minutes.\nIn a bowl, gently toss together the blackberries, granulated sugar, cornstarch, lemon zest, and almond extract. Spoon the mixture into the prepared tart shell.\nBrush the edges of the tart with milk and sprinkle with coarse sugar.\nBake for 40-45 minutes, or until the crust is golden and the filling is bubbly. Allow to cool before slicing and serving.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blackberry-bramble-blossom-tart.png"
  },
  {
    "title": "Pumpkin Chai Spiced Muffins",
    "tag_names": [
      "Desserts",
      "Breads"
    ],
    "description": "These delicious muffins combine the flavors of pumpkin and chai spices, perfect for a cozy treat on a fall day.",
    "yield": "Makes 12 muffins",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 and 3/4 cups all-purpose flour\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1/2 teaspoon salt\n1 and 1/2 teaspoons ground cinnamon\n1 teaspoon ground ginger\n1/2 teaspoon ground cloves\n1/4 teaspoon ground nutmeg\n1/4 teaspoon ground cardamom\n1/2 cup granulated sugar\n1/4 cup packed brown sugar\n1/2 cup canned pumpkin puree\n1/2 cup vegetable oil\n2 large eggs\n1/2 cup milk\n1 teaspoon vanilla extract",
    "instructions": "Preheat the oven to 375°F (190°C). Line a 12-cup muffin tin with paper liners.\nIn a mixing bowl, whisk together the flour, baking powder, baking soda, salt, cinnamon, ginger, cloves, nutmeg, and cardamom.\nIn a separate bowl, whisk together the granulated sugar, brown sugar, pumpkin puree, vegetable oil, eggs, milk, and vanilla extract until well combined.\nPour the wet ingredients into the dry ingredients and mix until just combined. Do not overmix.\nDivide the batter evenly among the muffin cups, filling each about 3/4 full.\nBake in the preheated oven for 18-20 minutes, or until a toothpick inserted into the center of a muffin comes out clean.\nAllow the muffins to cool in the tin for 5 minutes before transferring them to a wire rack to cool completely. Enjoy your Pumpkin Chai Spiced Muffins!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pumpkin-chai-spiced-muffins.png"
  },
  {
    "title": "Raspberry Chocolate Greek Yogurt Bowls",
    "tag_names": [
      "Breakfast",
      "Desserts"
    ],
    "description": "Delicious and healthy yogurt bowls with the perfect combination of raspberry and chocolate flavors.",
    "yield": "Serves 2",
    "active_time": "10 minutes",
    "total_time": "15 minutes",
    "ingredients": "1 cup Greek yogurt\n1/2 cup fresh raspberries\n2 tbsp chocolate chips\n2 tbsp honey or maple syrup\n1/4 cup granola\n1 tbsp sliced almonds",
    "instructions": "In a bowl, layer Greek yogurt, fresh raspberries, and chocolate chips.\nDrizzle honey or maple syrup on top.\nSprinkle granola and sliced almonds over the yogurt mixture.\nEnjoy your delicious Raspberry Chocolate Greek Yogurt Bowl!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-chocolate-greek-yogurt-bowls.png"
  },
  {
    "title": "Lemon Basil Roasted Chicken Salad",
    "tag_names": [
      "Entrees",
      "Salads"
    ],
    "description": "A refreshing and flavorful salad combining the zesty taste of lemon with fragrant basil and tender roasted chicken.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "45 minutes",
    "ingredients": "2 boneless, skinless chicken breasts\n1 lemon\n1/4 cup fresh basil leaves\n2 tbsp olive oil\nSalt and pepper to taste\n4 cups mixed salad greens\n1/2 cup cherry tomatoes, halved\n1/4 cup sliced almonds",
    "instructions": "Preheat the oven to 400°F (200°C).\nZest and juice the lemon, then chop the basil leaves.\nIn a bowl, combine the lemon zest, lemon juice, chopped basil, olive oil, salt, and pepper.\nPlace the chicken breasts in a baking dish and pour the lemon basil mixture over them, ensuring they are well coated.\nRoast the chicken in the preheated oven for 25-30 minutes or until cooked through.\nRemove the chicken from the oven and let it rest for 5 minutes before slicing into strips.\nIn a large bowl, toss the mixed salad greens with cherry tomatoes and sliced almonds.\nDivide the salad onto serving plates and top with the sliced roasted chicken.\nDrizzle any remaining pan juices over the salads and serve immediately.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/lemon-basil-roasted-chicken-salad.png"
  },
  {
    "title": "Spicy Thai Coconut Curry Soup",
    "tag_names": [
      "Entrees",
      "Soups"
    ],
    "description": "A flavorful and aromatic soup with a perfect blend of spices, coconut, and vegetables.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 tbsp olive oil\n1 onion, chopped\n2 garlic cloves, minced\n1-inch piece of ginger, grated\n1 red bell pepper, sliced\n2 tbsp Thai red curry paste\n1 can (400ml) of coconut milk\n4 cups vegetable broth\n2 tbsp soy sauce\n2 tbsp lime juice\n2 tbsp brown sugar\n2 cups of mixed vegetables (such as broccoli, carrots, and snow peas)\nSalt and pepper to taste\nFresh cilantro for garnish",
    "instructions": "In a large pot, heat olive oil over medium heat. Add onion, garlic, and ginger, sauté until softened.\nAdd red curry paste and cook for 1-2 minutes until fragrant.\nStir in coconut milk, vegetable broth, soy sauce, lime juice, and brown sugar. Bring to a simmer.\nAdd mixed vegetables and simmer for 15-20 minutes until vegetables are tender.\nSeason with salt and pepper to taste.\nServe hot, garnished with fresh cilantro.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spicy-thai-coconut-curry-soup.png"
  },
  {
    "title": "Blueberry Almond Crumble Bars",
    "tag_names": [
      "Desserts",
      "Breakfast"
    ],
    "description": "Delicious bars with a layer of blueberry filling topped with almond crumble.",
    "yield": "Makes 12 bars",
    "active_time": "20 minutes",
    "total_time": "1 hour",
    "ingredients": "2 cups all-purpose flour\n1 cup granulated sugar\n1/2 teaspoon baking powder\n1/4 teaspoon salt\n1/2 cup unsalted butter, cold and cubed\n1 large egg\n1 teaspoon almond extract\n3 cups fresh blueberries\n1/4 cup granulated sugar\n1 tablespoon lemon juice\n2 tablespoons cornstarch\n1/2 cup sliced almonds",
    "instructions": "Preheat the oven to 375°F (190°C). Grease a 9x13-inch baking pan.\nIn a large mixing bowl, combine flour, 1 cup sugar, baking powder, and salt. Cut in the cold butter using a pastry cutter or fork until the mixture resembles coarse crumbs.\nAdd the egg and almond extract, and mix until the dough comes together.\nPress two-thirds of the dough into the bottom of the prepared pan to form a crust.\nIn another bowl, gently mix blueberries, 1/4 cup sugar, lemon juice, and cornstarch until the berries are coated.\nSpread the blueberry mixture over the crust in the pan.\nCrumble the remaining dough on top of the blueberries and sprinkle the sliced almonds over the crumble.\nBake for 40-45 minutes, or until the top is golden brown and the blueberries are bubbling.\nAllow the bars to cool completely in the pan before cutting into squares.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/blueberry-almond-crumble-bars.png"
  },
  {
    "title": "Sweet Potato Black Bean Quinoa Tacos",
    "tag_names": [
      "Entrees",
      "Lunch",
      "Appetizers"
    ],
    "description": "These vegan tacos are a delicious and nutritious twist on traditional tacos, combining sweet potatoes, black beans, and quinoa for a flavorful filling. Perfect for a meatless meal.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "45 minutes",
    "ingredients": "1 cup quinoa, cooked\n1 large sweet potato, peeled and diced\n1 can black beans, rinsed and drained\n1 teaspoon chili powder\n1 teaspoon cumin\n1/2 teaspoon paprika\nSalt and pepper to taste\n8 small corn tortillas\nToppings: avocado, salsa, cilantro, lime wedges",
    "instructions": "Preheat oven to 400°F (200°C).\nToss the diced sweet potato with a drizzle of olive oil, chili powder, cumin, paprika, salt, and pepper. Spread out on a baking sheet and roast for 20-25 minutes until tender and slightly crispy.\nIn a large bowl, combine the cooked quinoa, black beans, and roasted sweet potatoes. Adjust seasoning if needed.\nWarm the corn tortillas in a skillet or oven.\nAssemble the tacos by spooning the sweet potato mixture onto each tortilla. Top with avocado, salsa, cilantro, and a squeeze of lime juice.\nServe and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/sweet-potato-black-bean-quinoa-tacos.png"
  },
  {
    "title": "Strawberry Basil Balsamic Bruschetta",
    "tag_names": [
      "Appetizers",
      "Miscellaneous"
    ],
    "description": "A delightful and refreshing appetizer combining the sweetness of strawberries with the savory flavors of basil and balsamic vinegar on crispy bruschetta.",
    "yield": "Makes 6 servings",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "1 French baguette, sliced\n1 cup strawberries, diced\n1/4 cup fresh basil, thinly sliced\n2 tablespoons balsamic vinegar\n1 tablespoon olive oil\nSalt and pepper to taste",
    "instructions": "1. Preheat the oven to 375°F (190°C).\n2. Place the baguette slices on a baking sheet and drizzle with olive oil. Toast in the oven until lightly golden, about 5-7 minutes.\n3. In a bowl, combine the diced strawberries, sliced basil, balsamic vinegar, salt, and pepper. Mix well.\n4. Spoon the strawberry basil mixture onto the toasted baguette slices.\n5. Serve immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/strawberry-basil-balsamic-bruschetta.png"
  },
  {
    "title": "Pistachio Rosewater Cardamom Cupcakes",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicate and flavorful cupcakes infused with the wonderful combination of pistachio, rosewater, and cardamom.",
    "yield": "Makes 12 cupcakes",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "1 1/2 cups all-purpose flour\n1 1/2 tsp baking powder\n1/2 tsp salt\n1/2 cup unsalted butter, softened\n1 cup granulated sugar\n2 eggs\n1/2 cup milk\n1/4 cup pistachios, chopped\n1 tsp rosewater\n1/2 tsp ground cardamom",
    "instructions": "Preheat the oven to 350°F (175°C) and line a cupcake pan with paper liners.\nIn a bowl, whisk together flour, baking powder, and salt. Set aside.\nIn a separate bowl, cream butter and sugar until light and fluffy.\nAdd eggs one at a time, mixing well after each addition.\nMix in rosewater and ground cardamom.\nGradually add the dry ingredients to the wet ingredients, alternating with milk. Mix until just combined.\nFold in the chopped pistachios.\nDivide the batter evenly among the cupcake liners, filling each about 2/3 full.\nBake for 18-20 minutes or until a toothpick inserted into the center comes out clean.\nAllow the cupcakes to cool in the pan for 5 minutes before transferring to a wire rack to cool completely.\nEnjoy these delicious pistachio rosewater cardamom cupcakes!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pistachio-rosewater-cardamom-cupcakes.png"
  },
  {
    "title": "Ginger Lemongrass Coconut Rice Bowl",
    "tag_names": [
      "Lunch",
      "Entrees"
    ],
    "description": "A flavorful and aromatic rice bowl featuring ginger, lemongrass, and coconut flavors.",
    "yield": "Serves 4",
    "active_time": "20 minutes",
    "total_time": "40 minutes",
    "ingredients": "1 cup jasmine rice\n1 can (14 oz) coconut milk\n2 stalks lemongrass, crushed\n1 inch fresh ginger, sliced\n1/2 tsp salt\n1 tbsp coconut oil\nFresh cilantro, chopped (for garnish)\nLime wedges (for serving)",
    "instructions": "Rinse the jasmine rice until the water runs clear.\nIn a saucepan, combine the rinsed rice, coconut milk, crushed lemongrass, ginger slices, and salt.\nBring to a boil, then reduce heat to low, cover, and simmer for 20 minutes or until rice is cooked and liquid is absorbed.\nRemove from heat and let it sit covered for 10 minutes.\nDiscard the lemongrass and ginger slices, fluff the rice with a fork, and stir in coconut oil.\nDivide the rice into bowls, garnish with chopped cilantro, and serve with lime wedges on the side.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/ginger-lemongrass-coconut-rice-bowl.png"
  },
  {
    "title": "Pear Walnut Arugula Gorgonzola Salad",
    "tag_names": [
      "Salads"
    ],
    "description": "A delicious salad featuring sweet pears, crunchy walnuts, peppery arugula, and creamy gorgonzola cheese, dressed with a tangy vinaigrette.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "15 minutes",
    "ingredients": "4 cups arugula\n2 ripe pears, sliced\n1/2 cup crumbled gorgonzola cheese\n1/2 cup walnuts, toasted\n1/4 cup olive oil\n2 tablespoons balsamic vinegar\n1 tablespoon Dijon mustard\nSalt and pepper to taste",
    "instructions": "In a large bowl, combine arugula, sliced pears, gorgonzola cheese, and toasted walnuts.\nIn a small bowl, whisk together olive oil, balsamic vinegar, Dijon mustard, salt, and pepper to make the vinaigrette.\nDrizzle the vinaigrette over the salad and toss gently to combine.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/pear-walnut-arugula-gorgonzola-salad.png"
  },
  {
    "title": "Raspberry Mint Lime Agave Sorbet",
    "tag_names": [
      "Desserts"
    ],
    "description": "A refreshing and tangy sorbet with the perfect blend of raspberry, mint, lime, and agave sweetness.",
    "yield": "Makes about 1 quart",
    "active_time": "20 minutes",
    "total_time": "4 hours",
    "ingredients": "3 cups fresh raspberries\n1/4 cup fresh mint leaves\n1/2 cup lime juice\n1/2 cup agave nectar\n1/2 cup water",
    "instructions": "In a blender, combine raspberries, mint leaves, lime juice, agave nectar, and water. Blend until smooth.\nStrain the mixture through a fine mesh sieve to remove seeds and mint leaves.\nPour the strained mixture into an ice cream maker and churn according to the manufacturer's instructions.\nTransfer the sorbet to a container and freeze for at least 3 hours until firm.\nServe the sorbet garnished with fresh mint leaves or additional raspberries.",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/raspberry-mint-lime-agave-sorbet.png"
  },
  {
    "title": "Spinach Feta Stuffed Bell Pepper Boats",
    "tag_names": [
      "Entrees",
      "Appetizers",
      "Salads"
    ],
    "description": "These delicious bell pepper boats are filled with a savory mixture of spinach and feta cheese, making for a satisfying and flavorful meal.",
    "yield": "Serves 4",
    "active_time": "30 minutes",
    "total_time": "1 hour",
    "ingredients": "4 large bell peppers\n2 cups fresh spinach, chopped\n1/2 cup feta cheese, crumbled\n1/4 cup chopped red onion\n2 cloves garlic, minced\n1 tablespoon olive oil\nSalt and pepper to taste",
    "instructions": "Preheat the oven to 375°F (190°C).\nCut the tops off the bell peppers and remove the seeds and membranes.\nIn a skillet, heat olive oil over medium heat. Add garlic and onion, sauté until softened.\nAdd chopped spinach to the skillet and cook until wilted. Season with salt and pepper.\nRemove skillet from heat and stir in crumbled feta cheese.\nStuff each bell pepper with the spinach and feta mixture.\nPlace the stuffed bell peppers in a baking dish and cover with foil.\nBake in the preheated oven for 30-35 minutes, or until the peppers are tender.\nServe the spinach feta stuffed bell pepper boats hot and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/spinach-feta-stuffed-bell-pepper-boats.png"
  },
  {
    "title": "Chocolate Hazelnut Espresso Brownies",
    "tag_names": [
      "Desserts"
    ],
    "description": "Delicious brownies infused with the flavors of chocolate, hazelnut, and espresso.",
    "yield": "Makes 16 brownies",
    "active_time": "30 minutes",
    "total_time": "1 hour 30 minutes",
    "ingredients": "1 cup all-purpose flour\n1/2 cup unsweetened cocoa powder\n1/4 teaspoon salt\n1 cup semisweet chocolate chips\n1/2 cup unsalted butter\n1 and 1/4 cups granulated sugar\n3 large eggs\n2 teaspoons instant espresso powder\n1 teaspoon vanilla extract\n1/2 cup chopped hazelnuts",
    "instructions": "Preheat the oven to 350°F (180°C). Grease and line a 9x9-inch baking pan with parchment paper.\nIn a medium bowl, whisk together the flour, cocoa powder, and salt.\nIn a heatproof bowl, melt the chocolate chips and butter together in the microwave or over a double boiler, stirring until smooth.\nStir in the sugar, eggs, espresso powder, and vanilla extract into the chocolate mixture until well combined.\nFold in the flour mixture until just incorporated. Stir in the chopped hazelnuts.\nPour the batter into the prepared pan and smooth the top.\nBake in the preheated oven for 25-30 minutes, or until a toothpick inserted into the center comes out with a few moist crumbs.\nAllow the brownies to cool in the pan before cutting into squares. Enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/chocolate-hazelnut-espresso-brownies.png"
  },
  {
    "title": "Watermelon Mint Feta Herb Salad",
    "tag_names": [
      "Salads",
      "Appetizers"
    ],
    "description": "A refreshing and flavorful salad combining the sweetness of watermelon with the tanginess of feta cheese and the freshness of mint and herbs.",
    "yield": "Serves 4",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "4 cups cubed watermelon\n1/2 cup crumbled feta cheese\n1/4 cup chopped fresh mint leaves\n2 tbsp chopped fresh basil leaves\n2 tbsp chopped fresh parsley\n1/4 cup extra-virgin olive oil\n2 tbsp balsamic vinegar\nSalt and pepper to taste",
    "instructions": "1. In a large bowl, combine the cubed watermelon, crumbled feta cheese, mint, basil, and parsley.\n2. In a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.\n3. Drizzle the dressing over the watermelon mixture and gently toss to combine.\n4. Serve chilled and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/watermelon-mint-feta-herb-salad.png"
  },
  {
    "title": "Caprese Tomato Basil Mozzarella Skewers",
    "tag_names": [
      "Appetizers",
      "Entrees"
    ],
    "description": "A delightful appetizer that combines the classic flavors of Caprese salad in a bite-sized skewer.",
    "yield": "Makes 12 skewers",
    "active_time": "15 minutes",
    "total_time": "30 minutes",
    "ingredients": "12 cherry tomatoes\n12 fresh basil leaves\n12 mini mozzarella balls\nBalsamic glaze\nSalt and pepper to taste\n12 small skewers or toothpicks",
    "instructions": "Wash and dry the cherry tomatoes and basil leaves.\nThread a cherry tomato, a folded basil leaf, and a mini mozzarella ball onto each skewer.\nArrange the skewers on a serving platter.\nDrizzle with balsamic glaze and season with salt and pepper.\nServe immediately and enjoy!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/caprese-tomato-basil-mozzarella-skewers.png"
  },
  {
    "title": "Mango Pineapple Coconut Chia Popsicles",
    "tag_names": [
      "Desserts",
      "Beverages"
    ],
    "description": "A refreshing and tropical treat perfect for hot summer days.",
    "yield": "Makes 8 popsicles",
    "active_time": "15 minutes",
    "total_time": "4 hours",
    "ingredients": "1 cup diced mango\n1 cup diced pineapple\n1 can (13.5 oz) coconut milk\n2 tablespoons chia seeds\n2-3 tablespoons honey or agave syrup\n1 teaspoon vanilla extract",
    "instructions": "In a blender, combine diced mango, diced pineapple, coconut milk, chia seeds, honey or agave syrup, and vanilla extract.\nBlend until smooth and well combined.\nPour the mixture into popsicle molds.\nInsert popsicle sticks and freeze for at least 4 hours or until fully set.\nTo release the popsicles, run the molds under warm water for a few seconds.\nEnjoy these delicious Mango Pineapple Coconut Chia Popsicles on a hot day!",
    "image": "https://recipe-thyme-content.s3.us-west-1.amazonaws.com/recipes/mango-pineapple-coconut-chia-popsicles.png"
  }
]